http://www.wikidata.org/entity/Q3760996		http://www.wikidata.org/entity/Q182955	
http://www.wikidata.org/entity/Q3960012		http://www.wikidata.org/entity/Q182955	
http://www.wikidata.org/entity/Q3802366		http://www.wikidata.org/entity/Q182955	
http://www.wikidata.org/entity/Q4023582		http://www.wikidata.org/entity/Q182955	
http://www.wikidata.org/entity/Q4009316		http://www.wikidata.org/entity/Q2943	

  { 
    time    0.0018% fanout         1 input         1 rows
      clear: (<V set_ctr$35 in>)
    s# 59 36 cluster outer seq start, set no <V set_ctr$35 in>    
    save ctx:()
    time     0.025% fanout         5 input         1 rows
      clear: (<V t1.S$28 rn>)
      clear on continue: (<V t1.S$28 rn>)
    s# 68 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS          5 rows   
    Key RDF_QUAD_POGS  ASC  (<V t1.S$28 rn>)
     P =  IRI_ID"...direct/P276"  ,  O =  IRI_ID"...Q2943" 
    
    time      0.12% fanout         1 input         5 rows
    Precode:
      0: <V var1$30 a> := Call __id2in (<V t1.S$28 rn>)
      5: BReturn 0
      clear: (<V set_ctr$38 i>, <V var1$30 a>)
    s# 78 42 cluster outer seq start, set no <V set_ctr$38 i>    
    save ctx:()
    time     1e+02% fanout         1 input         5 rows
      clear: (<V t3.O$33 a>)
      clear on continue: (<V t3.O$33 a>)$28 (42 ) $91 (32 ) 
    s# 87 32 from DB.DBA.RDF_QUAD by RDF_QUAD        1.1 rows   
    Key RDF_QUAD  ASC  (<V t3.O$33 a>)
     inlined  P =  IRI_ID"...direct/P195"  ,  S = <v k_t1.S$91 Set93 rn>
    vector param casts: <r t1.S$28 via  Set78>-> <v k_t1.S$91 Set93 rn>
    
    time    0.0028% fanout         1 input         5 rows
    $38 (32 42 ) 
    s# 101 37 end of outer seq <r set_ctr$38 via  Set87 Set93>
     out: (<V t3.O$33 a>)
     shadow: ( <none> )
    time      0.07% fanout         1 input         5 rows
      clear: (<V var3$47 a>)$33 (37 ) 
    s# 109 57 skip node  100  <none> <r set_ctr$35 via  Set101 Set68>
    After code:
      0: <V var3$47 a> := Call __ro2sq (<r t3.O$33 via  Set109>)
      5: BReturn 0
    time   0.00038% fanout         0 input         5 rows
    $35 (57 37 32 42 27 36 ) $47 (57 ) $30 (57 37 32 42 ) 
    s# 117 49 Select (<r var1$30 via  Set109 Set101>, <DB_NULL>, <V var3$47 a>)
      set no: <r set_ctr$35 via  Set109 Set101 Set68>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 134 msec 90% cpu,        15 rnd         4 seq     18.75% same seg      12.5% same pg 
4 disk reads, 0 read ahead,   38.3445% wait
Compilation: 13 msec 1 reads   8.37338% read 0 messages         0% clw
