http://www.wikidata.org/entity/Q15442722	
http://www.wikidata.org/entity/Q16885680	
http://www.wikidata.org/entity/Q20605671	
http://www.wikidata.org/entity/Q20606121	
http://www.wikidata.org/entity/Q21623152	
http://www.wikidata.org/entity/Q27824674	
http://www.wikidata.org/entity/Q34027754	
http://www.wikidata.org/entity/Q916259	
http://www.wikidata.org/entity/Q27448068	
http://www.wikidata.org/entity/Q79050967	
http://www.wikidata.org/entity/Q27671111	
http://www.wikidata.org/entity/Q27906132	
http://www.wikidata.org/entity/Q27906285	
http://www.wikidata.org/entity/Q4785285	
http://www.wikidata.org/entity/Q4858134	
http://www.wikidata.org/entity/Q7404542	
http://www.wikidata.org/entity/Q21152713	
http://www.wikidata.org/entity/Q21483919	
http://www.wikidata.org/entity/Q27913807	
http://www.wikidata.org/entity/Q27917816	

  { 
    time     0.052% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.011% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        12% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS      2e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1995-01-01 00:00:00Z> <= <tag 211 c 1995-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1995-01-01 00:00:00Z> <= <tag 211 c 1995-12-31 23:59:59Z>
    
    time       4.2% fanout     0.995 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        84% fanout         1 input       995 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.013% fanout         0 input       995 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 7 msec 63% cpu,       398 rnd      5507 seq         0% same seg   15.2882% same pg 
Compilation: 4 msec 0 reads         0% read 0 messages         0% clw
