
  { 
    time       2.3% fanout         1 input         1 rows
      clear: (<V set_ctr$46 in>)
    s# 52 47 cluster outer seq start, set no <V set_ctr$46 in>    
    save ctx:()
    time        34% fanout         7 input         1 rows
      clear: (<V s_37_6_t2.S$28 rn>)
      clear on continue: (<V s_37_6_t2.S$28 rn>)
    s# 61 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS          7 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t2.S$28 rn>)
     P =  IRI_ID"...direct/P706"  ,  O =  IRI_ID"...Q664609" 
    
    time        64% fanout         0 input         7 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:     0.039 Fanout:         0
      clear: (<V s_37_6_t0.S$31 rn>)
      clear on continue: (<V s_37_6_t0.S$31 rn>)$28 () 
    s# 71 30 from DB.DBA.RDF_QUAD by RDF_QUAD      0.039 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t0.S$31 rn>)
     inlined  P =  IRI_ID"...direct/P106"  ,  S = <V s_37_6_t2.S$28 rn> ,  O =  IRI_ID"...Q36180" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.1 Fanout:         0
    Precode:
      0: <V var1$33 a> := Call __id2in (<V s_37_6_t0.S$31 rn>)
      5: BReturn 0
      clear: (<V s_37_6_t1.O$36 an>, <V var1$33 a>)
      clear on continue: (<V s_37_6_t1.O$36 an>)$31 () 
    s# 81 35 from DB.DBA.RDF_QUAD by RDF_QUAD        1.1 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t1.O$36 an>)
     inlined  P =  IRI_ID"...direct/P27"  ,  S = <V s_37_6_t0.S$31 rn>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var2$38 a>)$36 () 
    s# 91 50 skip node  10  <none> <r set_ctr$46 via  Set81 Set71 Set61>
    After code:
      0: <V var2$38 a> := Call __ro2sq (<r s_37_6_t1.O$36 via  Set91>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $33 (50 35 ) $38 (50 ) $46 (50 35 30 27 47 ) 
    s# 99 40 Select (<r var1$33 via  Set91 Set81>, <V var2$38 a>)
      set no: <r set_ctr$46 via  Set91 Set81 Set71 Set61>
  }
Warning: You might have a Cartesian product.



 0 msec 7% cpu,         8 rnd         6 seq   44.4444% same seg   11.1111% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
