http://www.wikidata.org/entity/Q2640048	
http://www.wikidata.org/entity/Q2796931	
http://www.wikidata.org/entity/Q2863033	
http://www.wikidata.org/entity/Q2920559	
http://www.wikidata.org/entity/Q2978057	
http://www.wikidata.org/entity/Q3069456	
http://www.wikidata.org/entity/Q3123980	
http://www.wikidata.org/entity/Q3125854	
http://www.wikidata.org/entity/Q3172906	
http://www.wikidata.org/entity/Q3173221	
http://www.wikidata.org/entity/Q3176403	
http://www.wikidata.org/entity/Q15914112	
http://www.wikidata.org/entity/Q15914280	
http://www.wikidata.org/entity/Q15917124	
http://www.wikidata.org/entity/Q16106528	
http://www.wikidata.org/entity/Q16106541	
http://www.wikidata.org/entity/Q16106643	
http://www.wikidata.org/entity/Q16106649	
http://www.wikidata.org/entity/Q16106761	
http://www.wikidata.org/entity/Q16106780	

  { 
    time     0.041% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time    0.0083% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        11% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS      1e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1944-01-01 00:00:00Z> <= <tag 211 c 1944-01-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1944-01-01 00:00:00Z> <= <tag 211 c 1944-01-31 23:59:59Z>
    
    time       3.2% fanout     0.996 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        86% fanout         1 input       996 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.013% fanout         0 input       996 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 6 msec 72% cpu,       946 rnd      6770 seq         0% same seg   16.6843% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
