http://www.wikidata.org/entity/Q2615500	
http://www.wikidata.org/entity/Q30919272	
http://www.wikidata.org/entity/Q2707994	
http://www.wikidata.org/entity/Q3069904	
http://www.wikidata.org/entity/Q15893013	
http://www.wikidata.org/entity/Q7148059	
http://www.wikidata.org/entity/Q178122	
http://www.wikidata.org/entity/Q183862	
http://www.wikidata.org/entity/Q185162	
http://www.wikidata.org/entity/Q2532274	
http://www.wikidata.org/entity/Q3840596	
http://www.wikidata.org/entity/Q936573	
http://www.wikidata.org/entity/Q2599472	
http://www.wikidata.org/entity/Q383904	
http://www.wikidata.org/entity/Q384064	
http://www.wikidata.org/entity/Q965635	
http://www.wikidata.org/entity/Q500879	
http://www.wikidata.org/entity/Q1737332	
http://www.wikidata.org/entity/Q1524033	
http://www.wikidata.org/entity/Q2164565	

  { 
    time       1.3% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$49 a>)
    s# 69 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        24% fanout       471 input         1 rows
          clear: (<V s_37_2_t0.S$31 rn>)
          clear on continue: (<V s_37_2_t0.S$31 rn>)
        s# 73 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    4.7e+02 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
         P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q188451" 
        
        time        69% fanout  0.993631 input       471 rows
        
        s# 83 33 Distinct (HASH) set no <r set_no$29 via  Set73>(<V s_37_2_t0.S$31 rn>)
        time         5% fanout         1 input       468 rows
          clear: (<V var1$28 rn>)$31 (33 ) 
        s# 91 47 skip node  10000  <none> <r set_no$29 via  Set83 Set73>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set91 Set83>
          4: BReturn 0
        time      0.41% fanout         0 input       468 rows
        
        s# 69 39 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set91 Set83 Set73>
      }
    
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.18% fanout         0 input       468 rows
    $49 (27 ) $57 (27 58 ) 
    s# 107 51 Select (<V var1$49 a>)
      set no: <r set_ctr$57 via  Set69>
  }
Warning: You might have a Cartesian product.



 22 msec 94% cpu,       455 rnd       470 seq         0% same seg   12.9386% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
