http://www.w3.org/1999/02/22-rdf-syntax-ns#type	
http://www.openlinksw.com/schemas/virtrdf#version	
http://www.openlinksw.com/schemas/virtrdf#loadAs	
http://www.openlinksw.com/schemas/virtrdf#item	
http://www.openlinksw.com/schemas/virtrdf#isSpecialPredicate	
http://www.openlinksw.com/schemas/virtrdf#isGcResistantType	
http://www.openlinksw.com/schemas/virtrdf#qmfName	
http://www.openlinksw.com/schemas/virtrdf#qmfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfLongTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfSqlvalTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfBoolTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfIsrefOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfIsuriOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfIsblankOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfIslitOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmf01uriOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmf01blankOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfLongOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfSqlvalOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfDatatypeOfShortTmpl	

  { 
    time   0.00074% fanout         1 input         1 rows
      clear: (<V set_ctr$56 in>)
    s# 59 57 cluster outer seq start, set no <V set_ctr$56 in>    
    save ctx:()
    time   0.00016% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 68 47 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time         8% fanout 1.2189e+07 input         1 rows
      clear: (<V s_5_2_t0.P$31 rn>)
      clear on continue: (<V s_5_2_t0.P$31 rn>)
    s# 77 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    9.4e+07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_5_2_t0.P$31 rn>)
    
    
    time        92% fanout 3.28165e-06 input 1.2189e+07 rows
      clear: (<V p$28 rn>)$31 () 
    s# 87 34 Distinct (HASH) set no <r set_no$29 via  Set77>(<V s_5_2_t0.P$31 rn>)
    After code:
      0: <V p$28 rn> :=  := artm <r s_5_2_t0.P$31 via  Set87>
      4: BReturn 0
    time     0.061% fanout         1 input        40 rows
      clear: (<V p$48 a>)$28 (34 ) $29 (34 30 47 ) 
    s# 96 40 Subquery Select(<V p$28 rn>)
      set no: <r set_no$29 via  Set87 Set77>
    After code:
      0: <V p$48 a> := Call __ro2sq (<V p$28 rn>)
      5: BReturn 0
    time   0.00038% fanout         0 input        40 rows
    $48 (40 ) $56 (40 34 30 47 57 ) 
    s# 103 50 Select (<V p$48 a>)
      set no: <r set_ctr$56 via  Set96>
  }
Warning: You might have a Cartesian product.



 447 msec 99% cpu,        21 rnd 1.2176e+07 seq         0% same seg   86.3636% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
