http://www.wikidata.org/entity/Q6378832	
http://www.wikidata.org/entity/Q7197966	
http://www.wikidata.org/entity/Q21757017	
http://www.wikidata.org/entity/Q4210017	
http://www.wikidata.org/entity/Q2365272	
http://www.wikidata.org/entity/Q5261293	
http://www.wikidata.org/entity/Q4100798	
http://www.wikidata.org/entity/Q4445416	
http://www.wikidata.org/entity/Q4451915	
http://www.wikidata.org/entity/Q4463323	
http://www.wikidata.org/entity/Q3635824	
http://www.wikidata.org/entity/Q4068438	
http://www.wikidata.org/entity/Q4074709	
http://www.wikidata.org/entity/Q4078955	
http://www.wikidata.org/entity/Q4520508	
http://www.wikidata.org/entity/Q4305037	
http://www.wikidata.org/entity/Q5088055	
http://www.wikidata.org/entity/Q5155471	
http://www.wikidata.org/entity/Q8065098	
http://www.wikidata.org/entity/Q3181093	

  { 
    time      0.56% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.074% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time       7.7% fanout        56 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         56 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q620471" 
    
    time        17% fanout         1 input        56 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        74% fanout         1 input        56 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.14% fanout         0 input        56 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 1 msec 1% cpu,        57 rnd        55 seq         0% same seg   48.2759% same pg 
Compilation: 27 msec 0 reads         0% read 0 messages         0% clw
