http://www.wikidata.org/entity/Q3178693	
http://www.wikidata.org/entity/Q7177003	
http://www.wikidata.org/entity/Q24851957	
http://www.wikidata.org/entity/Q3369504	
http://www.wikidata.org/entity/Q12168794	
http://www.wikidata.org/entity/Q4755200	
http://www.wikidata.org/entity/Q6409091	
http://www.wikidata.org/entity/Q1385250	
http://www.wikidata.org/entity/Q4496740	
http://www.wikidata.org/entity/Q5997886	
http://www.wikidata.org/entity/Q11655779	
http://www.wikidata.org/entity/Q28845689	
http://www.wikidata.org/entity/Q3430494	
http://www.wikidata.org/entity/Q13635547	
http://www.wikidata.org/entity/Q7182352	
http://www.wikidata.org/entity/Q229134	
http://www.wikidata.org/entity/Q11482130	
http://www.wikidata.org/entity/Q26971241	
http://www.wikidata.org/entity/Q5112099	
http://www.wikidata.org/entity/Q7823367	

  { 
    time     0.015% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.003% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time       7.8% fanout       249 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    2.5e+02 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1952-05-01 00:00:00Z> <= <tag 211 c 1952-05-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1952-05-01 00:00:00Z> <= <tag 211 c 1952-05-31 23:59:59Z>
    
    time      0.64% fanout         1 input       249 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        92% fanout         1 input       249 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time    0.0022% fanout         0 input       249 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 25 msec 87% cpu,       244 rnd     10781 seq         0% same seg   5.30612% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
