
  { 
    time        11% fanout         1 input         1 rows
      clear: (<V set_ctr$46 in>)
    s# 49 47 cluster outer seq start, set no <V set_ctr$46 in>    
    save ctx:()
    time        89% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t2.S$28 rn>, <V s_37_6_t2.O$29 an>)
      clear on continue: (<V s_37_6_t2.S$28 rn>, <V s_37_6_t2.O$29 an>)
    s# 58 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t2.O$29 an>, <V s_37_6_t2.S$28 rn>)
     inlined  P =  IRI_ID"...direct/p69" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   0.00028 Fanout:         0
      clear: (<V s_37_6_t0.S$32 rn>)
      clear on continue: (<V s_37_6_t0.S$32 rn>)$73 (31 ) $29 () 
    s# 69 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    0.00028 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t0.S$32 rn>)
     inlined  P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q3918"  ,  S = <v k_s_37_6_t2.O$73 Set75 rn>
    vector param casts: <V s_37_6_t2.O$29 an>-> <v k_s_37_6_t2.O$73 Set75 rn>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:     0.003 Fanout:         0
      clear: (<V var1$38 a>, <V var2$36 a>)
      clear on continue: (<V var1$38 a>, <V var2$36 a>)$32 () $28 (31 ) 
    s# 83 34 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS      0.003 rows   
    Key RDF_QUAD_POGS  ASC  ()
     inlined  P =  IRI_ID"...direct/P17"  ,  O =  IRI_ID"...Q298"  ,  S = <V s_37_6_t0.S$32 rn>
    
    After code:
      0: <V var2$36 a> := Call __id2in (<r s_37_6_t0.S$32 via  Set83>)
      5: <V var1$38 a> := Call __id2in (<r s_37_6_t2.S$28 via  Set83 Set69 Set75>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $36 () $38 () $46 (34 31 27 47 ) 
    s# 92 40 Select (<V var1$38 a>, <V var2$36 a>)
      set no: <r set_ctr$46 via  Set83 Set69 Set75 Set58>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 123 msec 0 reads         0% read 0 messages         0% clw
