http://www.wikidata.org/entity/Q17859635				
http://www.wikidata.org/entity/Q18034959				
http://www.wikidata.org/entity/Q18035049				
http://www.wikidata.org/entity/Q18040602				
http://www.wikidata.org/entity/Q18041137				
http://www.wikidata.org/entity/Q18041520				
http://www.wikidata.org/entity/Q18041733				
http://www.wikidata.org/entity/Q18049490				
http://www.wikidata.org/entity/Q18052491				
http://www.wikidata.org/entity/Q18053373				
http://www.wikidata.org/entity/Q18053535				
http://www.wikidata.org/entity/Q14881706				
http://www.wikidata.org/entity/Q18024958				
http://www.wikidata.org/entity/Q18046015				
http://www.wikidata.org/entity/Q14880807				
http://www.wikidata.org/entity/Q18035948				
http://www.wikidata.org/entity/Q5458077				
http://www.wikidata.org/entity/Q5470358				
http://www.wikidata.org/entity/Q18029827				
http://www.wikidata.org/entity/Q18029963				

  { 
    time      0.17% fanout         1 input         1 rows
      clear: (<V set_ctr$40 in>)
    s# 43 41 cluster outer seq start, set no <V set_ctr$40 in>    
    save ctx:()
    time       4.4% fanout      1000 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.6e+04 Fanout:     1e+03
      clear: (<V s_37_4_t0.S$28 rn>)
      clear on continue: (<V s_37_4_t0.S$28 rn>)
    s# 52 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.6e+04 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$28 rn>)
     P =  IRI_ID"...direct/P703"  ,  O =  IRI_ID"...Q15978631" 
    
    time        95% fanout      0.12 input      1000 rows
      clear: (<V var1$32 a>)
      clear on continue: (<V var1$32 a>)$28 () 
    s# 62 30 from DB.DBA.RDF_QUAD by RDF_QUAD      0.015 rows   
    Key RDF_QUAD  ASC  ()
     inlined  P =  IRI_ID"...direct/P31"  ,  S = <V s_37_4_t0.S$28 rn> ,  O =  IRI_ID"...Q7187" 
    
    After code:
      0: <V var1$32 a> := Call __id2in (<r s_37_4_t0.S$28 via  Set62>)
      5: BReturn 0
    time     0.043% fanout         0 input       120 rows
    $32 () $40 (30 27 41 ) 
    s# 71 34 Select (<V var1$32 a>, <DB_NULL>, <DB_NULL>, <DB_NULL>)
      set no: <r set_ctr$40 via  Set62 Set52>
  }
Warning: You might have a Cartesian product.



 2 msec 51% cpu,      1011 rnd       998 seq   95.9486% same seg   2.66798% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
