http://www.wikidata.org/entity/Q189841	
http://www.wikidata.org/entity/Q191016	
http://www.wikidata.org/entity/Q192556	
http://www.wikidata.org/entity/Q245385	
http://www.wikidata.org/entity/Q154824	
http://www.wikidata.org/entity/Q179888	
http://www.wikidata.org/entity/Q212955	
http://www.wikidata.org/entity/Q1254	
http://www.wikidata.org/entity/Q54129	
http://www.wikidata.org/entity/Q997	
http://www.wikidata.org/entity/Q23685	
http://www.wikidata.org/entity/Q32732	
http://www.wikidata.org/entity/Q33866	
http://www.wikidata.org/entity/Q193672	
http://www.wikidata.org/entity/Q133308	
http://www.wikidata.org/entity/Q743558	
http://www.wikidata.org/entity/Q325523	

  { 
    time       1.8% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$49 a>)
    s# 69 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        31% fanout        20 input         1 rows
          clear: (<V s_37_2_t0.S$31 rn>)
          clear on continue: (<V s_37_2_t0.S$31 rn>)
        s# 73 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         20 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
         P =  IRI_ID"...direct/P166"  ,  O =  IRI_ID"...Q35637" 
        
        time        63% fanout      0.85 input        20 rows
        
        s# 83 33 Distinct (HASH) set no <r set_no$29 via  Set73>(<V s_37_2_t0.S$31 rn>)
        time       3.2% fanout         1 input        17 rows
          clear: (<V var1$28 rn>)$31 (33 ) 
        s# 91 47 skip node  1000  <none> <r set_no$29 via  Set83 Set73>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set91 Set83>
          4: BReturn 0
        time      0.54% fanout         0 input        17 rows
        
        s# 69 39 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set91 Set83 Set73>
      }
    
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.49% fanout         0 input        17 rows
    $49 (27 ) $57 (27 58 ) 
    s# 107 51 Select (<V var1$49 a>)
      set no: <r set_ctr$57 via  Set69>
  }
Warning: You might have a Cartesian product.



 0 msec 22% cpu,        10 rnd        19 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
