
  { 
    time       8.3% fanout         1 input         1 rows
      clear: (<V set_ctr$48 in>)
    s# 51 49 cluster outer seq start, set no <V set_ctr$48 in>    
    save ctx:()
    time        92% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_4_t1.S$28 rn>)
      clear on continue: (<V s_37_4_t1.S$28 rn>)
    s# 60 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t1.S$28 rn>)
     P =  IRI_ID"...statement/P135"  ,  O =  IRI_ID"...Q878985" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       2.8 Fanout:         0
      clear: (<V s_37_4_t0.P$31 rn>)
      clear on continue: (<V s_37_4_t0.P$31 rn>)$74 (30 ) 
    s# 70 30 from DB.DBA.RDF_QUAD by RDF_QUAD_OP        2.8 rows   
    Key RDF_QUAD_OP  ASC  (<V s_37_4_t0.P$31 rn>)
     inlined  O = <v cast$74 Set76 an>
    vector param casts: <V s_37_4_t1.S$28 rn>-> <v cast$74 Set76 an>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.2 Fanout:         0
      clear: (<V s_37_4_t0.S$35 rn>, <V var2$40 a>, <V var1$38 a>)
      clear on continue: (<V var1$38 a>, <V var2$40 a>, <V s_37_4_t0.S$35 rn>)$31 () $88 (34 ) $28 (30 ) 
    s# 84 34 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        1.2 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$35 rn>)
     P = <V s_37_4_t0.P$31 rn> ,  O = <v k_s_37_4_t1.S$88 Set90 an>
    vector param casts: <r s_37_4_t1.S$28 via  Set70 Set76>-> <v k_s_37_4_t1.S$88 Set90 an>
    
    After code:
      0: <V var1$38 a> := Call __id2in (<V s_37_4_t0.S$35 rn>)
      5: <V var2$40 a> := Call __id2in (<r s_37_4_t0.P$31 via  Set84 Set90>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $38 () $40 () $48 (34 30 27 49 ) 
    s# 98 42 Select (<V var1$38 a>, <V var2$40 a>)
      set no: <r set_ctr$48 via  Set84 Set90 Set70 Set76 Set60>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 7 msec 0 reads         0% read 0 messages         0% clw
