OpenLink Virtuoso Interactive SQL (Virtuoso)
Version 07.20.3232 as of May 11 2021
Type HELP; for help and EXIT; to exit.
Connected to OpenLink Virtuoso
Driver: 07.20.3232 OpenLink Virtuoso ODBC Driver
}SPARQL_TO_SQL_TEXT
LONG VARCHAR
_______________________________________________________________________________

 SELECT  __ro2sq ("s_15_3_rbc"."Concept") AS "Concept" FROM (SELECT DISTINCT TOP 100 "s_15_3_t0"."O" AS "Concept"
  FROM DB.DBA.RDF_QUAD AS "s_15_3_t0"
  WHERE
    "s_15_3_t0"."P" = __i2idn ( __bft( 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type' , 1))
OPTION (QUIETCAST)) AS "s_15_3_rbc"

1 Rows. -- 2 msec.

Done. -- 1 msec.

Done. -- 1 msec.
result
LONG VARCHAR
_______________________________________________________________________________

http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat	
http://www.openlinksw.com/schemas/virtrdf#QuadStorage	
http://www.openlinksw.com/schemas/virtrdf#array-of-QuadMapFormat	
http://www.openlinksw.com/schemas/virtrdf#QuadMap	
http://www.openlinksw.com/schemas/virtrdf#QuadMapValue	
http://www.openlinksw.com/schemas/virtrdf#array-of-QuadMapColumn	
http://www.openlinksw.com/schemas/virtrdf#QuadMapColumn	
http://www.openlinksw.com/schemas/virtrdf#array-of-QuadMapATable	
http://www.openlinksw.com/schemas/virtrdf#QuadMapATable	
http://www.openlinksw.com/schemas/virtrdf#QuadMapFText	
http://www.openlinksw.com/schemas/virtrdf#array-of-string	
http://www.openlinksw.com/schemas/virtrdf#array-of-QuadMap	
http://www.w3.org/2002/07/owl#SymmetricProperty	
http://www.w3.org/2002/07/owl#FunctionalProperty	
http://www.w3.org/1999/02/22-rdf-syntax-ns#Property	
http://www.w3.org/2002/07/owl#Class	
http://www.w3.org/2002/07/owl#Ontology	
http://www.w3.org/2000/01/rdf-schema#Class	
http://www.w3.org/2002/07/owl#OntologyProperty	
http://www.w3.org/2002/07/owl#AnnotationProperty	

  { 
    time       1.7% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
      clear: (<V Concept$28 an>, <V set_no$29 i>, <V Concept$49 a>)
    s# 69 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        23% fanout       493 input         1 rows
          clear: (<V s_15_3_t0.O$31 an>)
          clear on continue: (<V s_15_3_t0.O$31 an>)
        s# 73 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    4.9e+02 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_15_3_t0.O$31 an>)
         inlined  P =  IRI_ID"...type" 
        
        time        72% fanout 0.0669371 input       493 rows
        
        s# 83 33 Distinct (HASH) set no <r set_no$29 via  Set73>(<V s_15_3_t0.O$31 an>)
        time       2.4% fanout         1 input        33 rows
          clear: (<V Concept$28 an>)$31 (33 ) 
        s# 91 47 skip node  100  <none> <r set_no$29 via  Set83 Set73>
        After code:
          0: <V Concept$28 an> :=  := artm <r s_15_3_t0.O$31 via  Set91 Set83>
          4: BReturn 0
        time      0.47% fanout         0 input        33 rows
        
        s# 69 39 Subquery Select(<V Concept$28 an>)
          set no: <r set_no$29 via  Set91 Set83 Set73>
      }
    
    After code:
      0: <V Concept$49 a> := Call __ro2sq (<V Concept$28 an>)
      5: BReturn 0
    time      0.46% fanout         0 input        33 rows
    $49 (27 ) $57 (27 58 ) 
    s# 107 51 Select (<V Concept$49 a>)
      set no: <r set_ctr$57 via  Set69>
  }
Warning: You might have a Cartesian product.



 1 msec 28% cpu,         1 rnd       492 seq         0% same seg         0% same pg 
Compilation: 0 msec 0 reads         0% read 0 messages         0% clw

4 Rows. -- 23 msec.
}