
  { 
    time       8.5% fanout         1 input         1 rows
      clear: (<V set_ctr$98 in>)
    s# 101 99 cluster outer seq start, set no <V set_ctr$98 in>    
    save ctx:()
      clear: (<V var2$29 in>, <V var1$28 a>, <V set_no$30 i>, <V var2$90 a>, <V var1$88 a>)
    s# 110 27 Subquery 27 
      multistate set no = <V set_no$30 i>
      { 
        time       4.5% fanout         1 input         1 rows
        
        s# 168 66 Fork 66 {  
                
            save ctx:()
              set no = <V set_no$30 i> array  <none>  save: 
            time       3.7% fanout         1 input         1 rows
            
            s# 143 40 Fork 40 {  
                    
                save ctx:()
                  set no = <V set_no$30 i> array  <none>  save: 
                time        75% fanout         0 input         1 rows
                Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         2 Fanout:         0
                  clear: (<V s_37_2_t0.P$32 rn>)
                  clear on continue: (<V s_37_2_t0.P$32 rn>)
                s# 116 31 from DB.DBA.RDF_QUAD by RDF_QUAD_SP          2 rows Parallel, tail cost        24   
                Key RDF_QUAD_SP  ASC  (<V s_37_2_t0.P$32 rn>)
                 inlined  S =  IRI_ID"...Q224494" 
                copy on branch $30 $0 $0 $0 sets: 101 
                
                time         0% fanout         0 input         0 rows
                Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.2 Fanout:         0
                  clear: (<V isnotnull$38 in>)
                  clear on continue: (<V isnotnull$38 in>)
                s# 126 35 from DB.DBA.RDF_QUAD by RDF_QUAD        1.2 rows Parallel, tail cost        24   
                Key RDF_QUAD  ASC  ()
                 inlined  P = <V s_37_2_t0.P$32 rn> ,  S =  IRI_ID"...Q224494" 
                copy on branch $32 $30 $0 $0 sets: 101 116 
                
                After code:
                  0: <V isnotnull$38 in> := Call isnotnull (<r s_37_2_t0.P$32 via  Set126>)
                  5: BReturn 0
                time         0% fanout         0 input         0 rows
                $38 () 
                s# 135 41 Sort (HASH) set no <r set_no$30 via  Set126 Set116>(<r s_37_2_t0.P$32 via  Set126>) -> (<V isnotnull$38 in>) up to         9 distinct
                
            }
            time       3.6% fanout         0 input         1 rows
              clear: (<V aggregate$42 in>, <V s_37_2_t0.P$32 rn>)
              clear on continue: (<V aggregate$42 in>, <V s_37_2_t0.P$32 rn>)
            s# 150 48 group by read node  
            (<V s_37_2_t0.P$32 rn>, <V aggregate$42 in>)
            time         0% fanout         0 input         0 rows
            
            s# 160 67 Sort (HASH) set no <r set_no$30 via  Set150>(<V aggregate$42 in>) -> (<V s_37_2_t0.P$32 rn>)
            
        }
        time       4.7% fanout         0 input         1 rows
          clear: (<V aggregate$42 in>, <V s_37_2_t0.P$32 rn>, <V var2$29 in>, <V var1$28 a>, <V __id2in$79 a>)
          clear on continue: (<V aggregate$42 in>, <V s_37_2_t0.P$32 rn>, <V var2$29 in>, <V var1$28 a>, <V __id2in$79 a>)
        s# 175 72 Key from temp (<V s_37_2_t0.P$32 rn>, <V aggregate$42 in>)
        
        
        After code:
          0: <V __id2in$79 a> := Call __id2in (<V s_37_2_t0.P$32 rn>)
          5: <V var1$28 a> :=  := artm <V __id2in$79 a>
          9: <V var2$29 in> :=  := artm <V aggregate$42 in>
          13: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 110 81 Subquery Select(<V var1$28 a>, <V var2$29 in>)
          set no: <r set_no$30 via  Set175>
      }
    
    After code:
      0: <V var1$88 a> := Call __ro2sq (<V var1$28 a>)
      5: <V var2$90 a> := Call __ro2sq (<V var2$29 in>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $98 (27 99 ) $88 (27 ) $90 (27 ) 
    s# 193 92 Select (<V var1$88 a>, <V var2$90 a>)
      set no: <r set_ctr$98 via  Set110>
  }


 0 msec 2% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
