http://www.w3.org/2002/07/owl#sameAs	
http://www.wikidata.org/prop/direct/P31	
http://www.wikidata.org/prop/direct/P527	
http://www.wikidata.org/prop/direct/P361	
http://www.wikidata.org/prop/direct/P157	
http://www.wikidata.org/prop/direct/P921	
http://www.wikidata.org/prop/direct/P971	
http://www.wikidata.org/prop/direct/P279	

  { 
    time     0.022% fanout         1 input         1 rows
      clear: (<V set_ctr$59 in>)
    s# 62 60 cluster outer seq start, set no <V set_ctr$59 in>    
    save ctx:()
    time    0.0052% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 71 50 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time      0.26% fanout         8 input         1 rows
      clear: (<V s_37_2_t0.P$31 rn>)
      clear on continue: (<V s_37_2_t0.P$31 rn>)
    s# 80 30 from DB.DBA.RDF_QUAD by RDF_QUAD_OP          8 rows   
    Key RDF_QUAD_OP  ASC  (<V s_37_2_t0.P$31 rn>)
     inlined  O =  IRI_ID"...Q7187" 
    
    time        11% fanout   17862.1 input         8 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.2 Fanout:   1.8e+04
    
    s# 90 34 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        1.2 rows   
    Key RDF_QUAD_POGS  ASC  ()
     P = <V s_37_2_t0.P$31 rn> ,  O =  IRI_ID"...Q7187" 
    
    time        87% fanout 5.59844e-05 input    142897 rows
      clear: (<V var1$28 rn>)$31 (34 ) 
    s# 99 37 Distinct (HASH) set no <r set_no$29 via  Set90 Set80>(<r s_37_2_t0.P$31 via  Set90>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.P$31 via  Set99 Set90>
      4: BReturn 0
    time       1.3% fanout         1 input         8 rows
      clear: (<V var1$51 a>)$28 (37 ) $29 (37 34 30 50 ) 
    s# 108 43 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set99 Set90 Set80>
    After code:
      0: <V var1$51 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.01% fanout         0 input         8 rows
    $51 (43 ) $59 (43 37 34 30 50 60 ) 
    s# 115 53 Select (<V var1$51 a>)
      set no: <r set_ctr$59 via  Set108>
  }
Warning: You might have a Cartesian product.



 13 msec 91% cpu,        10 rnd    142746 seq         0% same seg   9.09091% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
