http://www.wikidata.org/entity/Q5322162	
http://www.wikidata.org/entity/Q10309503	
http://www.wikidata.org/entity/Q13103123	
http://www.wikidata.org/entity/Q27907770	
http://www.wikidata.org/entity/Q2417409	
http://www.wikidata.org/entity/Q18115639	
http://www.wikidata.org/entity/Q5810551	
http://www.wikidata.org/entity/Q16649149	
http://www.wikidata.org/entity/Q4020101	
http://www.wikidata.org/entity/Q7788139	
http://www.wikidata.org/entity/Q15458623	
http://www.wikidata.org/entity/Q16162120	
http://www.wikidata.org/entity/Q7370114	
http://www.wikidata.org/entity/Q18536056	
http://www.wikidata.org/entity/Q17627066	
http://www.wikidata.org/entity/Q21538474	
http://www.wikidata.org/entity/Q20752556	
http://www.wikidata.org/entity/Q19754697	
http://www.wikidata.org/entity/Q21175971	
http://www.wikidata.org/entity/Q1360858	

  { 
    time      0.14% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.037% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        79% fanout        30 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         30 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P570"  ,  O >= <tag 211 c 1903-08-01 00:00:00Z> <= <tag 211 c 1903-08-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1903-08-01 00:00:00Z> <= <tag 211 c 1903-08-31 23:59:59Z>
    
    time       4.7% fanout         1 input        30 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        16% fanout         1 input        30 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.03% fanout         0 input        30 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 3 msec 42% cpu,        27 rnd     10787 seq         0% same seg         0% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
