http://www.openlinksw.com/virtrdf-data-formats#default-iid	
http://www.openlinksw.com/virtrdf-data-formats#default-iid-nullable	
http://www.openlinksw.com/virtrdf-data-formats#default-iid-nonblank	
http://www.openlinksw.com/virtrdf-data-formats#default-iid-nonblank-nullable	
http://www.openlinksw.com/virtrdf-data-formats#default	
http://www.openlinksw.com/virtrdf-data-formats#default-nullable	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-nullable	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-dt	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-dt-nullable	

  { 
    time       2.1% fanout         1 input         1 rows
      clear: (<V set_ctr$39 in>)
    s# 45 40 cluster outer seq start, set no <V set_ctr$39 in>    
    save ctx:()
    time        37% fanout      1000 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   7.3e+07 Fanout:     1e+03
      clear: (<V s_37_2_t0.S$28 rn>)
      clear on continue: (<V s_37_2_t0.S$28 rn>)
    s# 54 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    7.3e+07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$28 rn>)
    
    
    time        60% fanout      0.01 input      1000 rows
      clear: (<V var1$31 a>)$28 () 
    s# 64 43 skip node  10  <none> <r set_ctr$39 via  Set54>
    After code:
      0: <V var1$31 a> := Call __id2in (<r s_37_2_t0.S$28 via  Set64>)
      5: BReturn 0
    time      0.72% fanout         0 input        10 rows
    $31 (43 ) $39 (43 27 40 ) 
    s# 72 33 Select (<V var1$31 a>)
      set no: <r set_ctr$39 via  Set64 Set54>
  }
Warning: You might have a Cartesian product.



 0 msec 15% cpu,         1 rnd       998 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
