http://www.wikidata.org/entity/Q2615200	
http://www.wikidata.org/entity/Q2918316	
http://www.wikidata.org/entity/Q2976797	
http://www.wikidata.org/entity/Q3121587	
http://www.wikidata.org/entity/Q3170365	
http://www.wikidata.org/entity/Q3175900	
http://www.wikidata.org/entity/Q3179537	
http://www.wikidata.org/entity/Q15908902	
http://www.wikidata.org/entity/Q16085503	
http://www.wikidata.org/entity/Q16088957	
http://www.wikidata.org/entity/Q16090213	
http://www.wikidata.org/entity/Q16105016	
http://www.wikidata.org/entity/Q16105120	
http://www.wikidata.org/entity/Q16105139	
http://www.wikidata.org/entity/Q16206202	
http://www.wikidata.org/entity/Q16298162	
http://www.wikidata.org/entity/Q2163059	
http://www.wikidata.org/entity/Q5325976	
http://www.wikidata.org/entity/Q5346742	
http://www.wikidata.org/entity/Q5578317	

  { 
    time     0.039% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.009% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time       5.2% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS      3e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1939-01-01 00:00:00Z> <= <tag 211 c 1939-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1939-01-01 00:00:00Z> <= <tag 211 c 1939-12-31 23:59:59Z>
    
    time       3.2% fanout     0.992 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        92% fanout         1 input       992 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.012% fanout         0 input       992 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 9 msec 70% cpu,       939 rnd      2218 seq         0% same seg   15.9574% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
