http://www.wikidata.org/entity/Q2637190	
http://www.wikidata.org/entity/Q2785439	
http://www.wikidata.org/entity/Q3180704	
http://www.wikidata.org/entity/Q15823368	
http://www.wikidata.org/entity/Q15834441	
http://www.wikidata.org/entity/Q16196931	
http://www.wikidata.org/entity/Q16196957	
http://www.wikidata.org/entity/Q16197002	
http://www.wikidata.org/entity/Q16197064	
http://www.wikidata.org/entity/Q16197145	
http://www.wikidata.org/entity/Q16197185	
http://www.wikidata.org/entity/Q16197240	
http://www.wikidata.org/entity/Q16197246	
http://www.wikidata.org/entity/Q16197272	
http://www.wikidata.org/entity/Q16197309	
http://www.wikidata.org/entity/Q16197409	
http://www.wikidata.org/entity/Q16197778	
http://www.wikidata.org/entity/Q16298569	
http://www.wikidata.org/entity/Q16299325	
http://www.wikidata.org/entity/Q72143	

  { 
    time     0.056% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.013% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        20% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    3.5e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1967-01-01 00:00:00Z> <= <tag 211 c 1967-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1967-01-01 00:00:00Z> <= <tag 211 c 1967-12-31 23:59:59Z>
    
    time       4.7% fanout     0.997 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        75% fanout         1 input       997 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.012% fanout         0 input       997 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 6 msec 80% cpu,       395 rnd      8106 seq         0% same seg   12.1212% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
