http://www.w3.org/1999/02/22-rdf-syntax-ns#type	
http://www.openlinksw.com/schemas/virtrdf#version	
http://www.openlinksw.com/schemas/virtrdf#loadAs	
http://www.openlinksw.com/schemas/virtrdf#item	
http://www.openlinksw.com/schemas/virtrdf#isSpecialPredicate	
http://www.openlinksw.com/schemas/virtrdf#isGcResistantType	
http://www.openlinksw.com/schemas/virtrdf#qmfName	
http://www.openlinksw.com/schemas/virtrdf#qmfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfLongTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfSqlvalTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfBoolTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfIsrefOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfIsuriOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfIsblankOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfIslitOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmf01uriOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmf01blankOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfLongOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfSqlvalOfShortTmpl	
http://www.openlinksw.com/schemas/virtrdf#qmfDatatypeOfShortTmpl	

  { 
    time   0.00043% fanout         1 input         1 rows
      clear: (<V set_ctr$58 in>)
    s# 61 59 cluster outer seq start, set no <V set_ctr$58 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$50 a>)
    s# 70 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time       7.9% fanout 1.2189e+07 input         1 rows
          clear: (<V s_37_2_t0.P$31 rn>)
          clear on continue: (<V s_37_2_t0.P$31 rn>)
        s# 74 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    7.3e+07 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.P$31 rn>)
        
        
        time        92% fanout 3.28165e-06 input 1.2189e+07 rows
        
        s# 84 34 Distinct (HASH) set no <r set_no$29 via  Set74>(<V s_37_2_t0.P$31 rn>)
        time    0.0012% fanout         1 input        40 rows
          clear: (<V var1$28 rn>)$31 (34 ) 
        s# 92 48 skip node  100  <none> <r set_no$29 via  Set84 Set74>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.P$31 via  Set92 Set84>
          4: BReturn 0
        time   0.00025% fanout         0 input        40 rows
        
        s# 70 40 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set92 Set84 Set74>
      }
    
    After code:
      0: <V var1$50 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time    0.0002% fanout         0 input        40 rows
    $50 (27 ) $58 (27 59 ) 
    s# 108 52 Select (<V var1$50 a>)
      set no: <r set_ctr$58 via  Set70>
  }
Warning: You might have a Cartesian product.



 444 msec 99% cpu,        40 rnd 1.2176e+07 seq         0% same seg   90.2439% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
