http://www.wikidata.org/entity/Q6556803		

  { 
    time       2.7% fanout         1 input         1 rows
      clear: (<V set_ctr$64 in>)
    s# 67 65 cluster outer seq start, set no <V set_ctr$64 in>    
    save ctx:()
    Precode:
      0: <V __all_eq$27 x> := Call __all_eq ( IRI_ID"...Q6556803" )
      5: BReturn 0
      clear: (<V _::trans_subj_37_0$30 rn>, <V _::trans_obj_37_1$31 an>, <V __all_eq$27 x>, <V var1$56 a>)
      clear on continue: (<V var1$56 a>, <V _::trans_obj_37_1$31 an>, <V _::trans_subj_37_0$30 rn>)$27 (29 ) 
    s# 76 29 Transitive dt dir 1, input: (<V __all_eq$27 x>)
      input shadow: (<V __all_eq$80 x>)
      output: (<V _::trans_obj_37_1$31 an>)
      { 
        time        48% fanout         0 input         1 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.1 Fanout:         0
          clear: (<V s_37_4_t0.O$36 an>, <V s_37_4_t0.S$37 rn>, <V _::trans_obj_37_1$31 an>, <V _::trans_subj_37_0$30 rn>)
          clear on continue: (<V _::trans_subj_37_0$30 rn>, <V _::trans_obj_37_1$31 an>, <V s_37_4_t0.S$37 rn>, <V s_37_4_t0.O$36 an>)$80 (35 ) $86 (35 ) 
        s# 82 35 from DB.DBA.RDF_QUAD by RDF_QUAD        1.1 rows   
        Key RDF_QUAD  ASC  (<V s_37_4_t0.S$37 rn>, <V s_37_4_t0.O$36 an>)
         inlined  P =  IRI_ID"...direct/P131"  ,  S = <v k___all_eq$86 Set88 rn>
        vector param casts: <V __all_eq$80 x>-> <v k___all_eq$86 Set88 rn>
        
        After code:
          0: <V _::trans_subj_37_0$30 rn> :=  := artm <V s_37_4_t0.S$37 rn>
          4: <V _::trans_obj_37_1$31 an> :=  := artm <V s_37_4_t0.O$36 an>
          8: BReturn 0
        time         0% fanout         0 input         0 rows
        $30 () 
        s# 99 39 Subquery Select(<V _::trans_subj_37_0$30 rn>, <V _::trans_obj_37_1$31 an>)
          set no: <r step_set$32 via  Set82 Set88>
      }
    After code:
      0: <V var1$56 a> := Call __ro2sq (<V _::trans_obj_37_1$31 an>)
      5: BReturn 0
    time         1% fanout         0 input         1 rows
    $64 (29 65 ) $56 () 
    s# 106 58 Select (<V var1$56 a>, <DB_NULL>)
      set no: <r set_ctr$64 via  Set76>
  }
Warning: You might have a Cartesian product.



 0 msec 10% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
