
  { 
    time       3.6% fanout         1 input         1 rows
      clear: (<V set_ctr$46 in>)
    s# 49 47 cluster outer seq start, set no <V set_ctr$46 in>    
    save ctx:()
    time        96% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t2.O$28 an>)
      clear on continue: (<V s_37_6_t2.O$28 an>)
    s# 58 27 from DB.DBA.RDF_QUAD by RDF_QUAD    1.4e-07 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t2.O$28 an>)
     inlined  P =  IRI_ID"...P1416"  ,  S =  IRI_ID"...Q1729775" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t1.S$31 rn>)
      clear on continue: (<V s_37_6_t1.S$31 rn>)
    s# 68 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t1.S$31 rn>)
     P =  IRI_ID"...qualifier/P2937"  ,  O =  IRI_ID"...Q15081430" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t0.O$34 an>, <V var1$38 a>, <V var2$36 a>)
      clear on continue: (<V s_37_6_t0.O$34 an>, <V var1$38 a>, <V var2$36 a>)$31 () $82 (33 ) $28 (30 ) 
    s# 78 33 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t0.O$34 an>)
     inlined  P =  IRI_ID"...prop/P39"  ,  O = <v cast$82 Set84 an> ,  S =  IRI_ID"...Q1729775" 
    vector param casts: <V s_37_6_t1.S$31 rn>-> <v cast$82 Set84 an>
    
    After code:
      0: <V var2$36 a> := Call __ro2sq (<r s_37_6_t2.O$28 via  Set78 Set84 Set68>)
      5: <V var1$38 a> := Call __ro2sq (<V s_37_6_t0.O$34 an>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $36 () $38 () $46 (33 30 27 47 ) 
    s# 92 40 Select (<V var1$38 a>, <V var2$36 a>)
      set no: <r set_ctr$46 via  Set78 Set84 Set68 Set58>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 122 msec 4 reads    34.365% read 0 messages         0% clw
