http://www.wikidata.org/entity/Q47296845		
http://www.wikidata.org/entity/Q16962266		

  { 
    time      0.19% fanout         1 input         1 rows
      clear: (<V set_ctr$33 in>)
    s# 54 34 cluster outer seq start, set no <V set_ctr$33 in>    
    save ctx:()
    time       3.6% fanout       564 input         1 rows
      clear: (<V t1.S$28 rn>)
      clear on continue: (<V t1.S$28 rn>)
    s# 63 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    5.6e+02 rows   
    Key RDF_QUAD_POGS  ASC  (<V t1.S$28 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q207694" 
    
    time      0.45% fanout         1 input       564 rows
      clear: (<V set_ctr$36 i>)
    s# 73 40 cluster outer seq start, set no <V set_ctr$36 i>    
    save ctx:()
    time        88% fanout   1.00709 input       564 rows
      clear: (<V t3.O$31 a>)
      clear on continue: (<V t3.O$31 a>)$86 (30 ) 
    s# 82 30 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V t3.O$31 a>)
     inlined  P =  IRI_ID"...direct/P17"  ,  S = <v k_t1.S$86 Set88 rn>
    vector param casts: <r t1.S$28 via  Set73>-> <v k_t1.S$86 Set88 rn>
    
    time      0.57% fanout   1.00352 input       568 rows
    $36 (30 40 ) 
    s# 96 35 end of outer seq <r set_ctr$36 via  Set82 Set88>
     out: (<V t3.O$31 a>)
     shadow: ( <none> )
    time       7.2% fanout 0.00350877 input       570 rows
      clear: (<V var1$45 a>)$31 (35 ) $28 (35 30 40 ) 
    s# 109 104 END Node
    After test:
      0: if (<V t3.O$31 a>  IS NULL   0 ) then 4 else 5 unkn 5
      4: BReturn 1
      5: BReturn 0
    After code:
      0: <V var1$45 a> := Call __id2in (<r t1.S$28 via  Set109 Set96>)
      5: BReturn 0
    time     0.043% fanout         0 input         2 rows
    $33 (104 35 30 40 27 34 ) $45 (104 ) 
    s# 117 47 Select (<V var1$45 a>, <DB_NULL>)
      set no: <r set_ctr$33 via  Set109 Set96 Set63>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 2 msec 51% cpu,       567 rnd       569 seq   86.4437% same seg   10.2113% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
