http://www.wikidata.org/entity/Q1020993	
http://www.wikidata.org/entity/Q213154	
http://www.wikidata.org/entity/Q665868	
http://www.wikidata.org/entity/Q1711	
http://www.wikidata.org/entity/Q1724	
http://www.wikidata.org/entity/Q2100	
http://www.wikidata.org/entity/Q586	
http://www.wikidata.org/entity/Q807	
http://www.wikidata.org/entity/Q2119	
http://www.wikidata.org/entity/Q2751	

  { 
    time       0.9% fanout         1 input         1 rows
      clear: (<V set_ctr$60 in>)
    s# 63 61 cluster outer seq start, set no <V set_ctr$60 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$52 a>)
    s# 72 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        15% fanout        10 input         1 rows
          clear: (<V s_37_7_t1.S$31 rn>)
          clear on continue: (<V s_37_7_t1.S$31 rn>)
        s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         10 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_7_t1.S$31 rn>)
         P =  IRI_ID"...direct/P279"  ,  O =  IRI_ID"...Q515" 
        
        time        49% fanout      13.8 input        10 rows
          clear: (<V s_37_3_t0.S$34 rn>)
          clear on continue: (<V s_37_3_t0.S$34 rn>)$31 () $90 (33 ) 
        s# 86 33 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS      1e+02 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_3_t0.S$34 rn>)
         P =  IRI_ID"...direct/P31"  ,  O = <v cast$90 Set92 an>
        vector param casts: <V s_37_7_t1.S$31 rn>-> <v cast$90 Set92 an>
        
        time        33% fanout  0.811594 input       138 rows
        
        s# 100 36 Distinct (HASH) set no <r set_no$29 via  Set86 Set92 Set76>(<V s_37_3_t0.S$34 rn>)
        time       1.8% fanout 0.0892857 input       112 rows
          clear: (<V var1$28 rn>)$34 (36 ) 
        s# 108 50 skip node  10  <none> <r set_no$29 via  Set100 Set86 Set92 Set76>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_3_t0.S$34 via  Set108 Set100>
          4: BReturn 0
        time      0.28% fanout         0 input        10 rows
        
        s# 72 42 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set108 Set100 Set86 Set92 Set76>
      }
    
    After code:
      0: <V var1$52 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.25% fanout         0 input        10 rows
    $52 (27 ) $60 (27 61 ) 
    s# 124 54 Select (<V var1$52 a>)
      set no: <r set_ctr$60 via  Set72>
  }
Warning: You might have a Cartesian product.



 1 msec 24% cpu,        19 rnd       140 seq         5% same seg        20% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
