  { 
      clear: (<V set_ctr$44 in>)
    s# 47 45 cluster outer seq start, set no <V set_ctr$44 in>    
    save ctx:()
      clear: (<V t3.O$28 an>, <V t3.S$29 rn>)
      clear on continue: (<V t3.O$28 an>, <V t3.S$29 rn>)
    s# 52 27 from DB.DBA.RDF_QUAD by RDF_QUAD          4 rows   
    Key RDF_QUAD  ASC  (<V t3.S$29 rn>, <V t3.O$28 an>)
     inlined  P =  IRI_ID"...family-name" 
    
      clear: (<V t2.O$32 an>, <V givenName$36 a>, <V familyName$34 a>)
      clear on continue: (<V t2.O$32 an>, <V givenName$36 a>, <V familyName$34 a>)$28 () $29 () 
    s# 59 31 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V t2.O$32 an>)
     inlined  P =  IRI_ID"...given-name"  ,  S = <V t3.S$29 rn>
    
    After code:
      0: <V familyName$34 a> := Call __ro2sq (<r t3.O$28 via  Set59>)
      5: <V givenName$36 a> := Call __ro2sq (<V t2.O$32 an>)
      10: BReturn 0
    $34 () $36 () $44 (31 27 45 ) 
    s# 65 38 Select (<V givenName$36 a>, <V familyName$34 a>, <c some value>)
      set no: <r set_ctr$44 via  Set59 Set52>
  }
