http://www.wikidata.org/entity/Q2918794	2011	
http://www.wikidata.org/entity/Q674882	2011	
http://www.wikidata.org/entity/Q842923	2013	
http://www.wikidata.org/entity/Q4688491	2013	
http://www.wikidata.org/entity/Q27485154	2013	
http://www.wikidata.org/entity/Q29785988	2013	
http://www.wikidata.org/entity/Q585	0001–1299	
http://www.wikidata.org/entity/Q585	0001–1299	
http://www.wikidata.org/entity/Q1489	01000–16999	
http://www.wikidata.org/entity/Q1489	01000–16999	
http://www.wikidata.org/entity/Q13640610	020101	
http://www.wikidata.org/entity/Q1623	0550	
http://www.wikidata.org/entity/Q1623	0550	
http://www.wikidata.org/entity/Q1623	0560	
http://www.wikidata.org/entity/Q1623	0560	
http://www.wikidata.org/entity/Q30097821	100020	
http://www.wikidata.org/entity/Q807	1000–1007	
http://www.wikidata.org/entity/Q807	1000–1007	
http://www.wikidata.org/entity/Q597	1000–1900	
http://www.wikidata.org/entity/Q597	1000–1900	

  { 
    time      0.45% fanout         1 input         1 rows
      clear: (<V set_ctr$41 in>)
    s# 47 42 cluster outer seq start, set no <V set_ctr$41 in>    
    save ctx:()
    time        14% fanout      1000 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.5e+05 Fanout:     1e+03
      clear: (<V s_37_2_t0.O$28 an>, <V s_37_2_t0.S$29 rn>)
      clear on continue: (<V s_37_2_t0.O$28 an>, <V s_37_2_t0.S$29 rn>)
    s# 56 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.5e+05 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$29 rn>, <V s_37_2_t0.O$28 an>)
     inlined  P =  IRI_ID"...direct/P281" 
    
    time        86% fanout      0.05 input      1000 rows
      clear: (<V var2$33 a>, <V var1$31 a>)$28 () $29 () 
    s# 67 45 skip node  50  <none> <r set_ctr$41 via  Set56>
    After code:
      0: <V var1$31 a> := Call __id2in (<r s_37_2_t0.S$29 via  Set67>)
      5: <V var2$33 a> := Call __ro2sq (<r s_37_2_t0.O$28 via  Set67>)
      10: BReturn 0
    time     0.052% fanout         0 input        50 rows
    $31 (45 ) $33 (45 ) $41 (45 27 42 ) 
    s# 75 35 Select (<V var1$31 a>, <V var2$33 a>)
      set no: <r set_ctr$41 via  Set67 Set56>
  }
Warning: You might have a Cartesian product.



 1 msec 40% cpu,        85 rnd       998 seq         0% same seg    22.093% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
