
  { 
    time        69% fanout         1 input         1 rows
      clear: (<V set_ctr$59 in>)
    s# 62 60 cluster outer seq start, set no <V set_ctr$59 in>    
    save ctx:()
      clear: (<V var2Label$29 x>, <V var1$28 rn>, <V set_no$30 i>, <V var1$51 a>)
    s# 71 27 Subquery 27 
      multistate set no = <V set_no$30 i>
      { 
        time        31% fanout         0 input         1 rows
        
        s# 75 31 END Node
        After test:
          0: BReturn 0
        time         0% fanout         0 input         0 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   6.3e-08 Fanout:         0
          clear: (<V s_37_2_t0.S$33 rn>)
          clear on continue: (<V s_37_2_t0.S$33 rn>)
        s# 82 32 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    6.3e-08 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$33 rn>)
         P =  IRI_ID"...isPartOf"  ,  O =  IRI_ID"..." 
        
        time         0% fanout         0 input         0 rows
        
        s# 97 92 END Node
        After test:
          0: if (<c en> = <DB_NULL>) then 4 else 5 unkn 5
          4: BReturn 1
          5: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 105 35 Distinct (HASH) set no <r set_no$30 via  Set97 Set82 Set75>(<r s_37_2_t0.S$33 via  Set97>)
        time         0% fanout         0 input         0 rows
          clear: (<V var2Label$29 x>, <V var1$28 rn>)$33 (35 92 ) 
        s# 113 49 skip node  10  <none> <r set_no$30 via  Set105 Set97 Set82 Set75>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$33 via  Set113 Set105 Set97>
          4: <V var2Label$29 x> :=  := artm <DB_NULL>
          8: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 71 41 Subquery Select(<V var1$28 rn>, <V var2Label$29 x>)
          set no: <r set_no$30 via  Set113 Set105 Set97 Set82 Set75>
      }
    
    After code:
      0: <V var1$51 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $51 (27 ) $59 (27 60 ) $29 (27 ) 
    s# 130 53 Select (<V var1$51 a>, <V var2Label$29 x>)
      set no: <r set_ctr$59 via  Set71>
  }
Warning: You might have a Cartesian product.



 0 msec 1% cpu,         0 rnd         0 seq         0% same seg         0% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
