
  { 
    time       7.4% fanout         1 input         1 rows
      clear: (<V set_ctr$96 in>)
    s# 99 97 cluster outer seq start, set no <V set_ctr$96 in>    
    save ctx:()
      clear: (<V var2$29 in>, <V var1$28 a>, <V set_no$30 i>, <V var2$88 a>, <V var1$86 a>)
    s# 108 27 Subquery 27 
      multistate set no = <V set_no$30 i>
      { 
        time       4.2% fanout         1 input         1 rows
        
        s# 168 64 Fork 64 {  
                
            save ctx:()
              set no = <V set_no$30 i> array  <none>  save: 
            time       3.3% fanout         1 input         1 rows
            
            s# 143 37 Fork 37 {  
                    
                save ctx:()
                  set no = <V set_no$30 i> array  <none>  save: 
                time        74% fanout         0 input         1 rows
                Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
                  clear: (<V s_37_4_t1.S$32 rn>)
                  clear on continue: (<V s_37_4_t1.S$32 rn>)
                s# 114 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows Parallel, tail cost       7.9   
                Key RDF_QUAD_POGS  ASC  (<V s_37_4_t1.S$32 rn>)
                 inlined  P =  IRI_ID"...qualifier/P2241" 
                copy on branch $30 $0 $0 $0 sets: 99 
                
                time         0% fanout         0 input         0 rows
                Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
                  clear: (<V s_37_4_t0.O$35 an>)
                  clear on continue: (<V s_37_4_t0.O$35 an>)$32 () 
                s# 124 34 from DB.DBA.RDF_QUAD by RDF_QUAD    1.4e-07 rows Parallel, tail cost       7.9   
                Key RDF_QUAD  ASC  (<V s_37_4_t0.O$35 an>)
                 inlined  P =  IRI_ID"...rank"  ,  S = <V s_37_4_t1.S$32 rn>
                copy on branch $32 $30 $0 $0 sets: 99 114 
                
                time         0% fanout         0 input         0 rows
                
                s# 134 38 Sort (HASH) set no <r set_no$30 via  Set124 Set114>(<V s_37_4_t0.O$35 an>) -> (<V inc$41 i>) up to   2.4e+07 distinct
                
            }
            time       3.8% fanout         0 input         1 rows
              clear: (<V aggregate$39 in>, <V s_37_4_t0.O$35 an>)
              clear on continue: (<V aggregate$39 in>, <V s_37_4_t0.O$35 an>)
            s# 150 46 group by read node  
            (<V s_37_4_t0.O$35 an>, <V aggregate$39 in>)
            time         0% fanout         0 input         0 rows
            
            s# 160 65 Sort (HASH) set no <r set_no$30 via  Set150>(<V aggregate$39 in>) -> (<V s_37_4_t0.O$35 an>)
            
        }
        time         7% fanout         0 input         1 rows
          clear: (<V aggregate$39 in>, <V s_37_4_t0.O$35 an>, <V var2$29 in>, <V var1$28 a>, <V __ro2sq$77 a>)
          clear on continue: (<V aggregate$39 in>, <V s_37_4_t0.O$35 an>, <V var2$29 in>, <V var1$28 a>, <V __ro2sq$77 a>)
        s# 175 70 Key from temp (<V s_37_4_t0.O$35 an>, <V aggregate$39 in>)
        
        
        After code:
          0: <V __ro2sq$77 a> := Call __ro2sq (<V s_37_4_t0.O$35 an>)
          5: <V var1$28 a> :=  := artm <V __ro2sq$77 a>
          9: <V var2$29 in> :=  := artm <V aggregate$39 in>
          13: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 108 79 Subquery Select(<V var1$28 a>, <V var2$29 in>)
          set no: <r set_no$30 via  Set175>
      }
    
    After code:
      0: <V var1$86 a> := Call __ro2sq (<V var1$28 a>)
      5: <V var2$88 a> := Call __ro2sq (<V var2$29 in>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $96 (27 97 ) $86 (27 ) $88 (27 ) 
    s# 193 90 Select (<V var1$86 a>, <V var2$88 a>)
      set no: <r set_ctr$96 via  Set108>
  }


 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 7 msec 0 reads         0% read 0 messages         0% clw
