http://www.wikidata.org/entity/Q2639003	
http://www.wikidata.org/entity/Q2848651	
http://www.wikidata.org/entity/Q16512504	
http://www.wikidata.org/entity/Q3056472	
http://www.wikidata.org/entity/Q3057245	
http://www.wikidata.org/entity/Q3068801	
http://www.wikidata.org/entity/Q15912487	
http://www.wikidata.org/entity/Q16012561	
http://www.wikidata.org/entity/Q16015336	
http://www.wikidata.org/entity/Q16016179	
http://www.wikidata.org/entity/Q47498259	
http://www.wikidata.org/entity/Q16199086	
http://www.wikidata.org/entity/Q1090206	
http://www.wikidata.org/entity/Q4243324	
http://www.wikidata.org/entity/Q5650852	
http://www.wikidata.org/entity/Q6499659	
http://www.wikidata.org/entity/Q7106015	
http://www.wikidata.org/entity/Q7152282	
http://www.wikidata.org/entity/Q7245952	
http://www.wikidata.org/entity/Q7247676	

  { 
    time     0.047% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time    0.0095% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        16% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    2.1e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1910-01-01 00:00:00Z> <= <tag 211 c 1910-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1910-01-01 00:00:00Z> <= <tag 211 c 1910-12-31 23:59:59Z>
    
    time       3.7% fanout     0.991 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        81% fanout         1 input       991 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time    0.0098% fanout         0 input       991 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 7 msec 69% cpu,       844 rnd      8645 seq         0% same seg   13.8462% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
