http://www.wikidata.org/entity/Q2608670			
http://www.wikidata.org/entity/Q2860347			
http://www.wikidata.org/entity/Q2918331			
http://www.wikidata.org/entity/Q3071241			
http://www.wikidata.org/entity/Q3071276			
http://www.wikidata.org/entity/Q3113383			
http://www.wikidata.org/entity/Q15690792			
http://www.wikidata.org/entity/Q15825946			
http://www.wikidata.org/entity/Q15891535			
http://www.wikidata.org/entity/Q41550684			
http://www.wikidata.org/entity/Q259561			
http://www.wikidata.org/entity/Q263434			
http://www.wikidata.org/entity/Q377287			
http://www.wikidata.org/entity/Q19944712			
http://www.wikidata.org/entity/Q496134			
http://www.wikidata.org/entity/Q496148			
http://www.wikidata.org/entity/Q500052			
http://www.wikidata.org/entity/Q796486			
http://www.wikidata.org/entity/Q1523687			
http://www.wikidata.org/entity/Q3408037			

  { 
    time     0.057% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
    time     0.014% fanout         1 input         1 rows
      clear: (<V set_no$31 i>)
    s# 69 48 cluster outer seq start, set no <V set_no$31 i>    
    save ctx:()
    time       1.4% fanout      1000 input         1 rows
      clear: (<V t2.S$33 rn>)
      clear on continue: (<V t2.S$33 rn>)
    s# 78 32 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.1e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V t2.S$33 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q3231690" 
    
    time       6.9% fanout         1 input      1000 rows
      clear: (<V var2Label$30 x>, <V var1Label$29 x>, <V var1$28 rn>)$33 () 
    s# 88 35 Distinct (HASH) set no <r set_no$31 via  Set78>(<V t2.S$33 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r t2.S$33 via  Set88>
      4: <V var1Label$29 x> :=  := artm <DB_NULL>
      8: <V var2Label$30 x> :=  := artm <DB_NULL>
      12: BReturn 0
    time        92% fanout         1 input      1000 rows
      clear: (<V var1$49 a>)$31 (35 32 48 ) $28 (35 ) 
    s# 99 41 Subquery Select(<V var1$28 rn>, <V var1Label$29 x>, <V var2Label$30 x>)
      set no: <r set_no$31 via  Set88 Set78>
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.017% fanout         0 input      1000 rows
    $49 (41 ) $57 (41 35 32 48 58 ) $29 (41 35 ) $30 (41 35 ) 
    s# 106 51 Select (<V var1$49 a>, <V var1Label$29 x>, <V var2Label$30 x>)
      set no: <r set_ctr$57 via  Set99>
  }
Warning: You might have a Cartesian product.



 6 msec 76% cpu,       332 rnd       998 seq         0% same seg   18.9189% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
