
  { 
    time         2% fanout         1 input         1 rows
      clear: (<V set_ctr$47 in>)
    s# 53 48 cluster outer seq start, set no <V set_ctr$47 in>    
    save ctx:()
    time        98% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.1e-07 Fanout:         0
    Precode:
      0: <V $27 r> := Call __i2idn (<tag 182 flag 1 c https://en.wikivoyage.org/>)
      5: <V __rdflit$29 x> := Call __rdflit (rdflit32005)
      10: BReturn 0
      clear: (<V s_37_7_t2.S$32 rn>, <V __rdflit$29 x>, <V $27 r>)
      clear on continue: (<V s_37_7_t2.S$32 rn>)$66 (31 ) $27 (31 ) 
    s# 62 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.1e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_7_t2.S$32 rn>)
     P =  IRI_ID"...isPartOf"  ,  O = <v k_$66 Set68 an>
    vector param casts: <V $27 r>-> <v k_$66 Set68 an>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:     5e-08 Fanout:         0
      clear: (<V s_37_7_t0.S$35 rn>)
      clear on continue: (<V s_37_7_t0.S$35 rn>)$32 () 
    s# 76 34 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS      5e-08 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_7_t0.S$35 rn>)
     inlined  P =  IRI_ID"...about"  ,  O =  IRI_ID"...Q1492"  ,  S = <V s_37_7_t2.S$32 rn>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.1e-07 Fanout:         0
    
    s# 86 37 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.1e-07 rows   
    Key RDF_QUAD_POGS  ASC  ()
     inlined  P =  IRI_ID"...inLanguage"  ,  O = rdflit32005 ,  S = <V s_37_7_t0.S$35 rn>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var2$39 a>)$35 (37 ) 
    s# 95 51 skip node  10  <none> <r set_ctr$47 via  Set86 Set76 Set62 Set68>
    After code:
      0: <V var2$39 a> := Call __id2in (<r s_37_7_t0.S$35 via  Set95 Set86>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $39 (51 ) $47 (51 37 34 31 48 ) 
    s# 103 41 Select (<tag 182 flag 1 c http://www.wikidata.org/entity/Q1492>, <V var2$39 a>)
      set no: <r set_ctr$47 via  Set95 Set86 Set76 Set62 Set68>
  }
Warning: You might have a Cartesian product.



 0 msec 7% cpu,         7 rnd         0 seq         0% same seg         0% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
