http://www.wikidata.org/entity/Q2977005	
http://www.wikidata.org/entity/Q3121562	
http://www.wikidata.org/entity/Q16014015	
http://www.wikidata.org/entity/Q16014045	
http://www.wikidata.org/entity/Q16014107	
http://www.wikidata.org/entity/Q16014170	
http://www.wikidata.org/entity/Q16014190	
http://www.wikidata.org/entity/Q16014205	
http://www.wikidata.org/entity/Q16203581	
http://www.wikidata.org/entity/Q4237473	
http://www.wikidata.org/entity/Q4241725	
http://www.wikidata.org/entity/Q5534169	
http://www.wikidata.org/entity/Q5570401	
http://www.wikidata.org/entity/Q6244007	
http://www.wikidata.org/entity/Q6811397	
http://www.wikidata.org/entity/Q7176841	
http://www.wikidata.org/entity/Q7236088	
http://www.wikidata.org/entity/Q7371884	
http://www.wikidata.org/entity/Q7606029	
http://www.wikidata.org/entity/Q16437567	

  { 
    time     0.035% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time    0.0078% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        12% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.6e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P570"  ,  O >= <tag 211 c 1998-01-01 00:00:00Z> <= <tag 211 c 1998-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1998-01-01 00:00:00Z> <= <tag 211 c 1998-12-31 23:59:59Z>
    
    time       2.8% fanout     0.977 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        85% fanout         1 input       977 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.013% fanout         0 input       977 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 9 msec 75% cpu,       945 rnd      8892 seq         0% same seg   16.5962% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
