
  { 
    time       8.8% fanout         1 input         1 rows
      clear: (<V set_ctr$44 in>)
    s# 47 45 cluster outer seq start, set no <V set_ctr$44 in>    
    save ctx:()
    time        91% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t0.S$28 rn>, <V s_37_6_t0.O$29 an>)
      clear on continue: (<V s_37_6_t0.S$28 rn>, <V s_37_6_t0.O$29 an>)
    s# 56 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t0.O$29 an>, <V s_37_6_t0.S$28 rn>)
     inlined  P =  IRI_ID"...P1087" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.7e-14 Fanout:         0
      clear: (<V s_37_6_t1.O$32 an>)
      clear on continue: (<V s_37_6_t1.O$32 an>)$71 (31 ) $29 () 
    s# 67 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.7e-14 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t1.O$32 an>)
     inlined  P =  IRI_ID"...value/P1087" 
    row specs:  S = <v k_s_37_6_t0.O$71 Set73 rn>
    vector param casts: <V s_37_6_t0.O$29 an>-> <v k_s_37_6_t0.O$71 Set73 rn>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V var1$36 a>)
      clear on continue: (<V var1$36 a>)$32 () $85 (34 ) $28 (31 ) 
    s# 81 34 from DB.DBA.RDF_QUAD by RDF_QUAD    1.4e-07 rows   
    Key RDF_QUAD  ASC  ()
     inlined  P =  IRI_ID"...quantityLowerBound"  ,  S = <v k_s_37_6_t1.O$85 Set87 rn>
    vector param casts: <V s_37_6_t1.O$32 an>-> <v k_s_37_6_t1.O$85 Set87 rn>
    
    After code:
      0: <V var1$36 a> := Call __id2in (<r s_37_6_t0.S$28 via  Set81 Set87 Set67 Set73>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $36 () $44 (34 31 27 45 ) 
    s# 94 38 Select (<V var1$36 a>)
      set no: <r set_ctr$44 via  Set81 Set87 Set67 Set73 Set56>
  }
Warning: You might have a Cartesian product.



 1 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 28 msec 0 reads         0% read 0 messages         0% clw
