
  { 
    time        10% fanout         1 input         1 rows
      clear: (<V set_ctr$59 in>)
    s# 62 60 cluster outer seq start, set no <V set_ctr$59 in>    
    save ctx:()
    time       2.7% fanout         1 input         1 rows
      clear: (<V set_no$30 i>)
    s# 71 50 cluster outer seq start, set no <V set_no$30 i>    
    save ctx:()
    time        87% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_4_t1.O$32 an>, <V s_37_4_t1.S$33 rn>)
      clear on continue: (<V s_37_4_t1.O$32 an>, <V s_37_4_t1.S$33 rn>)
    s# 80 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t1.S$33 rn>, <V s_37_4_t1.O$32 an>)
     inlined  P =  IRI_ID"...qualifier/P580" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
    $33 () $95 (35 ) 
    s# 91 35 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  ()
     inlined  P =  IRI_ID"...prop/P26"  ,  O = <v cast$95 Set97 an> ,  S =  IRI_ID"...Q76" 
    vector param casts: <V s_37_4_t1.S$33 rn>-> <v cast$95 Set97 an>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var2$29 an>, <V var1$28 x>)$32 (35 ) 
    s# 104 37 Distinct (HASH) set no <r set_no$30 via  Set91 Set97 Set80>(<r s_37_4_t1.O$32 via  Set91 Set97>)
    After code:
      0: <V var1$28 x> :=  := artm <DB_NULL>
      4: <V var2$29 an> :=  := artm <r s_37_4_t1.O$32 via  Set104 Set91 Set97>
      8: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var2$51 a>)$29 (37 ) $30 (37 35 31 50 ) 
    s# 114 43 Subquery Select(<V var1$28 x>, <V var2$29 an>)
      set no: <r set_no$30 via  Set104 Set91 Set97 Set80>
    After code:
      0: <V var2$51 a> := Call __ro2sq (<V var2$29 an>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $51 (43 ) $28 (43 37 ) $59 (43 37 35 31 50 60 ) 
    s# 121 53 Select (<V var1$28 x>, <V var2$51 a>)
      set no: <r set_ctr$59 via  Set114>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 8 msec 0 reads         0% read 0 messages         0% clw
