
  { 
    time        60% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time        15% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 48 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        25% fanout         0 input         1 rows
    
    s# 76 30 END Node
    After test:
      0: BReturn 0
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.6e+03 Fanout:         0
    
    s# 83 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.6e+03 rows   
    Key RDF_QUAD_POGS  ASC  ()
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q3918" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   2.2e+03 Fanout:         0
    
    s# 92 33 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    2.2e+03 rows   
    Key RDF_QUAD_POGS  ASC  ()
     P =  IRI_ID"...direct/P17"  ,  O =  IRI_ID"...Q298" 
    
    time         0% fanout         0 input         0 rows
    
    s# 106 101 END Node
    After test:
      0: if (<c es> = <DB_NULL>) then 4 else 5 unkn 5
      4: BReturn 1
      5: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var1Label$28 x>)
    s# 114 35 Distinct (HASH) set no <r set_no$29 via  Set106 Set92 Set83 Set76>(<DB_NULL>)
    After code:
      0: <V var1Label$28 x> :=  := artm <DB_NULL>
      4: BReturn 0
    time         0% fanout         0 input         0 rows
    $29 (35 101 33 31 30 48 ) 
    s# 123 41 Subquery Select(<V var1Label$28 x>)
      set no: <r set_no$29 via  Set114 Set106 Set92 Set83 Set76>
    time         0% fanout         0 input         0 rows
    $55 (41 35 101 33 31 30 48 56 ) $28 (41 35 ) 
    s# 130 49 Select (<V var1Label$28 x>)
      set no: <r set_ctr$55 via  Set123>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 0 msec 0% cpu,         0 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
