
  { 
    time        11% fanout         1 input         1 rows
      clear: (<V set_ctr$44 in>)
    s# 47 45 cluster outer seq start, set no <V set_ctr$44 in>    
    save ctx:()
    time        89% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t1.S$28 rn>, <V s_37_6_t1.O$29 an>)
      clear on continue: (<V s_37_6_t1.S$28 rn>, <V s_37_6_t1.O$29 an>)
    s# 56 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t1.O$29 an>, <V s_37_6_t1.S$28 rn>)
     inlined  P =  IRI_ID"...P161" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
    $71 (31 ) $29 () 
    s# 67 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  ()
     inlined  P =  IRI_ID"...statement/P161"  ,  O =  IRI_ID"...Q550395"  ,  S = <v k_s_37_6_t1.O$71 Set73 rn>
    vector param casts: <V s_37_6_t1.O$29 an>-> <v k_s_37_6_t1.O$71 Set73 rn>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:    0.0011 Fanout:         0
      clear: (<V s_37_6_t0.S$34 rn>, <V var1$36 a>)
      clear on continue: (<V var1$36 a>, <V s_37_6_t0.S$34 rn>)$84 (33 ) $28 (31 ) 
    s# 80 33 from DB.DBA.RDF_QUAD by RDF_QUAD     0.0011 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t0.S$34 rn>)
     inlined  P =  IRI_ID"...direct/P31"  ,  S = <v k_s_37_6_t1.S$84 Set86 rn> ,  O =  IRI_ID"...Q5398426" 
    vector param casts: <r s_37_6_t1.S$28 via  Set67 Set73>-> <v k_s_37_6_t1.S$84 Set86 rn>
    
    After code:
      0: <V var1$36 a> := Call __id2in (<V s_37_6_t0.S$34 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $36 () $44 (33 31 27 45 ) 
    s# 94 38 Select (<V var1$36 a>)
      set no: <r set_ctr$44 via  Set80 Set86 Set67 Set73 Set56>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 27 msec 0 reads         0% read 0 messages         0% clw
