http://www.wikidata.org/entity/Q2608493	
http://www.wikidata.org/entity/Q2608594	
http://www.wikidata.org/entity/Q2704391	
http://www.wikidata.org/entity/Q2785255	
http://www.wikidata.org/entity/Q2787506	
http://www.wikidata.org/entity/Q2789600	
http://www.wikidata.org/entity/Q2916022	
http://www.wikidata.org/entity/Q2919849	
http://www.wikidata.org/entity/Q2920278	
http://www.wikidata.org/entity/Q2924877	
http://www.wikidata.org/entity/Q2983621	
http://www.wikidata.org/entity/Q2992490	
http://www.wikidata.org/entity/Q3232076	
http://www.wikidata.org/entity/Q3235149	
http://www.wikidata.org/entity/Q15917232	
http://www.wikidata.org/entity/Q56216	
http://www.wikidata.org/entity/Q381639	
http://www.wikidata.org/entity/Q381808	
http://www.wikidata.org/entity/Q498954	
http://www.wikidata.org/entity/Q1528494	

  { 
    time     0.052% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.012% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time       1.5% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    3.1e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q1248784" 
    
    time       4.4% fanout         1 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        94% fanout         1 input      1000 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.014% fanout         0 input      1000 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 7 msec 81% cpu,       897 rnd       998 seq         0% same seg   76.2806% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
