
  { 
    time         9% fanout         1 input         1 rows
      clear: (<V set_ctr$63 in>)
    s# 66 64 cluster outer seq start, set no <V set_ctr$63 in>    
    save ctx:()
    time       2.3% fanout         1 input         1 rows
      clear: (<V set_no$31 i>)
    s# 75 52 cluster outer seq start, set no <V set_no$31 i>    
    save ctx:()
    time        89% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   4.1e-08 Fanout:         0
      clear: (<V s_37_4_t1.O$33 an>, <V s_37_4_t1.S$34 rn>)
      clear on continue: (<V s_37_4_t1.O$33 an>, <V s_37_4_t1.S$34 rn>)
    s# 84 32 from DB.DBA.RDF_QUAD by RDF_QUAD    4.1e-08 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t1.S$34 rn>, <V s_37_4_t1.O$33 an>)
     inlined  P =  IRI_ID"...direct/570" 
    row specs:  O >= <tag 211 c 2017-05-20 00:00:00>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:     0.091 Fanout:         0
      clear: (<V s_37_4_t0.S$37 rn>)
      clear on continue: (<V s_37_4_t0.S$37 rn>)$34 () 
    s# 95 36 from DB.DBA.RDF_QUAD by RDF_QUAD      0.091 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t0.S$37 rn>)
     inlined  P =  IRI_ID"...direct/P31"  ,  S = <V s_37_4_t1.S$34 rn> ,  O =  IRI_ID"...Q5" 
    
    time         0% fanout         0 input         0 rows
      clear: (<V var2$30 an>, <V var1Label$29 x>, <V var1$28 rn>)$33 (36 ) $37 () 
    s# 105 39 Distinct (HASH) set no <r set_no$31 via  Set95 Set84>(<V s_37_4_t0.S$37 rn>, <r s_37_4_t1.O$33 via  Set95>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_4_t0.S$37 via  Set105>
      4: <V var1Label$29 x> :=  := artm <DB_NULL>
      8: <V var2$30 an> :=  := artm <r s_37_4_t1.O$33 via  Set105 Set95>
      12: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var2$55 a>, <V var1$53 a>)$31 (39 36 32 52 ) $28 (39 ) $30 (39 ) 
    s# 116 45 Subquery Select(<V var1$28 rn>, <V var1Label$29 x>, <V var2$30 an>)
      set no: <r set_no$31 via  Set105 Set95 Set84>
    After code:
      0: <V var1$53 a> := Call __ro2sq (<V var1$28 rn>)
      5: <V var2$55 a> := Call __ro2sq (<V var2$30 an>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $63 (45 39 36 32 52 64 ) $53 (45 ) $55 (45 ) $29 (45 39 ) 
    s# 123 57 Select (<V var1$53 a>, <V var1Label$29 x>, <V var2$55 a>)
      set no: <r set_ctr$63 via  Set116>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 8 msec 0 reads         0% read 0 messages         0% clw
