http://www.wikidata.org/entity/Q3769		http://commons.wikimedia.org/wiki/Special:FilePath/Flag%20of%20France.svg	
http://www.wikidata.org/entity/Q3769		http://commons.wikimedia.org/wiki/Special:FilePath/Flag%20of%20France.svg	
http://www.wikidata.org/entity/Q3769		http://commons.wikimedia.org/wiki/Special:FilePath/Flag%20of%20France.svg	
http://www.wikidata.org/entity/Q3769		http://commons.wikimedia.org/wiki/Special:FilePath/Flag%20of%20France.svg	
http://www.wikidata.org/entity/Q13917			
http://www.wikidata.org/entity/Q13917			

  { 
    time       1.2% fanout         1 input         1 rows
      clear: (<V set_ctr$35 in>)
    s# 56 36 cluster outer seq start, set no <V set_ctr$35 in>    
    save ctx:()
    time        18% fanout         4 input         1 rows
      clear: (<V t6.S$28 rn>)
      clear on continue: (<V t6.S$28 rn>)
    s# 65 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS          4 rows   
    Key RDF_QUAD_POGS  ASC  (<V t6.S$28 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q36784" 
    
    time        43% fanout         1 input         4 rows
    Precode:
      0: <V var1$30 a> := Call __id2in (<V t6.S$28 rn>)
      5: BReturn 0
      clear: (<V set_ctr$38 i>, <V var1$30 a>)
    s# 75 42 cluster outer seq start, set no <V set_ctr$38 i>    
    save ctx:()
    time        19% fanout         1 input         4 rows
      clear: (<V t7.O$33 a>)
      clear on continue: (<V t7.O$33 a>)$88 (32 ) $28 (42 ) 
    s# 84 32 from DB.DBA.RDF_QUAD by RDF_QUAD        1.1 rows   
    Key RDF_QUAD  ASC  (<V t7.O$33 a>)
     inlined  P =  IRI_ID"...direct/P41"  ,  S = <v k_t6.S$88 Set90 rn>
    vector param casts: <r t6.S$28 via  Set75>-> <v k_t6.S$88 Set90 rn>
    
    time        18% fanout       1.5 input         4 rows
      clear: (<V var3$47 a>)$33 () $38 (32 42 ) 
    s# 98 37 end of outer seq <r set_ctr$38 via  Set84 Set90>
     out: (<V t7.O$33 a>)
     shadow: ( <none> )
    After code:
      0: <V var3$47 a> := Call __ro2sq (<V t7.O$33 a>)
      5: BReturn 0
    time      0.47% fanout         0 input         6 rows
    $35 (37 32 42 27 36 ) $47 (37 ) $30 (37 32 42 ) 
    s# 106 49 Select (<r var1$30 via  Set98>, <DB_NULL>, <V var3$47 a>)
      set no: <r set_ctr$35 via  Set98 Set65>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 0 msec 13% cpu,         7 rnd         5 seq      37.5% same seg      12.5% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
