Error: 22007: DT001: Function year needs a datetime, date or time as argument 1, not an arg of type IRI_ID (243)
  { 
    time      0.34% fanout         1 input         1 rows
      clear: (<V set_ctr$45 in>)
    s# 48 46 cluster outer seq start, set no <V set_ctr$45 in>    
    save ctx:()
    time        13% fanout      2000 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:     5e+04 Fanout:     2e+03
      clear: (<V s_37_4_t0.S$28 rn>)
      clear on continue: (<V s_37_4_t0.S$28 rn>)
    s# 57 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS      5e+04 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$28 rn>)
     P =  IRI_ID"...direct/P27"  ,  O =  IRI_ID"...Q30" 
    
    time        72% fanout      0.97 input      2000 rows
      clear: (<V s_37_4_t1.O$31 an>)
      clear on continue: (<V s_37_4_t1.O$31 an>)
    s# 67 30 from DB.DBA.RDF_QUAD by RDF_QUAD       0.47 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t1.O$31 an>)
     inlined  P =  IRI_ID"...direct/P569"  ,  S = <V s_37_4_t0.S$28 rn>
    
    time        15% fanout         0 input      1940 rows
      clear: (<V rdf_year_impl$33 i>, <V var2$37 a>, <V var1$35 a>)$31 () $28 (30 ) 
    s# 82 77 END Node
    After test:
      0: <V rdf_year_impl$33 i> := Call rdf_year_impl (<V s_37_4_t1.O$31 an>)
      5: if ( 2005  = <V rdf_year_impl$33 i>) then 9 else 10 unkn 10
      9: BReturn 1
      10: BReturn 0
    After code:
      0: <V var1$35 a> := Call __id2in (<r s_37_4_t0.S$28 via  Set82 Set67>)
      5: <V var2$37 a> := Call __ro2sq (<r s_37_4_t1.O$31 via  Set82>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $35 (77 ) $37 (77 ) $45 (77 30 27 46 ) 
    s# 90 39 Select (<V var1$35 a>, <V var2$37 a>)
      set no: <r set_ctr$45 via  Set82 Set67 Set57>
  }
Warning: You might have a Cartesian product.



 2 msec 38% cpu,      2000 rnd      2048 seq   99.6002% same seg  0.149925% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
