
  { 
    time       6.6% fanout         1 input         1 rows
      clear: (<V set_ctr$50 in>)
    s# 53 51 cluster outer seq start, set no <V set_ctr$50 in>    
    save ctx:()
    time        93% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
    Precode:
      0: <V __rdflit$27 x> := Call __rdflit (rdflit150277)
      5: BReturn 0
      clear: (<V s_37_4_t0.S$30 rn>, <V __rdflit$27 x>)
      clear on continue: (<V s_37_4_t0.S$30 rn>)
    s# 62 29 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        0.3 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$30 rn>)
     P =  IRI_ID"...direct/P685"  ,  O = rdflit150277
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       8.5 Fanout:         0
      clear: (<V s_37_4_t1.P$33 rn>)
      clear on continue: (<V s_37_4_t1.P$33 rn>)
    s# 72 32 from DB.DBA.RDF_QUAD by RDF_QUAD_SP        8.5 rows   
    Key RDF_QUAD_SP  ASC  (<V s_37_4_t1.P$33 rn>)
     inlined  S = <V s_37_4_t0.S$30 rn>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.2 Fanout:         0
      clear: (<V s_37_4_t1.O$37 an>, <V var2$42 a>, <V var1$40 a>)
      clear on continue: (<V var1$40 a>, <V var2$42 a>, <V s_37_4_t1.O$37 an>)$33 () $86 (36 ) $30 (32 ) 
    s# 82 36 from DB.DBA.RDF_QUAD by RDF_QUAD        1.2 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t1.O$37 an>)
     inlined  P = <V s_37_4_t1.P$33 rn> ,  S = <v k_s_37_4_t0.S$86 Set88 rn>
    vector param casts: <r s_37_4_t0.S$30 via  Set72>-> <v k_s_37_4_t0.S$86 Set88 rn>
    
    After code:
      0: <V var1$40 a> := Call __id2in (<r s_37_4_t1.P$33 via  Set82 Set88>)
      5: <V var2$42 a> := Call __ro2sq (<V s_37_4_t1.O$37 an>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $40 () $42 () $50 (36 32 29 51 ) 
    s# 96 44 Select (<V var1$40 a>, <V var2$42 a>)
      set no: <r set_ctr$50 via  Set82 Set88 Set72 Set62>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 21 msec 1 reads   93.1176% read 0 messages         0% clw
