
  { 
    time       8.1% fanout         1 input         1 rows
      clear: (<V set_ctr$48 in>)
    s# 51 49 cluster outer seq start, set no <V set_ctr$48 in>    
    save ctx:()
    time        92% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
      clear: (<V s_37_6_t1.O$28 an>)
      clear on continue: (<V s_37_6_t1.O$28 an>)
    s# 60 27 from DB.DBA.RDF_QUAD by RDF_QUAD        0.3 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t1.O$28 an>)
     inlined  P =  IRI_ID"...direct/P50"  ,  S =  IRI_ID"...Q74287" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
      clear: (<V s_37_6_t0.S$31 rn>)
      clear on continue: (<V s_37_6_t0.S$31 rn>)
    s# 70 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        0.3 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t0.S$31 rn>)
     P =  IRI_ID"...direct/P50"  ,  O =  IRI_ID"...Q74287" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:        13 Fanout:         0
    Precode:
      0: <V var2$33 a> := Call __ro2sq (<r s_37_6_t1.O$28 via  Set70>)
      5: <V var1$35 a> := Call __id2in (<V s_37_6_t0.S$31 rn>)
      10: BReturn 0
      clear: (<V s_37_6_t2.S$38 rn>, <V var1$35 a>, <V var2$33 a>, <V var3$40 a>)
      clear on continue: (<V var3$40 a>, <V s_37_6_t2.S$38 rn>)$31 () $28 (30 ) 
    s# 80 37 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         13 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t2.S$38 rn>)
     P =  IRI_ID"...direct/P50"  ,  O =  IRI_ID"...Q892" 
    
    After code:
      0: <V var3$40 a> := Call __id2in (<V s_37_6_t2.S$38 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $33 (37 ) $35 (37 ) $40 () $48 (37 30 27 49 ) 
    s# 90 42 Select (<r var1$35 via  Set80>, <r var2$33 via  Set80>, <V var3$40 a>)
      set no: <r set_ctr$48 via  Set80 Set70 Set60>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 0 msec 2% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
