BE		Koninkrijk België	
BE		Koninkrijk België	
BE		Koninkrijk België	
BE		Koninkrijk België	
BE		Koninkrijk België	
BE		Koninkrijk België	
BE		Koninkrijk België	
BE		Koninkrijk België	
BE		Koninkrijk België	
BE		Koninkrijk België	
BE		Koninkrijk België	
BE		Koninkrijk België	
BE		Königreich Belgien	
BE		Königreich Belgien	
BE		Königreich Belgien	
BE		Königreich Belgien	
BE		Königreich Belgien	
BE		Königreich Belgien	
BE		Königreich Belgien	
BE		Königreich Belgien	

  { 
    time      0.45% fanout         1 input         1 rows
      clear: (<V set_ctr$47 in>)
    s# 50 48 cluster outer seq start, set no <V set_ctr$47 in>    
    save ctx:()
    time       8.3% fanout        43 input         1 rows
      clear: (<V s_37_6_t0.O$28 an>, <V s_37_6_t0.S$29 rn>)
      clear on continue: (<V s_37_6_t0.O$28 an>, <V s_37_6_t0.S$29 rn>)
    s# 59 27 from DB.DBA.RDF_QUAD by RDF_QUAD         43 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t0.S$29 rn>, <V s_37_6_t0.O$28 an>)
     inlined  P =  IRI_ID"...direct/P297" 
    
    time        39% fanout   2.88372 input        43 rows
    Precode:
      0: <V var1$31 a> := Call __ro2sq (<V s_37_6_t0.O$28 an>)
      5: BReturn 0
      clear: (<V s_37_6_t2.O$34 an>, <V s_37_6_t2.S$35 rn>, <V var1$31 a>)
      clear on continue: (<V s_37_6_t2.S$35 rn>, <V s_37_6_t2.O$34 an>)$28 () 
    s# 70 33 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t2.S$35 rn>, <V s_37_6_t2.O$34 an>)
     inlined  P =  IRI_ID"...direct/P1705"  ,  S = <V s_37_6_t0.S$29 rn>
    
    time        52% fanout   3.41935 input       124 rows
    Precode:
      0: <V var3Label$37 a> := Call __ro2sq (<V s_37_6_t2.O$34 an>)
      5: BReturn 0
      clear: (<V var3Label$37 a>)
      clear on continue: ()$34 () $85 (39 ) $29 (33 ) 
    s# 81 39 from DB.DBA.RDF_QUAD by RDF_QUAD        1.4 rows   
    Key RDF_QUAD  ASC  ()
     inlined  P =  IRI_ID"...direct/P37"  ,  S = <v k_s_37_6_t0.S$85 Set87 rn>
    vector param casts: <r s_37_6_t0.S$29 via  Set70>-> <v k_s_37_6_t0.S$85 Set87 rn>
    
    time     0.088% fanout         0 input       424 rows
    $31 (39 33 ) $37 (39 ) $47 (39 33 27 48 ) 
    s# 94 41 Select (<r var1$31 via  Set81 Set87 Set70>, <DB_NULL>, <r var3Label$37 via  Set81 Set87>)
      set no: <r set_ctr$47 via  Set81 Set87 Set70 Set59>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 1 msec 30% cpu,       335 rnd       428 seq   49.1071% same seg   5.65476% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
