
  { 
    time       2.6% fanout         1 input         1 rows
      clear: (<V set_ctr$49 in>)
    s# 52 50 cluster outer seq start, set no <V set_ctr$49 in>    
    save ctx:()
    time        97% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
    Precode:
      0: <V prop/qualifier/P21$27 r> := Call __i2idn (<tag 182 flag 1 c http://www.wikidata.org/prop/qualifier/P21>)
      5: BReturn 0
      clear: (<V s_37_4_t1.O$30 an>, <V s_37_4_t1.S$31 rn>, <V prop/qualifier/P21$27 r>)
      clear on continue: (<V s_37_4_t1.S$31 rn>, <V s_37_4_t1.O$30 an>)$65 (29 ) $27 (29 ) 
    s# 61 29 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t1.S$31 rn>, <V s_37_4_t1.O$30 an>)
     inlined  P = <v k_prop/qualifier/P21$65 Set67 rn>
    vector param casts: <V prop/qualifier/P21$27 r>-> <v k_prop/qualifier/P21$65 Set67 rn>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_4_t0.O$34 an>, <V s_37_4_t0.S$35 rn>, <V var2$41 a>, <V var1$39 a>, <V var3$37 a>)
      clear on continue: (<V s_37_4_t0.O$34 an>, <V s_37_4_t0.S$35 rn>, <V var2$41 a>, <V var1$39 a>, <V var3$37 a>)$31 () $80 (33 ) $30 () 
    s# 76 33 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$35 rn>, <V s_37_4_t0.O$34 an>)
     P =  IRI_ID"...prop/P18"  ,  O = <v cast$80 Set82 an>
    vector param casts: <V s_37_4_t1.S$31 rn>-> <v cast$80 Set82 an>
    
    After code:
      0: <V var3$37 a> := Call __ro2sq (<r s_37_4_t1.O$30 via  Set76 Set82>)
      5: <V var1$39 a> := Call __id2in (<V s_37_4_t0.S$35 rn>)
      10: <V var2$41 a> := Call __ro2sq (<V s_37_4_t0.O$34 an>)
      15: BReturn 0
    time         0% fanout         0 input         0 rows
    $37 () $39 () $41 () $49 (33 29 50 ) 
    s# 91 43 Select (<V var1$39 a>, <V var2$41 a>, <V var3$37 a>)
      set no: <r set_ctr$49 via  Set76 Set82 Set61 Set67>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         4 rnd        -1 seq         0% same seg         0% same pg 
Compilation: 100 msec 0 reads         0% read 0 messages         0% clw
