http://www.wikidata.org/entity/Q2640628	
http://www.wikidata.org/entity/Q2992915	
http://www.wikidata.org/entity/Q3062751	
http://www.wikidata.org/entity/Q3063524	
http://www.wikidata.org/entity/Q3063759	
http://www.wikidata.org/entity/Q3063974	
http://www.wikidata.org/entity/Q3111869	
http://www.wikidata.org/entity/Q3112363	
http://www.wikidata.org/entity/Q3120733	
http://www.wikidata.org/entity/Q3123275	
http://www.wikidata.org/entity/Q3125730	
http://www.wikidata.org/entity/Q3176748	
http://www.wikidata.org/entity/Q3237491	
http://www.wikidata.org/entity/Q15662248	
http://www.wikidata.org/entity/Q15913367	
http://www.wikidata.org/entity/Q2592378	
http://www.wikidata.org/entity/Q4356243	
http://www.wikidata.org/entity/Q56236	
http://www.wikidata.org/entity/Q56241	
http://www.wikidata.org/entity/Q56251	

  { 
    time      0.92% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$49 a>)
    s# 69 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        25% fanout      1000 input         1 rows
          clear: (<V s_37_2_t0.S$31 rn>)
          clear on continue: (<V s_37_2_t0.S$31 rn>)
        s# 73 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.2e+03 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
         P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q34770" 
        
        time        72% fanout     0.981 input      1000 rows
        
        s# 83 33 Distinct (HASH) set no <r set_no$29 via  Set73>(<V s_37_2_t0.S$31 rn>)
        time         2% fanout  0.101937 input       981 rows
          clear: (<V var1$28 rn>)$31 (33 ) 
        s# 91 47 skip node  100  <none> <r set_no$29 via  Set83 Set73>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set91 Set83>
          4: BReturn 0
        time      0.27% fanout         0 input       100 rows
        
        s# 69 39 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set91 Set83 Set73>
      }
    
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.22% fanout         0 input       100 rows
    $49 (27 ) $57 (27 58 ) 
    s# 107 51 Select (<V var1$49 a>)
      set no: <r set_ctr$57 via  Set69>
  }
Warning: You might have a Cartesian product.



 1 msec 44% cpu,        99 rnd       998 seq         0% same seg        66% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
