
  { 
    time        11% fanout         1 input         1 rows
      clear: (<V set_ctr$47 in>)
    s# 53 48 cluster outer seq start, set no <V set_ctr$47 in>    
    save ctx:()
    time        89% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         2 Fanout:         0
      clear: (<V s_37_4_t0.P$28 rn>)
      clear on continue: (<V s_37_4_t0.P$28 rn>)
    s# 62 27 from DB.DBA.RDF_QUAD by RDF_QUAD_SP          2 rows   
    Key RDF_QUAD_SP  ASC  (<V s_37_4_t0.P$28 rn>)
     inlined  S =  IRI_ID"...Q481874" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.2 Fanout:         0
      clear: (<V s_37_4_t0.O$32 an>)
      clear on continue: (<V s_37_4_t0.O$32 an>)
    s# 72 31 from DB.DBA.RDF_QUAD by RDF_QUAD        1.2 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t0.O$32 an>)
     inlined  P = <V s_37_4_t0.P$28 rn> ,  S =  IRI_ID"...Q481874" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   3.4e-05 Fanout:         0
    $86 (35 ) 
    s# 82 35 from DB.DBA.RDF_QUAD by RDF_QUAD    3.4e-05 rows   
    Key RDF_QUAD  ASC  ()
     inlined  P =  IRI_ID"...direct/P31"  ,  S = <v k_s_37_4_t0.O$86 Set88 rn> ,  O =  IRI_ID"...Q12737077" 
    vector param casts: <V s_37_4_t0.O$32 an>-> <v k_s_37_4_t0.O$86 Set88 rn>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var1$39 a>, <V var2$37 a>)$32 (35 ) $28 (35 31 ) 
    s# 95 51 skip node  100  <none> <r set_ctr$47 via  Set82 Set88 Set72 Set62>
    After code:
      0: <V var2$37 a> := Call __ro2sq (<r s_37_4_t0.O$32 via  Set95 Set82 Set88>)
      5: <V var1$39 a> := Call __id2in (<r s_37_4_t0.P$28 via  Set95 Set82 Set88 Set72>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $37 (51 ) $39 (51 ) $47 (51 35 31 27 48 ) 
    s# 103 41 Select (<V var1$39 a>, <V var2$37 a>)
      set no: <r set_ctr$47 via  Set95 Set82 Set88 Set72 Set62>
  }
Warning: You might have a Cartesian product.



 0 msec 2% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
