
  { 
    time      0.76% fanout         1 input         1 rows
      clear: (<V set_ctr$58 in>)
    s# 61 59 cluster outer seq start, set no <V set_ctr$58 in>    
    save ctx:()
      clear: (<V var2$29 x>, <V var1$28 a>, <V set_no$30 i>, <V var2$50 a>, <V var1$48 a>)
    s# 70 27 Subquery 27 
      multistate set no = <V set_no$30 i>
      { 
        time        10% fanout        36 input         1 rows
          clear: (<V s_37_4_t0.S$32 rn>)
          clear on continue: (<V s_37_4_t0.S$32 rn>)
        s# 74 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         36 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$32 rn>)
         P =  IRI_ID"...direct/P131"  ,  O =  IRI_ID"...Q95010" 
        
        time        89% fanout         0 input        36 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   8.8e-05 Fanout:         0
        
        s# 84 34 from DB.DBA.RDF_QUAD by RDF_QUAD    8.8e-05 rows   
        Key RDF_QUAD  ASC  ()
         inlined  P =  IRI_ID"...direct/P31"  ,  S = <V s_37_4_t0.S$32 rn> ,  O =  IRI_ID"...Q15284" 
        
        time         0% fanout         0 input         0 rows
          clear: (<V var2$29 x>, <V var1$28 a>, <V __id2in$36 a>)$32 (34 ) 
        s# 93 46 skip node  20  <none> <r set_no$30 via  Set84 Set74>
        After code:
          0: <V __id2in$36 a> := Call __id2in (<r s_37_4_t0.S$32 via  Set93 Set84>)
          5: <V var1$28 a> :=  := artm <V __id2in$36 a>
          9: <V var2$29 x> :=  := artm <DB_NULL>
          13: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 70 38 Subquery Select(<V var1$28 a>, <V var2$29 x>)
          set no: <r set_no$30 via  Set93 Set84 Set74>
      }
    
    After code:
      0: <V var1$48 a> := Call __ro2sq (<V var1$28 a>)
      5: <V var2$50 a> := Call __ro2sq (<V var2$29 x>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $48 (27 ) $50 (27 ) $58 (27 59 ) 
    s# 110 52 Select (<V var1$48 a>, <V var2$50 a>)
      set no: <r set_ctr$58 via  Set70>
  }
Warning: You might have a Cartesian product.



 1 msec 20% cpu,        37 rnd        35 seq   60.5263% same seg   26.3158% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
