http://www.wikidata.org/entity/Q2635044	
http://www.wikidata.org/entity/Q2776765	
http://www.wikidata.org/entity/Q2791334	
http://www.wikidata.org/entity/Q2798453	
http://www.wikidata.org/entity/Q2852892	
http://www.wikidata.org/entity/Q2855930	
http://www.wikidata.org/entity/Q2857635	
http://www.wikidata.org/entity/Q5885305	
http://www.wikidata.org/entity/Q15695147	
http://www.wikidata.org/entity/Q15695150	
http://www.wikidata.org/entity/Q15823424	
http://www.wikidata.org/entity/Q15824457	
http://www.wikidata.org/entity/Q15831459	
http://www.wikidata.org/entity/Q15834986	
http://www.wikidata.org/entity/Q15835040	
http://www.wikidata.org/entity/Q15835299	
http://www.wikidata.org/entity/Q15836753	
http://www.wikidata.org/entity/Q15896847	
http://www.wikidata.org/entity/Q15905670	
http://www.wikidata.org/entity/Q15905714	

  { 
    time     0.043% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time    0.0088% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time       4.3% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    4.9e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 2000-01-01 00:00:00Z> <= <tag 211 c 2000-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 2000-01-01 00:00:00Z> <= <tag 211 c 2000-12-31 23:59:59Z>
    
    time       3.4% fanout         1 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        92% fanout         1 input      1000 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.013% fanout         0 input      1000 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 9 msec 68% cpu,       957 rnd      1281 seq         0% same seg   32.0459% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
