
  { 
    time       2.4% fanout         1 input         1 rows
      clear: (<V set_ctr$62 in>)
    s# 65 63 cluster outer seq start, set no <V set_ctr$62 in>    
    save ctx:()
    time        63% fanout         1 input         1 rows
    Precode:
      0: <V prop/direct/Q10728033$27 r> := Call __i2idn (<tag 182 flag 1 c http://www.wikidata.org/prop/direct/Q10728033>)
      5: BReturn 0
      clear: (<V set_no$32 i>, <V prop/direct/Q10728033$27 r>)
    s# 74 51 cluster outer seq start, set no <V set_no$32 i>    
    save ctx:()
    time        34% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
      clear: (<V s_37_3_t0.O$34 an>)
      clear on continue: (<V s_37_3_t0.O$34 an>)$87 (33 ) $27 (51 ) 
    s# 83 33 from DB.DBA.RDF_QUAD by RDF_QUAD        0.3 rows   
    Key RDF_QUAD  ASC  (<V s_37_3_t0.O$34 an>)
     inlined  P =  IRI_ID"...direct/P625"  ,  S = <v k_prop/direct/Q10728033$87 Set89 rn>
    vector param casts: <r prop/direct/Q10728033$27 via  Set74>-> <v k_prop/direct/Q10728033$87 Set89 rn>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var2$31 a>, <V var1$30 s>, <V __ro2sq$42 a>)$34 () 
    s# 97 36 Distinct (HASH) set no <r set_no$32 via  Set83 Set89>(<V s_37_3_t0.O$34 an>)
    After code:
      0: <V __ro2sq$42 a> := Call __ro2sq (<r s_37_3_t0.O$34 via  Set97>)
      5: <V var1$30 s> :=  := artm <tag 182 flag 1 c http://www.wikidata.org/prop/direct/Q10728033>
      9: <V var2$31 a> :=  := artm <V __ro2sq$42 a>
      13: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var2$54 a>, <V var1$52 a>)$31 (36 ) $32 (36 33 51 ) $30 (36 ) 
    s# 107 44 Subquery Select(<V var1$30 s>, <V var2$31 a>)
      set no: <r set_no$32 via  Set97 Set83 Set89>
    After code:
      0: <V var1$52 a> := Call __ro2sq (<V var1$30 s>)
      5: <V var2$54 a> := Call __ro2sq (<V var2$31 a>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $62 (44 36 33 51 63 ) $52 (44 ) $54 (44 ) 
    s# 114 56 Select (<V var1$52 a>, <V var2$54 a>)
      set no: <r set_ctr$62 via  Set107>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         4 rnd         0 seq         0% same seg         0% same pg 
Compilation: 30 msec 0 reads         0% read 0 messages         0% clw
