http://www.wikidata.org/entity/Q434826	
http://www.wikidata.org/entity/Q57067	
http://www.wikidata.org/entity/Q57078	
http://www.wikidata.org/entity/Q57164	
http://www.wikidata.org/entity/Q57497	
http://www.wikidata.org/entity/Q57805	
http://www.wikidata.org/entity/Q58812	
http://www.wikidata.org/entity/Q65176	
http://www.wikidata.org/entity/Q76514	
http://www.wikidata.org/entity/Q707106	
http://www.wikidata.org/entity/Q71156	
http://www.wikidata.org/entity/Q71296	
http://www.wikidata.org/entity/Q71334	
http://www.wikidata.org/entity/Q71975	
http://www.wikidata.org/entity/Q72729	
http://www.wikidata.org/entity/Q72896	
http://www.wikidata.org/entity/Q73001	
http://www.wikidata.org/entity/Q73210	
http://www.wikidata.org/entity/Q73824	
http://www.wikidata.org/entity/Q74203	

  { 
    time       1.6% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$49 a>)
    s# 69 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        25% fanout       325 input         1 rows
          clear: (<V s_37_2_t0.S$31 rn>)
          clear on continue: (<V s_37_2_t0.S$31 rn>)
        s# 73 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    3.2e+02 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
         P =  IRI_ID"...direct/P463"  ,  O =  IRI_ID"...Q684415" 
        
        time        68% fanout  0.996923 input       325 rows
        
        s# 83 33 Distinct (HASH) set no <r set_no$29 via  Set73>(<V s_37_2_t0.S$31 rn>)
        time       4.3% fanout         1 input       324 rows
          clear: (<V var1$28 rn>)$31 (33 ) 
        s# 91 47 skip node  1000  <none> <r set_no$29 via  Set83 Set73>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set91 Set83>
          4: BReturn 0
        time      0.53% fanout         0 input       324 rows
        
        s# 69 39 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set91 Set83 Set73>
      }
    
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.39% fanout         0 input       324 rows
    $49 (27 ) $57 (27 58 ) 
    s# 107 51 Select (<V var1$49 a>)
      set no: <r set_ctr$57 via  Set69>
  }
Warning: You might have a Cartesian product.



 2 msec 6% cpu,       296 rnd       324 seq         0% same seg   39.0572% same pg 
Compilation: 19 msec 1 reads   89.3459% read 0 messages         0% clw
