Error: 23000: SR197: Non unique primary key on DB.DBA.RDF_OBJ.
  { 
    time     1e+02% fanout         1 input         1 rows
      clear: (<V set_ctr$46 in>)
    s# 49 47 cluster outer seq start, set no <V set_ctr$46 in>    
    save ctx:()
    time         0% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
    Precode:
      0: <V DB.DBA.RDF_OBJ_OF_SQLVAL$27 x> := Call DB.DBA.RDF_OBJ_OF_SQLVAL (<c 01-01-1000>)
      7: BReturn 0
      clear: (<V s_37_4_t1.O$30 an>, <V s_37_4_t1.S$31 rn>, <V DB.DBA.RDF_OBJ_OF_SQLVAL$27 x>)
      clear on continue: (<V s_37_4_t1.S$31 rn>, <V s_37_4_t1.O$30 an>)$62 (29 ) $66 (29 ) $27 (29 ) 
    s# 58 29 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t1.S$31 rn>, <V s_37_4_t1.O$30 an>)
     P =  IRI_ID"...direct/P571"  ,  O <= <v k_DB.DBA.RDF_OBJ_OF_SQLVAL$62 Set64 an>
    row specs:  O <= <V k_DB.DBA.RDF_OBJ_OF_SQLVAL$66 an>
    vector param casts: <V DB.DBA.RDF_OBJ_OF_SQLVAL$27 x>-> <v k_DB.DBA.RDF_OBJ_OF_SQLVAL$62 Set64 an>, <V DB.DBA.RDF_OBJ_OF_SQLVAL$27 x>-> <V k_DB.DBA.RDF_OBJ_OF_SQLVAL$66 an>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   0.00082 Fanout:         0
      clear: (<V s_37_4_t0.S$34 rn>, <V var1$38 a>, <V var2$36 a>)
      clear on continue: (<V s_37_4_t0.S$34 rn>, <V var1$38 a>, <V var2$36 a>)$31 () $30 () 
    s# 75 33 from DB.DBA.RDF_QUAD by RDF_QUAD    0.00082 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t0.S$34 rn>)
     inlined  P =  IRI_ID"...direct/P31"  ,  S = <V s_37_4_t1.S$31 rn> ,  O =  IRI_ID"...Q179700" 
    
    After code:
      0: <V var2$36 a> := Call __ro2sq (<r s_37_4_t1.O$30 via  Set75>)
      5: <V var1$38 a> := Call __id2in (<V s_37_4_t0.S$34 rn>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $36 () $38 () $46 (33 29 47 ) 
    s# 85 40 Select (<V var1$38 a>, <V var2$36 a>)
      set no: <r set_ctr$46 via  Set75 Set58 Set64>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         3 rnd         0 seq         0% same seg         0% same pg 
Compilation: 22 msec 1 reads   89.3189% read 0 messages         0% clw
