
  { 
    time        10% fanout         1 input         1 rows
      clear: (<V set_ctr$64 in>)
    s# 67 65 cluster outer seq start, set no <V set_ctr$64 in>    
    save ctx:()
    time       1.8% fanout         1 input         1 rows
      clear: (<V set_no$31 i>)
    s# 76 53 cluster outer seq start, set no <V set_no$31 i>    
    save ctx:()
    time        88% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         2 Fanout:         0
      clear: (<V s_37_3_t0.P$33 rn>)
      clear on continue: (<V s_37_3_t0.P$33 rn>)
    s# 85 32 from DB.DBA.RDF_QUAD by RDF_QUAD_SP          2 rows   
    Key RDF_QUAD_SP  ASC  (<V s_37_3_t0.P$33 rn>)
     inlined  S =  IRI_ID"...Q729978" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.2 Fanout:         0
      clear: (<V s_37_3_t0.O$37 an>)
      clear on continue: (<V s_37_3_t0.O$37 an>)
    s# 95 36 from DB.DBA.RDF_QUAD by RDF_QUAD        1.2 rows   
    Key RDF_QUAD  ASC  (<V s_37_3_t0.O$37 an>)
     inlined  P = <V s_37_3_t0.P$33 rn> ,  S =  IRI_ID"...Q729978" 
    
    time         0% fanout         0 input         0 rows
      clear: (<V var3$30 an>, <V var2$29 rn>, <V var1$28 s>)$33 (36 ) $37 () 
    s# 105 40 Distinct (HASH) set no <r set_no$31 via  Set95 Set85>(<r s_37_3_t0.P$33 via  Set95>, <V s_37_3_t0.O$37 an>)
    After code:
      0: <V var1$28 s> :=  := artm <tag 182 flag 1 c http://www.wikidata.org/entity/Q729978>
      4: <V var2$29 rn> :=  := artm <r s_37_3_t0.P$33 via  Set105 Set95>
      8: <V var3$30 an> :=  := artm <r s_37_3_t0.O$37 via  Set105>
      12: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var3$56 a>, <V var2$54 a>)$31 (40 36 32 53 ) $29 (40 ) $30 (40 ) 
    s# 116 46 Subquery Select(<V var1$28 s>, <V var2$29 rn>, <V var3$30 an>)
      set no: <r set_no$31 via  Set105 Set95 Set85>
    After code:
      0: <V var2$54 a> := Call __ro2sq (<V var2$29 rn>)
      5: <V var3$56 a> := Call __ro2sq (<V var3$30 an>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $64 (46 40 36 32 53 65 ) $54 (46 ) $56 (46 ) $28 (46 40 ) 
    s# 123 58 Select (<V var1$28 s>, <V var2$54 a>, <V var3$56 a>)
      set no: <r set_ctr$64 via  Set116>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 29 msec 0 reads         0% read 0 messages         0% clw
