http://www.wikidata.org/entity/Q2615352	
http://www.wikidata.org/entity/Q2616694	
http://www.wikidata.org/entity/Q2641306	
http://www.wikidata.org/entity/Q2771346	
http://www.wikidata.org/entity/Q2785205	
http://www.wikidata.org/entity/Q2852305	
http://www.wikidata.org/entity/Q2919183	
http://www.wikidata.org/entity/Q2919207	
http://www.wikidata.org/entity/Q3057846	
http://www.wikidata.org/entity/Q3118818	
http://www.wikidata.org/entity/Q3122380	
http://www.wikidata.org/entity/Q15906427	
http://www.wikidata.org/entity/Q15917222	
http://www.wikidata.org/entity/Q16301703	
http://www.wikidata.org/entity/Q16301785	
http://www.wikidata.org/entity/Q41725143	
http://www.wikidata.org/entity/Q57105	
http://www.wikidata.org/entity/Q74373	
http://www.wikidata.org/entity/Q74384	
http://www.wikidata.org/entity/Q74445	

  { 
    time       0.9% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$49 a>)
    s# 69 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        19% fanout      1000 input         1 rows
          clear: (<V s_37_2_t0.S$31 rn>)
          clear on continue: (<V s_37_2_t0.S$31 rn>)
        s# 73 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    3.3e+03 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
         P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q3257686" 
        
        time        75% fanout         1 input      1000 rows
        
        s# 83 33 Distinct (HASH) set no <r set_no$29 via  Set73>(<V s_37_2_t0.S$31 rn>)
        time       4.3% fanout         1 input      1000 rows
          clear: (<V var1$28 rn>)$31 (33 ) 
        s# 91 47 skip node  10000  <none> <r set_no$29 via  Set83 Set73>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set91 Set83>
          4: BReturn 0
        time      0.21% fanout         0 input      1000 rows
        
        s# 69 39 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set91 Set83 Set73>
      }
    
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.17% fanout         0 input      1000 rows
    $49 (27 ) $57 (27 58 ) 
    s# 107 51 Select (<V var1$49 a>)
      set no: <r set_ctr$57 via  Set69>
  }
Warning: You might have a Cartesian product.



 20 msec 93% cpu,       992 rnd       998 seq         0% same seg   48.3384% same pg 
1 disk reads, 0 read ahead,   70.1667% wait
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
