
  { 
    time       5.1% fanout         1 input         1 rows
      clear: (<V set_ctr$60 in>)
    s# 63 61 cluster outer seq start, set no <V set_ctr$60 in>    
    save ctx:()
      clear: (<V var1$28 an>, <V set_no$29 i>, <V var1$52 a>)
    s# 72 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        95% fanout         0 input         1 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
          clear: (<V s_37_4_t0.S$31 rn>)
          clear on continue: (<V s_37_4_t0.S$31 rn>)
        s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        0.3 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$31 rn>)
         P =  IRI_ID"...directClaim"  ,  O =  IRI_ID"...direct/P1082" 
        
        time         0% fanout         0 input         0 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         1 Fanout:         0
          clear: (<V s_37_4_t1.O$34 an>)
          clear on continue: (<V s_37_4_t1.O$34 an>)$31 () 
        s# 86 33 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
        Key RDF_QUAD  ASC  (<V s_37_4_t1.O$34 an>)
         inlined  P =  IRI_ID"...direct/P585"  ,  S = <V s_37_4_t0.S$31 rn>
        
        time         0% fanout         0 input         0 rows
        
        s# 96 36 Distinct (HASH) set no <r set_no$29 via  Set86 Set76>(<V s_37_4_t1.O$34 an>)
        time         0% fanout         0 input         0 rows
          clear: (<V var1$28 an>)$34 (36 ) 
        s# 104 50 skip node  100  <none> <r set_no$29 via  Set96 Set86 Set76>
        After code:
          0: <V var1$28 an> :=  := artm <r s_37_4_t1.O$34 via  Set104 Set96>
          4: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 72 42 Subquery Select(<V var1$28 an>)
          set no: <r set_no$29 via  Set104 Set96 Set86 Set76>
      }
    
    After code:
      0: <V var1$52 a> := Call __ro2sq (<V var1$28 an>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $52 (27 ) $60 (27 61 ) 
    s# 120 54 Select (<V var1$52 a>)
      set no: <r set_ctr$60 via  Set72>
  }
Warning: You might have a Cartesian product.



 0 msec 4% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
