http://www.w3.org/2002/07/owl#Thing		
http://www.w3.org/2002/07/owl#Nothing		
http://www.wikidata.org/prop/novalue/P1476		
http://www.wikidata.org/prop/novalue/P1081		
http://www.wikidata.org/prop/novalue/P1084		
http://www.wikidata.org/prop/novalue/P1103		
http://www.wikidata.org/prop/novalue/P1161		
http://www.wikidata.org/prop/novalue/P1193		
http://www.wikidata.org/prop/novalue/P1201		
http://www.wikidata.org/prop/novalue/P1204		

  { 
    time       1.3% fanout         1 input         1 rows
      clear: (<V set_ctr$58 in>)
    s# 61 59 cluster outer seq start, set no <V set_ctr$58 in>    
    save ctx:()
      clear: (<V var2$29 x>, <V var1$28 rn>, <V set_no$30 i>, <V var1$50 a>)
    s# 70 27 Subquery 27 
      multistate set no = <V set_no$30 i>
      { 
        time        21% fanout       567 input         1 rows
          clear: (<V s_37_2_t0.S$32 rn>)
          clear on continue: (<V s_37_2_t0.S$32 rn>)
        s# 74 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    5.7e+02 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$32 rn>)
         P =  IRI_ID"...type"  ,  O =  IRI_ID"...Class" 
        
        time        74% fanout  0.996473 input       567 rows
        
        s# 84 34 Distinct (HASH) set no <r set_no$30 via  Set74>(<V s_37_2_t0.S$32 rn>)
        time       3.4% fanout 0.0176991 input       565 rows
          clear: (<V var2$29 x>, <V var1$28 rn>)$32 (34 ) 
        s# 92 48 skip node  10  <none> <r set_no$30 via  Set84 Set74>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$32 via  Set92 Set84>
          4: <V var2$29 x> :=  := artm <DB_NULL>
          8: BReturn 0
        time      0.43% fanout         0 input        10 rows
        
        s# 70 40 Subquery Select(<V var1$28 rn>, <V var2$29 x>)
          set no: <r set_no$30 via  Set92 Set84 Set74>
      }
    
    After code:
      0: <V var1$50 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.35% fanout         0 input        10 rows
    $50 (27 ) $58 (27 59 ) $29 (27 ) 
    s# 109 52 Select (<V var1$50 a>, <V var2$29 x>)
      set no: <r set_ctr$58 via  Set70>
  }
Warning: You might have a Cartesian product.



 1 msec 23% cpu,        11 rnd       566 seq         0% same seg   33.3333% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
