http://www.wikidata.org/entity/Q15823232	
http://www.wikidata.org/entity/Q2164483	
http://www.wikidata.org/entity/Q241718	
http://www.wikidata.org/entity/Q526805	
http://www.wikidata.org/entity/Q528361	
http://www.wikidata.org/entity/Q155488	
http://www.wikidata.org/entity/Q1163587	
http://www.wikidata.org/entity/Q1237746	
http://www.wikidata.org/entity/Q1294871	
http://www.wikidata.org/entity/Q1332847	

  { 
    time      0.55% fanout         1 input         1 rows
      clear: (<V set_ctr$59 in>)
    s# 62 60 cluster outer seq start, set no <V set_ctr$59 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$51 a>)
    s# 71 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time       8.7% fanout        65 input         1 rows
          clear: (<V s_37_4_t0.S$31 rn>)
          clear on continue: (<V s_37_4_t0.S$31 rn>)
        s# 75 30 from DB.DBA.RDF_QUAD by RDF_QUAD         65 rows   
        Key RDF_QUAD  ASC  (<V s_37_4_t0.S$31 rn>)
         inlined  P =  IRI_ID"...direct/P2778" 
        
        time        70% fanout         1 input        65 rows
        
        s# 85 33 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
        Key RDF_QUAD  ASC  ()
         inlined  P =  IRI_ID"...direct/P21"  ,  S = <V s_37_4_t0.S$31 rn>
        
        time        19% fanout         1 input        65 rows
        
        s# 94 35 Distinct (HASH) set no <r set_no$29 via  Set85 Set75>(<r s_37_4_t0.S$31 via  Set85>)
        time      0.87% fanout  0.153846 input        65 rows
          clear: (<V var1$28 rn>)$31 (35 33 ) 
        s# 102 49 skip node  10  <none> <r set_no$29 via  Set94 Set85 Set75>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_4_t0.S$31 via  Set102 Set94 Set85>
          4: BReturn 0
        time      0.17% fanout         0 input        10 rows
        
        s# 71 41 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set102 Set94 Set85 Set75>
      }
    
    After code:
      0: <V var1$51 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.13% fanout         0 input        10 rows
    $51 (27 ) $59 (27 60 ) 
    s# 118 53 Select (<V var1$51 a>)
      set no: <r set_ctr$59 via  Set71>
  }
Warning: You might have a Cartesian product.



 0 msec 33% cpu,        71 rnd        64 seq   63.8889% same seg        25% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
