http://www.wikidata.org/entity/Q11427903	
http://www.wikidata.org/entity/Q1587431	
http://www.wikidata.org/entity/Q16652489	
http://www.wikidata.org/entity/Q3694218	
http://www.wikidata.org/entity/Q12587763	
http://www.wikidata.org/entity/Q15116549	
http://www.wikidata.org/entity/Q1508871	
http://www.wikidata.org/entity/Q2005001	
http://www.wikidata.org/entity/Q24265028	
http://www.wikidata.org/entity/Q28970585	
http://www.wikidata.org/entity/Q1506357	
http://www.wikidata.org/entity/Q21039226	
http://www.wikidata.org/entity/Q16491643	
http://www.wikidata.org/entity/Q20120258	
http://www.wikidata.org/entity/Q69088	
http://www.wikidata.org/entity/Q1745211	
http://www.wikidata.org/entity/Q7822504	
http://www.wikidata.org/entity/Q993279	
http://www.wikidata.org/entity/Q29246865	
http://www.wikidata.org/entity/Q3185377	

  { 
    time      0.14% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.036% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        68% fanout       127 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.3e+02 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1903-08-01 00:00:00Z> <= <tag 211 c 1903-08-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1903-08-01 00:00:00Z> <= <tag 211 c 1903-08-31 23:59:59Z>
    
    time       5.3% fanout  0.992126 input       127 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        26% fanout         1 input       126 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.035% fanout         0 input       126 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 3 msec 62% cpu,        11 rnd     10785 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
