
  { 
    time       7.2% fanout         1 input         1 rows
      clear: (<V set_ctr$68 in>)
    s# 71 69 cluster outer seq start, set no <V set_ctr$68 in>    
    save ctx:()
    Precode:
      0: <V __rdflit$27 x> := Call __rdflit (rdflit29450850)
      5: BReturn 0
      clear: (<V var1$30 a>, <V set_no$31 i>, <V __rdflit$27 x>, <V var1$60 a>)
    s# 80 29 Subquery 29 
      multistate set no = <V set_no$31 i>
      { 
        time       4.8% fanout         1 input         1 rows
        
        s# 103 37 Fork 37 {  
                
            save ctx:()
              set no = <V set_no$31 i> array  <none>  save: 
            time        83% fanout         0 input         1 rows
            Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
              clear: (<V s_37_2_t0.S$33 rn>, <V __id2in$35 a>)
              clear on continue: (<V s_37_2_t0.S$33 rn>, <V __id2in$35 a>)
            s# 85 32 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        0.3 rows Parallel, tail cost       9.7   
            Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$33 rn>)
             P =  IRI_ID"...direct/P238"  ,  O = rdflit29450850
            copy on branch $31 $0 $0 $0 sets: 71 
            
            After code:
              0: <V __id2in$35 a> := Call __id2in (<V s_37_2_t0.S$33 rn>)
              5: BReturn 0
            time         0% fanout         0 input         0 rows
            
            s# 95 38 Sort (HASH) set no <r set_no$31 via  Set85>(<V __id2in$35 a>)
        }
        time       5.5% fanout         0 input         1 rows
          clear: (<V __id2in$35 a>, <V var1$30 a>)
          clear on continue: (<V __id2in$35 a>, <V var1$30 a>)
        s# 110 43 Key from temp (<V __id2in$35 a>)
        
        
        After code:
          0: <V var1$30 a> :=  := artm <V __id2in$35 a>
          4: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 80 53 Subquery Select(<V var1$30 a>)
          set no: <r set_no$31 via  Set110>
      }
    
    After code:
      0: <V var1$60 a> := Call __ro2sq (<V var1$30 a>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $68 (29 69 ) $60 (29 ) 
    s# 127 62 Select (<V var1$60 a>)
      set no: <r set_ctr$68 via  Set80>
  }


 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 29 msec 1 reads   95.8883% read 0 messages         0% clw
