http://www.wikidata.org/entity/Q25267528	http://www.w3.org/2002/07/owl#sameAs	
http://www.wikidata.org/entity/Q27303676	http://www.wikidata.org/prop/direct/P1074	
http://www.wikidata.org/entity/Q2520963	http://www.wikidata.org/prop/direct/P4675	
http://www.wikidata.org/entity/Q15835811	http://www.wikidata.org/prop/direct/P31	
http://www.wikidata.org/entity/Q15836515	http://www.wikidata.org/prop/direct/P31	
http://www.wikidata.org/entity/Q7243868	http://www.wikidata.org/prop/direct/P31	
http://www.wikidata.org/entity/Q1413628	http://www.wikidata.org/prop/direct/P31	
http://www.wikidata.org/entity/Q7430467	http://www.wikidata.org/prop/direct/P31	
http://www.wikidata.org/entity/Q27745008	http://www.wikidata.org/prop/direct/P31	
http://www.wikidata.org/entity/Q1750907	http://www.wikidata.org/prop/direct/P31	

  { 
    time      0.64% fanout         1 input         1 rows
      clear: (<V set_ctr$45 in>)
    s# 51 46 cluster outer seq start, set no <V set_ctr$45 in>    
    save ctx:()
    time         7% fanout        11 input         1 rows
      clear: (<V s_37_2_t0.P$28 rn>)
      clear on continue: (<V s_37_2_t0.P$28 rn>)
    s# 60 27 from DB.DBA.RDF_QUAD by RDF_QUAD_OP         11 rows   
    Key RDF_QUAD_OP  ASC  (<V s_37_2_t0.P$28 rn>)
     inlined  O =  IRI_ID"...Q146" 
    
    time        49% fanout   8.45455 input        11 rows
      clear: (<V s_37_2_t0.S$32 rn>)
      clear on continue: (<V s_37_2_t0.S$32 rn>)
    s# 70 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        1.2 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$32 rn>)
     P = <V s_37_2_t0.P$28 rn> ,  O =  IRI_ID"...Q146" 
    
    time        43% fanout  0.107527 input        93 rows
      clear: (<V var2$37 a>, <V var1$35 a>)$32 () $28 (31 ) 
    s# 80 49 skip node  10  <none> <r set_ctr$45 via  Set70 Set60>
    After code:
      0: <V var1$35 a> := Call __id2in (<r s_37_2_t0.S$32 via  Set80>)
      5: <V var2$37 a> := Call __id2in (<r s_37_2_t0.P$28 via  Set80 Set70>)
      10: BReturn 0
    time      0.12% fanout         0 input        10 rows
    $35 (49 ) $37 (49 ) $45 (49 31 27 46 ) 
    s# 88 39 Select (<V var1$35 a>, <V var2$37 a>)
      set no: <r set_ctr$45 via  Set80 Set70 Set60>
  }
Warning: You might have a Cartesian product.



 1 msec 32% cpu,        16 rnd        92 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
