Error: 23000: SR197: Non unique primary key on DB.DBA.RDF_OBJ.
  { 
    time     1e+02% fanout         1 input         1 rows
      clear: (<V set_ctr$60 in>)
    s# 63 61 cluster outer seq start, set no <V set_ctr$60 in>    
    save ctx:()
    time         0% fanout         0 input         1 rows
    Precode:
      0: <V DB.DBA.RDF_OBJ_OF_SQLVAL$27 x> := Call DB.DBA.RDF_OBJ_OF_SQLVAL (<c WP716>)
      7: BReturn 0
      clear: (<V set_no$32 i>, <V DB.DBA.RDF_OBJ_OF_SQLVAL$27 x>)
    s# 72 51 cluster outer seq start, set no <V set_no$32 i>    
    save ctx:()
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
      clear: (<V s_37_5_t0.S$34 rn>)
      clear on continue: (<V s_37_5_t0.S$34 rn>)$85 (33 ) $27 (51 ) 
    s# 81 33 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        0.3 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_5_t0.S$34 rn>)
     P =  IRI_ID"...direct/P2410"  ,  O = <v k_DB.DBA.RDF_OBJ_OF_SQLVAL$85 Set87 an>
    vector param casts: <r DB.DBA.RDF_OBJ_OF_SQLVAL$27 via  Set72>-> <v k_DB.DBA.RDF_OBJ_OF_SQLVAL$85 Set87 an>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         1 Fanout:         0
    
    s# 95 36 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  ()
     inlined  P =  IRI_ID"...direct/P2888"  ,  S = <V s_37_5_t0.S$34 rn>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var2$31 x>, <V var1$30 rn>)$34 (36 ) 
    s# 104 38 Distinct (HASH) set no <r set_no$32 via  Set95 Set81 Set87>(<r s_37_5_t0.S$34 via  Set95>)
    After code:
      0: <V var1$30 rn> :=  := artm <r s_37_5_t0.S$34 via  Set104 Set95>
      4: <V var2$31 x> :=  := artm <DB_NULL>
      8: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var1$52 a>)$32 (38 36 33 51 ) $30 (38 ) 
    s# 114 44 Subquery Select(<V var1$30 rn>, <V var2$31 x>)
      set no: <r set_no$32 via  Set104 Set95 Set81 Set87>
    After code:
      0: <V var1$52 a> := Call __ro2sq (<V var1$30 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $31 (44 38 ) $52 (44 ) $60 (44 38 36 33 51 61 ) 
    s# 121 54 Select (<V var1$52 a>, <V var2$31 x>)
      set no: <r set_ctr$60 via  Set114>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         3 rnd         0 seq         0% same seg         0% same pg 
Compilation: 25 msec 1 reads   92.6041% read 0 messages         0% clw
