http://www.wikidata.org/entity/Q229789			
http://www.wikidata.org/entity/Q229800			
http://www.wikidata.org/entity/Q13037020			
http://www.wikidata.org/entity/Q462690			
http://www.wikidata.org/entity/Q4974259			
http://www.wikidata.org/entity/Q4979270			
http://www.wikidata.org/entity/Q23772353			
http://www.wikidata.org/entity/Q9250329			
http://www.wikidata.org/entity/Q236081			
http://www.wikidata.org/entity/Q15813205			
http://www.wikidata.org/entity/Q3300595			
http://www.wikidata.org/entity/Q3304274			
http://www.wikidata.org/entity/Q4961990			

  { 
    time    0.0079% fanout         1 input         1 rows
      clear: (<V set_ctr$43 in>)
    s# 46 44 cluster outer seq start, set no <V set_ctr$43 in>    
    save ctx:()
    time      0.14% fanout       454 input         1 rows
      clear: (<V s_37_6_t0.S$28 rn>)
      clear on continue: (<V s_37_6_t0.S$28 rn>)
    s# 55 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    4.5e+02 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t0.S$28 rn>)
     P =  IRI_ID"...direct/P27"  ,  O =  IRI_ID"...Q222" 
    
    time       3.4% fanout 0.0462555 input       454 rows
      clear: (<V s_37_6_t2.S$31 rn>)
      clear on continue: (<V s_37_6_t2.S$31 rn>)
    s# 65 30 from DB.DBA.RDF_QUAD by RDF_QUAD      0.015 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t2.S$31 rn>)
     inlined  P =  IRI_ID"...direct/P106"  ,  S = <V s_37_6_t0.S$28 rn> ,  O =  IRI_ID"...Q177220" 
    
    time        96% fanout  0.619048 input        21 rows
      clear: (<V var1$35 a>)
      clear on continue: (<V var1$35 a>)$79 (33 ) $28 (30 ) 
    s# 75 33 from DB.DBA.RDF_QUAD by RDF_QUAD       0.17 rows   
    Key RDF_QUAD  ASC  ()
     inlined  P =  IRI_ID"...direct/P21"  ,  S = <v k_s_37_6_t0.S$79 Set81 rn> ,  O =  IRI_ID"...Q6581072" 
    vector param casts: <r s_37_6_t0.S$28 via  Set65>-> <v k_s_37_6_t0.S$79 Set81 rn>
    
    After code:
      0: <V var1$35 a> := Call __id2in (<r s_37_6_t0.S$28 via  Set75 Set81 Set65>)
      5: BReturn 0
    time     0.001% fanout         0 input        13 rows
    $35 () $43 (33 30 27 44 ) 
    s# 88 37 Select (<V var1$35 a>, <DB_NULL>, <DB_NULL>)
      set no: <r set_ctr$43 via  Set75 Set81 Set65 Set55>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 45 msec 95% cpu,       489 rnd       453 seq   83.4694% same seg   12.8571% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
