http://www.wikidata.org/entity/Q15830712	-490-01-01 00:00:00Z	
http://www.wikidata.org/entity/Q32457821	1998-01-01 00:00:00Z	
http://www.wikidata.org/entity/Q5641435	1877-01-01 00:00:00Z	
http://www.wikidata.org/entity/Q6906858	1971-01-01 00:00:00Z	
http://www.wikidata.org/entity/Q7604492	1633-01-01 00:00:00Z	
http://www.wikidata.org/entity/Q12055475	1927-01-01 00:00:00Z	
http://www.wikidata.org/entity/Q15875239	1963-01-01 00:00:00Z	
http://www.wikidata.org/entity/Q20860980	1872-01-01 00:00:00Z	
http://www.wikidata.org/entity/Q21280625	1687-01-01 00:00:00Z	
http://www.wikidata.org/entity/Q21286535	1891-01-01 00:00:00Z	

  { 
    time    0.0045% fanout         1 input         1 rows
      clear: (<V set_ctr$35 in>)
    s# 59 36 cluster outer seq start, set no <V set_ctr$35 in>    
    save ctx:()
    time      0.13% fanout      1000 input         1 rows
      clear: (<V t1.S$28 rn>)
      clear on continue: (<V t1.S$28 rn>)
    s# 68 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    4.8e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V t1.S$28 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q179700" 
    
    time        99% fanout         1 input      1000 rows
    Precode:
      0: <V var1$30 a> := Call __id2in (<V t1.S$28 rn>)
      5: BReturn 0
      clear: (<V set_ctr$38 i>, <V var1$30 a>)
    s# 78 42 cluster outer seq start, set no <V set_ctr$38 i>    
    save ctx:()
    time      0.66% fanout     0.131 input      1000 rows
      clear: (<V t3.O$33 a>)
      clear on continue: (<V t3.O$33 a>)$28 (42 ) $91 (32 ) 
    s# 87 32 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V t3.O$33 a>)
     inlined  P =  IRI_ID"...direct/P571"  ,  S = <v k_t1.S$91 Set93 rn>
    vector param casts: <r t1.S$28 via  Set78>-> <v k_t1.S$91 Set93 rn>
    
    time    0.0039% fanout         1 input       131 rows
    $38 (32 42 ) 
    s# 101 37 end of outer seq <r set_ctr$38 via  Set87 Set93>
     out: (<V t3.O$33 a>)
     shadow: ( <none> )
    time    0.0068% fanout 0.0763359 input       131 rows
      clear: (<V var2$47 a>)$33 (37 ) 
    s# 109 57 skip node  10  <none> <r set_ctr$35 via  Set101 Set68>
    After code:
      0: <V var2$47 a> := Call __ro2sq (<r t3.O$33 via  Set109>)
      5: BReturn 0
    time   0.00077% fanout         0 input        10 rows
    $35 (57 37 32 42 27 36 ) $47 (57 ) $30 (57 37 32 42 ) 
    s# 117 49 Select (<r var1$30 via  Set109 Set101>, <V var2$47 a>)
      set no: <r set_ctr$35 via  Set109 Set101 Set68>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 55 msec 97% cpu,      1992 rnd       998 seq   49.1721% same seg   42.1475% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
