http://www.wikidata.org/entity/Q7161160	
http://www.wikidata.org/entity/Q11903888	
http://www.wikidata.org/entity/Q218215	
http://www.wikidata.org/entity/Q1136623	
http://www.wikidata.org/entity/Q1537896	
http://www.wikidata.org/entity/Q3739416	
http://www.wikidata.org/entity/Q28062435	
http://www.wikidata.org/entity/Q1454470	
http://www.wikidata.org/entity/Q1656476	
http://www.wikidata.org/entity/Q4268340	
http://www.wikidata.org/entity/Q18223477	
http://www.wikidata.org/entity/Q10269953	
http://www.wikidata.org/entity/Q12382698	
http://www.wikidata.org/entity/Q2530678	
http://www.wikidata.org/entity/Q1263788	
http://www.wikidata.org/entity/Q2598247	
http://www.wikidata.org/entity/Q10956937	
http://www.wikidata.org/entity/Q16077421	
http://www.wikidata.org/entity/Q2284759	
http://www.wikidata.org/entity/Q16616242	

  { 
    time      0.15% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.026% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        82% fanout        20 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         20 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P570"  ,  O >= <tag 211 c 1000-01-01 00:00:00Z> <= <tag 211 c 1000-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1000-01-01 00:00:00Z> <= <tag 211 c 1000-12-31 23:59:59Z>
    
    time       4.8% fanout         1 input        20 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        13% fanout         1 input        20 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.036% fanout         0 input        20 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 3 msec 40% cpu,        21 rnd     10759 seq         0% same seg         0% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
