http://www.wikidata.org/entity/Q2449503	
http://www.wikidata.org/entity/Q1097630	
http://www.wikidata.org/entity/Q48270	
http://www.wikidata.org/entity/Q43445	
http://www.wikidata.org/entity/Q6581072	
http://www.wikidata.org/entity/Q12979140	
http://www.wikidata.org/entity/Q189125	
http://www.wikidata.org/entity/Q301702	
http://www.wikidata.org/entity/Q6581097	
http://www.wikidata.org/entity/Q1052281	
http://www.wikidata.org/entity/Q179294	
http://www.wikidata.org/entity/Q17148251	
http://www.wikidata.org/entity/Q44148	
http://www.wikidata.org/entity/Q27679766	
http://www.wikidata.org/entity/Q12964198	
http://www.wikidata.org/entity/Q505371	
http://www.wikidata.org/entity/Q52261234	
http://www.wikidata.org/entity/Q16674976	
http://www.wikidata.org/entity/Q303479	
http://www.wikidata.org/entity/Q18116794	

  { 
    time     0.014% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.003% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        12% fanout    516000 input         1 rows
      clear: (<V s_37_3_t0.O$31 an>)
      clear on continue: (<V s_37_3_t0.O$31 an>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    5.2e+05 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_3_t0.O$31 an>)
     inlined  P =  IRI_ID"...direct/P21" 
    
    time        85% fanout 0.000420543 input    516000 rows
      clear: (<V var1$28 an>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_3_t0.O$31 an>)
    After code:
      0: <V var1$28 an> :=  := artm <r s_37_3_t0.O$31 via  Set86>
      4: BReturn 0
    time       3.3% fanout         1 input       217 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 an>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 an>)
      5: BReturn 0
    time    0.0062% fanout         0 input       217 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 27 msec 95% cpu,        20 rnd    515452 seq         0% same seg    4.7619% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
