
  { 
    time       8.8% fanout         1 input         1 rows
      clear: (<V set_ctr$62 in>)
    s# 65 63 cluster outer seq start, set no <V set_ctr$62 in>    
    save ctx:()
    time       2.4% fanout         1 input         1 rows
      clear: (<V set_no$30 i>)
    s# 74 51 cluster outer seq start, set no <V set_no$30 i>    
    save ctx:()
    time        89% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_4_t1.O$32 an>, <V s_37_4_t1.S$33 rn>)
      clear on continue: (<V s_37_4_t1.O$32 an>, <V s_37_4_t1.S$33 rn>)
    s# 83 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t1.S$33 rn>, <V s_37_4_t1.O$32 an>)
     inlined  P =  IRI_ID"...statement/P699" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_4_t0.S$36 rn>)
      clear on continue: (<V s_37_4_t0.S$36 rn>)$33 () $98 (35 ) 
    s# 94 35 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$36 rn>)
     P =  IRI_ID"...P699"  ,  O = <v cast$98 Set100 an>
    vector param casts: <V s_37_4_t1.S$33 rn>-> <v cast$98 Set100 an>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var2$29 an>, <V var1$28 rn>)$32 (35 ) $36 () 
    s# 108 38 Distinct (HASH) set no <r set_no$30 via  Set94 Set100 Set83>(<V s_37_4_t0.S$36 rn>, <r s_37_4_t1.O$32 via  Set94 Set100>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_4_t0.S$36 via  Set108>
      4: <V var2$29 an> :=  := artm <r s_37_4_t1.O$32 via  Set108 Set94 Set100>
      8: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var2$54 a>, <V var1$52 a>)$28 (38 ) $29 (38 ) $30 (38 35 31 51 ) 
    s# 118 44 Subquery Select(<V var1$28 rn>, <V var2$29 an>)
      set no: <r set_no$30 via  Set108 Set94 Set100 Set83>
    After code:
      0: <V var1$52 a> := Call __ro2sq (<V var1$28 rn>)
      5: <V var2$54 a> := Call __ro2sq (<V var2$29 an>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $62 (44 38 35 31 51 63 ) $52 (44 ) $54 (44 ) 
    s# 125 56 Select (<V var1$52 a>, <V var2$54 a>)
      set no: <r set_ctr$62 via  Set118>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 11 msec 0 reads         0% read 0 messages         0% clw
