
  { 
    time        10% fanout         1 input         1 rows
      clear: (<V set_ctr$65 in>)
    s# 68 66 cluster outer seq start, set no <V set_ctr$65 in>    
    save ctx:()
      clear: (<V var2$29 an>, <V var1$28 rn>, <V set_no$30 i>, <V var2$57 a>, <V var1$55 a>)
    s# 77 27 Subquery 27 
      multistate set no = <V set_no$30 i>
      { 
        time        90% fanout         0 input         1 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         2 Fanout:         0
          clear: (<V s_37_2_t0.P$32 rn>)
          clear on continue: (<V s_37_2_t0.P$32 rn>)
        s# 81 31 from DB.DBA.RDF_QUAD by RDF_QUAD_SP          2 rows   
        Key RDF_QUAD_SP  ASC  (<V s_37_2_t0.P$32 rn>)
         inlined  S =  IRI_ID"...direct/P21" 
        
        time         0% fanout         0 input         0 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.2 Fanout:         0
          clear: (<V s_37_2_t0.O$36 an>)
          clear on continue: (<V s_37_2_t0.O$36 an>)
        s# 91 35 from DB.DBA.RDF_QUAD by RDF_QUAD        1.2 rows   
        Key RDF_QUAD  ASC  (<V s_37_2_t0.O$36 an>)
         inlined  P = <V s_37_2_t0.P$32 rn> ,  S =  IRI_ID"...direct/P21" 
        
        time         0% fanout         0 input         0 rows
        
        s# 101 39 Distinct (HASH) set no <r set_no$30 via  Set91 Set81>(<r s_37_2_t0.P$32 via  Set91>, <V s_37_2_t0.O$36 an>)
        time         0% fanout         0 input         0 rows
          clear: (<V var2$29 an>, <V var1$28 rn>)$32 (39 35 ) $36 (39 ) 
        s# 109 53 skip node  10  <none> <r set_no$30 via  Set101 Set91 Set81>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.P$32 via  Set109 Set101 Set91>
          4: <V var2$29 an> :=  := artm <r s_37_2_t0.O$36 via  Set109 Set101>
          8: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 77 45 Subquery Select(<V var1$28 rn>, <V var2$29 an>)
          set no: <r set_no$30 via  Set109 Set101 Set91 Set81>
      }
    
    After code:
      0: <V var1$55 a> := Call __ro2sq (<V var1$28 rn>)
      5: <V var2$57 a> := Call __ro2sq (<V var2$29 an>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $65 (27 66 ) $55 (27 ) $57 (27 ) 
    s# 126 59 Select (<V var1$55 a>, <V var2$57 a>)
      set no: <r set_ctr$65 via  Set77>
  }
Warning: You might have a Cartesian product.



 0 msec 3% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
