http://www.wikidata.org/entity/Q2630956	
http://www.wikidata.org/entity/Q2634048	
http://www.wikidata.org/entity/Q2636232	
http://www.wikidata.org/entity/Q2850276	
http://www.wikidata.org/entity/Q2914038	
http://www.wikidata.org/entity/Q270832	
http://www.wikidata.org/entity/Q378110	
http://www.wikidata.org/entity/Q3898044	
http://www.wikidata.org/entity/Q3899457	
http://www.wikidata.org/entity/Q3899465	
http://www.wikidata.org/entity/Q3899486	
http://www.wikidata.org/entity/Q3900957	
http://www.wikidata.org/entity/Q3901140	
http://www.wikidata.org/entity/Q5360623	
http://www.wikidata.org/entity/Q5639659	
http://www.wikidata.org/entity/Q7082941	
http://www.wikidata.org/entity/Q7702472	
http://www.wikidata.org/entity/Q14079411	
http://www.wikidata.org/entity/Q16453446	
http://www.wikidata.org/entity/Q16611587	

  { 
    time      0.23% fanout         1 input         1 rows
      clear: (<V set_ctr$40 in>)
    s# 43 41 cluster outer seq start, set no <V set_ctr$40 in>    
    save ctx:()
    time       7.2% fanout      1000 input         1 rows
      clear: (<V s_37_4_t0.S$28 rn>)
      clear on continue: (<V s_37_4_t0.S$28 rn>)
    s# 52 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    5.7e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$28 rn>)
     P =  IRI_ID"...direct/P27"  ,  O =  IRI_ID"...Q20" 
    
    time        93% fanout      0.04 input      1000 rows
      clear: (<V var1$32 a>)
      clear on continue: (<V var1$32 a>)$28 () 
    s# 62 30 from DB.DBA.RDF_QUAD by RDF_QUAD      0.041 rows   
    Key RDF_QUAD  ASC  ()
     inlined  P =  IRI_ID"...direct/P106"  ,  S = <V s_37_4_t0.S$28 rn> ,  O =  IRI_ID"...Q937857" 
    
    After code:
      0: <V var1$32 a> := Call __id2in (<r s_37_4_t0.S$28 via  Set62>)
      5: BReturn 0
    time     0.065% fanout         0 input        40 rows
    $32 () $40 (30 27 41 ) 
    s# 71 34 Select (<V var1$32 a>)
      set no: <r set_ctr$40 via  Set62 Set52>
  }
Warning: You might have a Cartesian product.



 1 msec 47% cpu,      1013 rnd       998 seq   97.8304% same seg  0.788955% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
