1993-019A	
1982-047A	
1985-051A	
1987-044A	
2013-010A	
1964-038A	
1991-034A	
2009-070C	
1984-112A	
2014-033F	
2001-053A	
1985-063A	
2008-055A	
1997-016A	
1990-029D	
1974-105A	
1997-039A	
1966-036A	
1967-023A	
1970-033A	

  { 
    time    0.0014% fanout         1 input         1 rows
      clear: (<V set_ctr$71 in>)
    s# 74 72 cluster outer seq start, set no <V set_ctr$71 in>    
    save ctx:()
      clear: (<V var1$28 a>, <V set_no$29 i>, <V var1$63 a>)
    s# 83 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time    0.0012% fanout         1 input         1 rows
        
        s# 106 33 Fork 33 {  
                
            save ctx:()
              set no = <V set_no$29 i> array  <none>  save: 
            time     0.044% fanout       727 input         1 rows
              clear: (<V s_37_2_t0.O$31 an>)
              clear on continue: (<V s_37_2_t0.O$31 an>)
            s# 88 30 from DB.DBA.RDF_QUAD by RDF_QUAD    7.3e+02 rows Parallel, tail cost        49   
            Key RDF_QUAD  ASC  (<V s_37_2_t0.O$31 an>)
             inlined  P =  IRI_ID"...direct/P247" 
            copy on branch $29 $0 $0 $0 sets: 74 
            
            time     0.094% fanout         0 input       727 rows
            
            s# 98 34 Sort (HASH) set no <r set_no$29 via  Set88>(<V s_37_2_t0.O$31 an>)
        }
        time     1e+02% fanout       722 input         1 rows
          clear: (<V s_37_2_t0.O$31 an>, <V var1$28 a>, <V __ro2sq$54 a>)
          clear on continue: (<V s_37_2_t0.O$31 an>, <V var1$28 a>, <V __ro2sq$54 a>)
        s# 113 39 group by read node  
        (<V s_37_2_t0.O$31 an>)
        After code:
          0: <V __ro2sq$54 a> := Call __ro2sq (<V s_37_2_t0.O$31 an>)
          5: <V var1$28 a> :=  := artm <V __ro2sq$54 a>
          9: BReturn 0
        time   0.00043% fanout         0 input       722 rows
        
        s# 83 56 Subquery Select(<V var1$28 a>)
          set no: <r set_no$29 via  Set113>
      }
    
    After code:
      0: <V var1$63 a> := Call __ro2sq (<V var1$28 a>)
      5: BReturn 0
    time   0.00027% fanout         0 input       722 rows
    $63 (27 ) $71 (27 72 ) 
    s# 130 65 Select (<V var1$63 a>)
      set no: <r set_ctr$71 via  Set83>
  }


 144 msec 99% cpu,       723 rnd       726 seq         0% same seg   56.3536% same pg 
8 disk reads, 0 read ahead,   97.5302% wait
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
