http://www.openlinksw.com/virtrdf-data-formats#default-iid	http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat	
http://www.openlinksw.com/virtrdf-data-formats#default-iid-nullable	http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat	
http://www.openlinksw.com/virtrdf-data-formats#default-iid-nonblank	http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat	
http://www.openlinksw.com/virtrdf-data-formats#default-iid-nonblank-nullable	http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat	
http://www.openlinksw.com/virtrdf-data-formats#default	http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat	
http://www.openlinksw.com/virtrdf-data-formats#default-nullable	http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar	http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-nullable	http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-dt	http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-dt-nullable	http://www.openlinksw.com/schemas/virtrdf#QuadMapFormat	

  { 
    time      0.96% fanout         1 input         1 rows
      clear: (<V set_ctr$41 in>)
    s# 47 42 cluster outer seq start, set no <V set_ctr$41 in>    
    save ctx:()
    time        43% fanout      1000 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.1e+07 Fanout:     1e+03
      clear: (<V s_37_2_t0.O$28 an>, <V s_37_2_t0.S$29 rn>)
      clear on continue: (<V s_37_2_t0.O$28 an>, <V s_37_2_t0.S$29 rn>)
    s# 56 27 from DB.DBA.RDF_QUAD by RDF_QUAD    1.1e+07 rows   
    Key RDF_QUAD  ASC  (<V s_37_2_t0.S$29 rn>, <V s_37_2_t0.O$28 an>)
     inlined  P =  IRI_ID"...type" 
    
    time        56% fanout      0.01 input      1000 rows
      clear: (<V var2$33 a>, <V var1$31 a>)$28 () $29 () 
    s# 67 45 skip node  10  <none> <r set_ctr$41 via  Set56>
    After code:
      0: <V var1$31 a> := Call __id2in (<r s_37_2_t0.S$29 via  Set67>)
      5: <V var2$33 a> := Call __ro2sq (<r s_37_2_t0.O$28 via  Set67>)
      10: BReturn 0
    time       0.4% fanout         0 input        10 rows
    $31 (45 ) $33 (45 ) $41 (45 27 42 ) 
    s# 75 35 Select (<V var1$31 a>, <V var2$33 a>)
      set no: <r set_ctr$41 via  Set67 Set56>
  }
Warning: You might have a Cartesian product.



 1 msec 23% cpu,         1 rnd       998 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
