http://www.wikidata.org/entity/Q7176823	
http://www.wikidata.org/entity/Q5536162	
http://www.wikidata.org/entity/Q10520134	
http://www.wikidata.org/entity/Q78780658	
http://www.wikidata.org/entity/Q11437889	
http://www.wikidata.org/entity/Q11596484	
http://www.wikidata.org/entity/Q1235815	
http://www.wikidata.org/entity/Q3547868	
http://www.wikidata.org/entity/Q5936578	
http://www.wikidata.org/entity/Q11605987	
http://www.wikidata.org/entity/Q15857080	
http://www.wikidata.org/entity/Q3658731	
http://www.wikidata.org/entity/Q16177840	
http://www.wikidata.org/entity/Q4096460	
http://www.wikidata.org/entity/Q13560027	
http://www.wikidata.org/entity/Q18671627	
http://www.wikidata.org/entity/Q18672246	
http://www.wikidata.org/entity/Q18877545	
http://www.wikidata.org/entity/Q19366496	
http://www.wikidata.org/entity/Q4247914	

  { 
    time     0.095% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.017% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        64% fanout       102 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS      1e+02 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1710-01-01 00:00:00Z> <= <tag 211 c 1710-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1710-01-01 00:00:00Z> <= <tag 211 c 1710-12-31 23:59:59Z>
    
    time       3.7% fanout  0.990196 input       102 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        33% fanout         1 input       101 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.025% fanout         0 input       101 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 4 msec 48% cpu,       101 rnd     13012 seq         0% same seg   4.90196% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
