http://www.wikidata.org/entity/Q383413	
http://www.wikidata.org/entity/Q920286	
http://www.wikidata.org/entity/Q10326880	
http://www.wikidata.org/entity/Q1296705	
http://www.wikidata.org/entity/Q3750876	
http://www.wikidata.org/entity/Q5931105	
http://www.wikidata.org/entity/Q1448477	
http://www.wikidata.org/entity/Q13128789	
http://www.wikidata.org/entity/Q4107017	
http://www.wikidata.org/entity/Q4297156	
http://www.wikidata.org/entity/Q5921646	
http://www.wikidata.org/entity/Q677097	
http://www.wikidata.org/entity/Q19300068	
http://www.wikidata.org/entity/Q17995002	
http://www.wikidata.org/entity/Q3484633	
http://www.wikidata.org/entity/Q3499157	
http://www.wikidata.org/entity/Q327980	
http://www.wikidata.org/entity/Q2460163	
http://www.wikidata.org/entity/Q6236546	
http://www.wikidata.org/entity/Q2594530	

  { 
    time      0.16% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.026% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        78% fanout        24 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         24 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1330-01-01 00:00:00Z> <= <tag 211 c 1330-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1330-01-01 00:00:00Z> <= <tag 211 c 1330-12-31 23:59:59Z>
    
    time       5.9% fanout         1 input        24 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        16% fanout         1 input        24 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.064% fanout         0 input        24 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 2 msec 41% cpu,        25 rnd     13090 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
