http://www.wikidata.org/entity/Q2791432	
http://www.wikidata.org/entity/Q2857171	
http://www.wikidata.org/entity/Q3057527	
http://www.wikidata.org/entity/Q3062177	
http://www.wikidata.org/entity/Q3121694	
http://www.wikidata.org/entity/Q3177120	
http://www.wikidata.org/entity/Q3179664	
http://www.wikidata.org/entity/Q3179835	
http://www.wikidata.org/entity/Q3237585	
http://www.wikidata.org/entity/Q16210517	
http://www.wikidata.org/entity/Q16211237	
http://www.wikidata.org/entity/Q16211521	
http://www.wikidata.org/entity/Q16211956	
http://www.wikidata.org/entity/Q16212270	
http://www.wikidata.org/entity/Q16212476	
http://www.wikidata.org/entity/Q16298581	
http://www.wikidata.org/entity/Q16298792	
http://www.wikidata.org/entity/Q16299478	
http://www.wikidata.org/entity/Q41418087	
http://www.wikidata.org/entity/Q2643002	

  { 
    time     0.037% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time    0.0076% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        11% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.1e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1970-01-01 00:00:00Z> <= <tag 211 c 1970-01-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1970-01-01 00:00:00Z> <= <tag 211 c 1970-01-31 23:59:59Z>
    
    time       2.8% fanout         1 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        86% fanout         1 input      1000 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.012% fanout         0 input      1000 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 11 msec 85% cpu,       990 rnd      7865 seq         0% same seg   14.4299% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
