http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	
http://www.wikidata.org/entity/Q20747295	

  { 
    time      0.19% fanout         1 input         1 rows
      clear: (<V set_ctr$41 in>)
    s# 44 42 cluster outer seq start, set no <V set_ctr$41 in>    
    save ctx:()
    time       4.3% fanout      1000 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.1e+05 Fanout:     1e+03
      clear: (<V s_37_4_t1.S$28 rn>)
      clear on continue: (<V s_37_4_t1.S$28 rn>)
    s# 53 27 from DB.DBA.RDF_QUAD by RDF_QUAD    1.1e+05 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t1.S$28 rn>)
     inlined  P =  IRI_ID"...direct/P351" 
    
    time        95% fanout      0.67 input      1000 rows
      clear: (<V s_37_4_t0.O$31 an>, <V var1$33 a>)
      clear on continue: (<V s_37_4_t0.O$31 an>, <V var1$33 a>)$28 () 
    s# 63 30 from DB.DBA.RDF_QUAD by RDF_QUAD        1.4 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t0.O$31 an>)
     inlined  P =  IRI_ID"...direct/P279"  ,  S = <V s_37_4_t1.S$28 rn>
    
    After code:
      0: <V var1$33 a> := Call __ro2sq (<V s_37_4_t0.O$31 an>)
      5: BReturn 0
    time     0.066% fanout         0 input       670 rows
    $33 () $41 (30 27 42 ) 
    s# 73 35 Select (<V var1$33 a>)
      set no: <r set_ctr$41 via  Set63 Set53>
  }
Warning: You might have a Cartesian product.



 2 msec 56% cpu,      1001 rnd       999 seq   99.6008% same seg 0.0998004% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
