http://www.wikidata.org/entity/Q23926590	http://www.wikidata.org/entity/Q45	
http://www.wikidata.org/entity/Q23926590	http://www.wikidata.org/entity/Q7372078	
http://www.wikidata.org/entity/Q9652749	http://www.wikidata.org/entity/Q36	
http://www.wikidata.org/entity/Q9652749	http://www.wikidata.org/entity/Q7372078	
http://www.wikidata.org/entity/Q8683579	http://www.wikidata.org/entity/Q19360703	
http://www.wikidata.org/entity/Q8683579	http://www.wikidata.org/entity/Q7372078	
http://www.wikidata.org/entity/Q8683610	http://www.wikidata.org/entity/Q39	
http://www.wikidata.org/entity/Q8683610	http://www.wikidata.org/entity/Q7372078	
http://www.wikidata.org/entity/Q8683619	http://www.wikidata.org/entity/Q30	
http://www.wikidata.org/entity/Q8683619	http://www.wikidata.org/entity/Q7372078	
http://www.wikidata.org/entity/Q8683621	http://www.wikidata.org/entity/Q19686	
http://www.wikidata.org/entity/Q8683621	http://www.wikidata.org/entity/Q7372078	

  { 
    time    0.0041% fanout         1 input         1 rows
      clear: (<V set_ctr$43 in>)
    s# 46 44 cluster outer seq start, set no <V set_ctr$43 in>    
    save ctx:()
    time      0.06% fanout         6 input         1 rows
      clear: (<V s_37_4_t0.S$28 rn>)
      clear on continue: (<V s_37_4_t0.S$28 rn>)
    s# 55 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS          6 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$28 rn>)
     P =  IRI_ID"...direct/P971"  ,  O =  IRI_ID"...Q7372078" 
    
    time     1e+02% fanout         2 input         6 rows
    Precode:
      0: <V var1$30 a> := Call __id2in (<V s_37_4_t0.S$28 rn>)
      5: BReturn 0
      clear: (<V s_37_4_t1.O$33 an>, <V var1$30 a>, <V var2$35 a>)
      clear on continue: (<V var2$35 a>, <V s_37_4_t1.O$33 an>)$28 () 
    s# 65 32 from DB.DBA.RDF_QUAD by RDF_QUAD        1.6 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t1.O$33 an>)
     inlined  P =  IRI_ID"...direct/P971"  ,  S = <V s_37_4_t0.S$28 rn>
    
    After code:
      0: <V var2$35 a> := Call __ro2sq (<V s_37_4_t1.O$33 an>)
      5: BReturn 0
    time    0.0015% fanout         0 input        12 rows
    $35 () $43 (32 27 44 ) $30 (32 ) 
    s# 75 37 Select (<r var1$30 via  Set65>, <V var2$35 a>)
      set no: <r set_ctr$43 via  Set65 Set55>
  }
Warning: You might have a Cartesian product.



 83 msec 97% cpu,        15 rnd        11 seq     18.75% same seg        25% same pg 
5 disk reads, 0 read ahead,   97.0446% wait
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
