
  { 
    time        57% fanout         1 input         1 rows
      clear: (<V set_ctr$58 in>)
    s# 61 59 cluster outer seq start, set no <V set_ctr$58 in>    
    save ctx:()
    time        14% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 70 49 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        28% fanout         0 input         1 rows
    
    s# 79 30 END Node
    After test:
      0: BReturn 0
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_4_t0.S$32 rn>)
      clear on continue: (<V s_37_4_t0.S$32 rn>)
    s# 86 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$32 rn>)
     P =  IRI_ID"...direct/P580"  ,  O >= <tag 211 c -009-01-01 00:00:00Z> <= <tag 211 c 0001-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c -009-01-01 00:00:00Z> <= <tag 211 c 0001-12-31 23:59:59Z>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   6.5e-05 Fanout:         0
    
    s# 96 34 from DB.DBA.RDF_QUAD by RDF_QUAD    6.5e-05 rows   
    Key RDF_QUAD  ASC  ()
     P =  IRI_ID"...direct/P582"  ,  S = <V s_37_4_t0.S$32 rn> ,  O >= <tag 211 c 0001-01-01 00:00:00Z> <= <tag 211 c 0011-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 0001-01-01 00:00:00Z> <= <tag 211 c 0011-12-31 23:59:59Z>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var1$28 rn>)$32 (34 ) 
    s# 105 36 Distinct (HASH) set no <r set_no$29 via  Set96 Set86 Set79>(<r s_37_4_t0.S$32 via  Set96>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_4_t0.S$32 via  Set105 Set96>
      4: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var1$50 a>)$28 (36 ) $29 (36 34 31 30 49 ) 
    s# 114 42 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set105 Set96 Set86 Set79>
    After code:
      0: <V var1$50 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $50 (42 ) $58 (42 36 34 31 30 49 59 ) 
    s# 121 52 Select (<V var1$50 a>)
      set no: <r set_ctr$58 via  Set114>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         0 rnd         0 seq         0% same seg         0% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
