
  { 
    time       6.1% fanout         1 input         1 rows
      clear: (<V set_ctr$60 in>)
    s# 63 61 cluster outer seq start, set no <V set_ctr$60 in>    
    save ctx:()
    time        94% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
      clear: (<V s_37_5_t1.S$28 rn>)
      clear on continue: (<V s_37_5_t1.S$28 rn>)
    s# 72 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        0.3 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_5_t1.S$28 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q868" 
    
    time         0% fanout         0 input         0 rows
    Precode:
      0: <V var1$30 a> := Call __id2in (<V s_37_5_t1.S$28 rn>)
      5: BReturn 0
      clear: (<V set_ctr$45 i>, <V var1$30 a>)$28 () 
    s# 82 49 cluster outer seq start, set no <V set_ctr$45 i>    
    save ctx:()
      clear: (<V __dummy_retval$33 x>, <V set_no$34 i>)
    s# 91 32 Subquery 32 
      multistate set no = <V set_no$34 i>
      { 
        time         0% fanout         0 input         0 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   5.2e+03 Fanout:         0
          clear: (<V __dummy_retval$33 x>)
          clear on continue: (<V __dummy_retval$33 x>)
        s# 95 35 from DB.DBA.RDF_QUAD by RDF_QUAD    5.2e+03 rows   
        Key RDF_QUAD  ASC  ()
         inlined  P =  IRI_ID"...direct/P802" 
        
        After code:
          0: <V __dummy_retval$33 x> :=  := artm <DB_NULL>
          4: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 91 37 Subquery Select(<V __dummy_retval$33 x>)
          set no: <r set_no$34 via  Set95>
      }
    
    time         0% fanout         0 input         0 rows
    $33 (32 ) $34 (32 ) $45 (32 49 ) 
    s# 112 44 end of outer seq <r set_ctr$45 via  Set91>
     out: (<V set_no$34 i>, <V __dummy_retval$33 x>)
     shadow: ( <none> ,  <none> )
    time         0% fanout         0 input         0 rows
    $60 (44 32 49 27 61 ) $30 (44 32 49 ) 
    s# 120 54 Select (<r var1$30 via  Set112>)
      set no: <r set_ctr$60 via  Set112 Set72>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 0 msec 4% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
