Error: 23000: SR197: Non unique primary key on DB.DBA.RDF_OBJ.
  { 
    time     1e+02% fanout         1 input         1 rows
      clear: (<V set_ctr$35 in>)
    s# 58 36 cluster outer seq start, set no <V set_ctr$35 in>    
    save ctx:()
    time         0% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
    Precode:
      0: DB.DBA.RDF_OBJ_OF_SQLVAL$27  := Call DB.DBA.RDF_OBJ_OF_SQLVAL (<c 50-00-0>)
      7: BReturn 0
      clear: (<V t1.S$30 rn>)
      clear on continue: (<V t1.S$30 rn>)
    s# 67 29 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        0.3 rows   
    Key RDF_QUAD_POGS  ASC  (<V t1.S$30 rn>)
     P =  IRI_ID"...direct/P231"  ,  O = DB.DBA.RDF_OBJ_OF_SQLVAL$27 
    
    time         0% fanout         0 input         0 rows
      clear: (<V set_ctr$38 i>)
    s# 77 42 cluster outer seq start, set no <V set_ctr$38 i>    
    save ctx:()
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         1 Fanout:         0
      clear: (<V t3.O$33 a>)
      clear on continue: (<V t3.O$33 a>)$90 (32 ) 
    s# 86 32 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V t3.O$33 a>)
     inlined  P =  IRI_ID"...direct/P662"  ,  S = <v k_t1.S$90 Set92 rn>
    vector param casts: <r t1.S$30 via  Set77>-> <v k_t1.S$90 Set92 rn>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var2$49 a>, <V var1$47 a>)$33 () $38 (32 42 ) $30 (32 42 ) 
    s# 100 37 end of outer seq <r set_ctr$38 via  Set86 Set92>
     out: (<V t3.O$33 a>)
     shadow: ( <none> )
    After code:
      0: <V var1$47 a> := Call __id2in (<r t1.S$30 via  Set100>)
      5: <V var2$49 a> := Call __ro2sq (<V t3.O$33 a>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $35 (37 32 42 29 36 ) $47 (37 ) $49 (37 ) 
    s# 108 51 Select (<V var1$47 a>, <V var2$49 a>)
      set no: <r set_ctr$35 via  Set100 Set67>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 1 msec 13% cpu,         3 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
