
  { 
    time       9.9% fanout         1 input         1 rows
      clear: (<V set_ctr$47 in>)
    s# 50 48 cluster outer seq start, set no <V set_ctr$47 in>    
    save ctx:()
    time        90% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   4.1e-08 Fanout:         0
      clear: (<V s_37_6_t2.O$28 an>, <V s_37_6_t2.S$29 rn>)
      clear on continue: (<V s_37_6_t2.O$28 an>, <V s_37_6_t2.S$29 rn>)
    s# 59 27 from DB.DBA.RDF_QUAD by RDF_QUAD    4.1e-08 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t2.S$29 rn>, <V s_37_6_t2.O$28 an>)
     inlined  P =  IRI_ID"...qualifier/P580" 
    row specs:  O >= <tag 211 c 2013-01-01 00:00:00Z>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t1.S$32 rn>)
      clear on continue: (<V s_37_6_t1.S$32 rn>)$29 () 
    s# 70 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t1.S$32 rn>)
     inlined  P =  IRI_ID"...statement/P39"  ,  O =  IRI_ID"...Q18229570"  ,  S = <V s_37_6_t2.S$29 rn>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t0.S$35 rn>, <V var1$39 a>, <V var2$37 a>)
      clear on continue: (<V s_37_6_t0.S$35 rn>, <V var1$39 a>, <V var2$37 a>)$32 () $84 (34 ) $28 (31 ) 
    s# 80 34 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t0.S$35 rn>)
     P =  IRI_ID"...prop/P39"  ,  O = <v cast$84 Set86 an>
    vector param casts: <V s_37_6_t1.S$32 rn>-> <v cast$84 Set86 an>
    
    After code:
      0: <V var2$37 a> := Call __ro2sq (<r s_37_6_t2.O$28 via  Set80 Set86 Set70>)
      5: <V var1$39 a> := Call __id2in (<V s_37_6_t0.S$35 rn>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $37 () $39 () $47 (34 31 27 48 ) 
    s# 94 41 Select (<V var1$39 a>, <V var2$37 a>)
      set no: <r set_ctr$47 via  Set80 Set86 Set70 Set59>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 43 msec 0 reads         0% read 0 messages         0% clw
