
  { 
    time        11% fanout         1 input         1 rows
      clear: (<V set_ctr$44 in>)
    s# 47 45 cluster outer seq start, set no <V set_ctr$44 in>    
    save ctx:()
    time        89% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t2.S$28 rn>)
      clear on continue: (<V s_37_6_t2.S$28 rn>)
    s# 56 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t2.S$28 rn>)
     inlined  P =  IRI_ID"...qualifier/P1352" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t0.S$31 rn>, <V s_37_6_t0.O$32 an>)
      clear on continue: (<V s_37_6_t0.S$31 rn>, <V s_37_6_t0.O$32 an>)$70 (30 ) $28 () 
    s# 66 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t0.O$32 an>, <V s_37_6_t0.S$31 rn>)
     P =  IRI_ID"...P1344"  ,  O = <v cast$70 Set72 an>
    vector param casts: <V s_37_6_t2.S$28 rn>-> <v cast$70 Set72 an>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V var1$36 a>)
      clear on continue: (<V var1$36 a>)$31 () $32 () $85 (34 ) 
    s# 81 34 from DB.DBA.RDF_QUAD by RDF_QUAD    1.4e-07 rows   
    Key RDF_QUAD  ASC  ()
     inlined  P =  IRI_ID"...statement/P1344"  ,  S = <v k_s_37_6_t0.O$85 Set87 rn>
    vector param casts: <V s_37_6_t0.O$32 an>-> <v k_s_37_6_t0.O$85 Set87 rn>
    
    After code:
      0: <V var1$36 a> := Call __id2in (<r s_37_6_t0.S$31 via  Set81 Set87>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $36 () $44 (34 30 27 45 ) 
    s# 94 38 Select (<V var1$36 a>)
      set no: <r set_ctr$44 via  Set81 Set87 Set66 Set72 Set56>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 231 msec 0 reads         0% read 0 messages         0% clw
