http://www.wikidata.org/entity/Q2978156	
http://www.wikidata.org/entity/Q41617064	
http://www.wikidata.org/entity/Q5536248	
http://www.wikidata.org/entity/Q10324587	
http://www.wikidata.org/entity/Q11437899	
http://www.wikidata.org/entity/Q5552392	
http://www.wikidata.org/entity/Q3768902	
http://www.wikidata.org/entity/Q1689173	
http://www.wikidata.org/entity/Q3271732	
http://www.wikidata.org/entity/Q6529509	
http://www.wikidata.org/entity/Q18593549	
http://www.wikidata.org/entity/Q18652486	
http://www.wikidata.org/entity/Q47490804	
http://www.wikidata.org/entity/Q19717152	
http://www.wikidata.org/entity/Q3159976	
http://www.wikidata.org/entity/Q21415766	
http://www.wikidata.org/entity/Q22038947	
http://www.wikidata.org/entity/Q29169755	
http://www.wikidata.org/entity/Q1279152	
http://www.wikidata.org/entity/Q86002	

  { 
    time      0.11% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.021% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        80% fanout        63 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         63 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1677-01-01 00:00:00Z> <= <tag 211 c 1677-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1677-01-01 00:00:00Z> <= <tag 211 c 1677-12-31 23:59:59Z>
    
    time       4.1% fanout  0.952381 input        63 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        16% fanout         1 input        60 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.025% fanout         0 input        60 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 3 msec 66% cpu,        22 rnd     13012 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
