
  { 
    time       9.7% fanout         1 input         1 rows
      clear: (<V set_ctr$58 in>)
    s# 61 59 cluster outer seq start, set no <V set_ctr$58 in>    
    save ctx:()
    time       2.6% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 70 49 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        88% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_4_t1.O$31 an>, <V s_37_4_t1.S$32 rn>)
      clear on continue: (<V s_37_4_t1.O$31 an>, <V s_37_4_t1.S$32 rn>)
    s# 79 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t1.S$32 rn>, <V s_37_4_t1.O$31 an>)
     inlined  P =  IRI_ID"...qualifier/P580" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
    $32 () $94 (34 ) 
    s# 90 34 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  ()
     inlined  P =  IRI_ID"...prop/P26"  ,  O = <v cast$94 Set96 an> ,  S =  IRI_ID"...Q22686" 
    vector param casts: <V s_37_4_t1.S$32 rn>-> <v cast$94 Set96 an>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var1$28 an>)$31 (34 ) 
    s# 103 36 Distinct (HASH) set no <r set_no$29 via  Set90 Set96 Set79>(<r s_37_4_t1.O$31 via  Set90 Set96>)
    After code:
      0: <V var1$28 an> :=  := artm <r s_37_4_t1.O$31 via  Set103 Set90 Set96>
      4: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var1$50 a>)$28 (36 ) $29 (36 34 30 49 ) 
    s# 112 42 Subquery Select(<V var1$28 an>)
      set no: <r set_no$29 via  Set103 Set90 Set96 Set79>
    After code:
      0: <V var1$50 a> := Call __ro2sq (<V var1$28 an>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $50 (42 ) $58 (42 36 34 30 49 59 ) 
    s# 119 52 Select (<V var1$50 a>)
      set no: <r set_ctr$58 via  Set112>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 9 msec 0 reads         0% read 0 messages         0% clw
