
  { 
    time         4% fanout         1 input         1 rows
      clear: (<V set_ctr$61 in>)
    s# 64 62 cluster outer seq start, set no <V set_ctr$61 in>    
    save ctx:()
    time       1.1% fanout         1 input         1 rows
      clear: (<V set_no$30 i>)
    s# 73 50 cluster outer seq start, set no <V set_no$30 i>    
    save ctx:()
    time        60% fanout         4 input         1 rows
      clear: (<V s_37_4_t0.S$32 rn>)
      clear on continue: (<V s_37_4_t0.S$32 rn>)
    s# 82 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS          4 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$32 rn>)
     P =  IRI_ID"...direct/P361"  ,  O =  IRI_ID"...Q2867205" 
    
    time        35% fanout         0 input         4 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.1 Fanout:         0
      clear: (<V s_37_4_t1.O$35 an>)
      clear on continue: (<V s_37_4_t1.O$35 an>)
    s# 92 34 from DB.DBA.RDF_QUAD by RDF_QUAD        1.1 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t1.O$35 an>)
     inlined  P =  IRI_ID"...direct/P625"  ,  S = <V s_37_4_t0.S$32 rn>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var2$29 an>, <V var1$28 rn>)$32 (34 ) $35 () 
    s# 102 37 Distinct (HASH) set no <r set_no$30 via  Set92 Set82>(<r s_37_4_t0.S$32 via  Set92>, <V s_37_4_t1.O$35 an>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_4_t0.S$32 via  Set102 Set92>
      4: <V var2$29 an> :=  := artm <r s_37_4_t1.O$35 via  Set102>
      8: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var2$53 a>, <V var1$51 a>)$28 (37 ) $29 (37 ) $30 (37 34 31 50 ) 
    s# 112 43 Subquery Select(<V var1$28 rn>, <V var2$29 an>)
      set no: <r set_no$30 via  Set102 Set92 Set82>
    After code:
      0: <V var1$51 a> := Call __ro2sq (<V var1$28 rn>)
      5: <V var2$53 a> := Call __ro2sq (<V var2$29 an>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $51 (43 ) $53 (43 ) $61 (43 37 34 31 50 62 ) 
    s# 119 55 Select (<V var1$51 a>, <V var2$53 a>)
      set no: <r set_ctr$61 via  Set112>
  }
Warning: You might have a Cartesian product.



 1 msec 5% cpu,         5 rnd         3 seq        50% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
