
  { 
    time       8.4% fanout         1 input         1 rows
      clear: (<V set_ctr$48 in>)
    s# 51 49 cluster outer seq start, set no <V set_ctr$48 in>    
    save ctx:()
    time        92% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
      clear: (<V s_37_6_t2.O$28 an>)
      clear on continue: (<V s_37_6_t2.O$28 an>)
    s# 60 27 from DB.DBA.RDF_QUAD by RDF_QUAD        0.3 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t2.O$28 an>)
     inlined  P =  IRI_ID"...direct/P571"  ,  S =  IRI_ID"...Q11696" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:        19 Fanout:         0
    Precode:
      0: <V var3$30 a> := Call __ro2sq (<V s_37_6_t2.O$28 an>)
      5: BReturn 0
      clear: (<V s_37_6_t0.S$33 rn>, <V var3$30 a>)
      clear on continue: (<V s_37_6_t0.S$33 rn>)$28 () 
    s# 70 32 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         19 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t0.S$33 rn>)
     P =  IRI_ID"...direct/P39"  ,  O =  IRI_ID"...Q11696" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         1 Fanout:         0
    Precode:
      0: <V var1$35 a> := Call __id2in (<V s_37_6_t0.S$33 rn>)
      5: BReturn 0
      clear: (<V s_37_6_t1.O$38 an>, <V var1$35 a>, <V var2$40 a>)
      clear on continue: (<V var2$40 a>, <V s_37_6_t1.O$38 an>)$33 () 
    s# 80 37 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t1.O$38 an>)
     inlined  P =  IRI_ID"...direct/P571"  ,  S = <V s_37_6_t0.S$33 rn>
    
    After code:
      0: <V var2$40 a> := Call __ro2sq (<V s_37_6_t1.O$38 an>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $35 (37 ) $40 () $48 (37 32 27 49 ) $30 (37 32 ) 
    s# 90 42 Select (<r var1$35 via  Set80>, <V var2$40 a>, <r var3$30 via  Set80 Set70>)
      set no: <r set_ctr$48 via  Set80 Set70 Set60>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 0 msec 2% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
