
  { 
    time       9.8% fanout         1 input         1 rows
      clear: (<V set_ctr$47 in>)
    s# 50 48 cluster outer seq start, set no <V set_ctr$47 in>    
    save ctx:()
    time        90% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t1.O$28 an>, <V s_37_6_t1.S$29 rn>)
      clear on continue: (<V s_37_6_t1.O$28 an>, <V s_37_6_t1.S$29 rn>)
    s# 59 27 from DB.DBA.RDF_QUAD by RDF_QUAD    1.4e-07 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t1.S$29 rn>, <V s_37_6_t1.O$28 an>)
     inlined  P =  IRI_ID"...direct/345" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:     0.091 Fanout:         0
      clear: (<V s_37_6_t0.S$32 rn>)
      clear on continue: (<V s_37_6_t0.S$32 rn>)$29 () 
    s# 70 31 from DB.DBA.RDF_QUAD by RDF_QUAD      0.091 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t0.S$32 rn>)
     inlined  P =  IRI_ID"...direct/P31"  ,  S = <V s_37_6_t1.S$29 rn> ,  O =  IRI_ID"...Q5" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       2.1 Fanout:         0
    Precode:
      0: <V var1$34 a> := Call __ro2sq (<r s_37_6_t1.O$28 via  Set70>)
      5: BReturn 0
      clear: (<V s_37_6_t2.O$37 an>, <V var1$34 a>, <V var2$39 a>)
      clear on continue: (<V var2$39 a>, <V s_37_6_t2.O$37 an>)$32 () $28 (31 ) 
    s# 80 36 from DB.DBA.RDF_QUAD by RDF_QUAD        2.1 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t2.O$37 an>)
     inlined  P =  IRI_ID"...direct/P166"  ,  S = <V s_37_6_t0.S$32 rn>
    
    After code:
      0: <V var2$39 a> := Call __ro2sq (<V s_37_6_t2.O$37 an>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $34 (36 ) $39 () $47 (36 31 27 48 ) 
    s# 90 41 Select (<r var1$34 via  Set80>, <V var2$39 a>)
      set no: <r set_ctr$47 via  Set80 Set70 Set59>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 71 msec 0 reads         0% read 0 messages         0% clw
