http://www.w3.org/1999/02/22-rdf-syntax-ns#type	http://wikiba.se/ontology#Item	
http://www.w3.org/1999/02/22-rdf-syntax-ns#type	http://wikiba.se/ontology#Item	
http://www.w3.org/2000/01/rdf-schema#label	Corc Vaşinqton	
http://www.w3.org/2000/01/rdf-schema#label	Corc Vaşinqton	
http://www.w3.org/2000/01/rdf-schema#label	Džordžs Vašingtons	
http://www.w3.org/2000/01/rdf-schema#label	Džordžs Vašingtons	
http://www.w3.org/2000/01/rdf-schema#label	Džuordžos Vašėngtuons	
http://www.w3.org/2000/01/rdf-schema#label	Džuordžos Vašėngtuons	
http://www.w3.org/2000/01/rdf-schema#label	George Washington	
http://www.w3.org/2000/01/rdf-schema#label	George Washington	

  { 
    time     0.012% fanout         1 input         1 rows
      clear: (<V set_ctr$45 in>)
    s# 51 46 cluster outer seq start, set no <V set_ctr$45 in>    
    save ctx:()
    time      0.17% fanout       250 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:        20 Fanout:   2.5e+02
      clear: (<V s_37_2_t0.P$28 rn>)
      clear on continue: (<V s_37_2_t0.P$28 rn>)
    s# 60 27 from DB.DBA.RDF_QUAD by RDF_QUAD_SP         20 rows   
    Key RDF_QUAD_SP  ASC  (<V s_37_2_t0.P$28 rn>)
     inlined  S =  IRI_ID"...Q23" 
    
    time        98% fanout         4 input       250 rows
      clear: (<V s_37_2_t0.O$32 an>)
      clear on continue: (<V s_37_2_t0.O$32 an>)
    s# 70 31 from DB.DBA.RDF_QUAD by RDF_QUAD        1.2 rows   
    Key RDF_QUAD  ASC  (<V s_37_2_t0.O$32 an>)
     inlined  P = <V s_37_2_t0.P$28 rn> ,  S =  IRI_ID"...Q23" 
    
    time       1.5% fanout      0.01 input      1000 rows
      clear: (<V var2$37 a>, <V var1$35 a>)$32 () $28 (31 ) 
    s# 80 49 skip node  10  <none> <r set_ctr$45 via  Set70 Set60>
    After code:
      0: <V var1$35 a> := Call __id2in (<r s_37_2_t0.P$28 via  Set80 Set70>)
      5: <V var2$37 a> := Call __ro2sq (<r s_37_2_t0.O$32 via  Set80>)
      10: BReturn 0
    time    0.0034% fanout         0 input        10 rows
    $35 (49 ) $37 (49 ) $45 (49 31 27 46 ) 
    s# 88 39 Select (<V var1$35 a>, <V var2$37 a>)
      set no: <r set_ctr$45 via  Set80 Set70 Set60>
  }
Warning: You might have a Cartesian product.



 18 msec 41% cpu,        13 rnd      1244 seq         0% same seg   14.2857% same pg 
1 disk reads, 0 read ahead,   40.3177% wait
Compilation: 25 msec 1 reads   55.4441% read 0 messages         0% clw
