
  { 
    time    0.0025% fanout         1 input         1 rows
      clear: (<V set_ctr$60 in>)
    s# 63 61 cluster outer seq start, set no <V set_ctr$60 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$52 a>)
    s# 72 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        28% fanout        65 input         1 rows
          clear: (<V s_37_4_t0.O$31 an>, <V s_37_4_t0.S$32 rn>)
          clear on continue: (<V s_37_4_t0.O$31 an>, <V s_37_4_t0.S$32 rn>)
        s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD         65 rows   
        Key RDF_QUAD  ASC  (<V s_37_4_t0.S$32 rn>, <V s_37_4_t0.O$31 an>)
         inlined  P =  IRI_ID"...direct/P2778" 
        
        time        72% fanout         0 input        65 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:      0.01 Fanout:         0
        $31 () $91 (34 ) 
        s# 87 34 from DB.DBA.RDF_QUAD by RDF_QUAD       0.01 rows   
        Key RDF_QUAD  ASC  ()
         inlined  P =  IRI_ID"...direct/P3604"  ,  S = <V s_37_4_t0.S$32 rn> ,  O = <v cast$91 Set93 an>
        vector param casts: <V s_37_4_t0.O$31 an>-> <v cast$91 Set93 an>
        
        time         0% fanout         0 input         0 rows
        
        s# 100 36 Distinct (HASH) set no <r set_no$29 via  Set87 Set93 Set76>(<r s_37_4_t0.S$32 via  Set87 Set93>)
        time         0% fanout         0 input         0 rows
          clear: (<V var1$28 rn>)$32 (36 34 ) 
        s# 108 50 skip node  10  <none> <r set_no$29 via  Set100 Set87 Set93 Set76>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_4_t0.S$32 via  Set108 Set100 Set87 Set93>
          4: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 72 42 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set108 Set100 Set87 Set93 Set76>
      }
    
    After code:
      0: <V var1$52 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $52 (27 ) $60 (27 61 ) 
    s# 124 54 Select (<V var1$52 a>)
      set no: <r set_ctr$60 via  Set72>
  }
Warning: You might have a Cartesian product.



 91 msec 98% cpu,        66 rnd        64 seq   95.5224% same seg         0% same pg 
6 disk reads, 0 read ahead,   70.1644% wait
Compilation: 0 msec 0 reads         0% read 0 messages         0% clw
