http://www.wikidata.org/entity/Q15906007	
http://www.wikidata.org/entity/Q59109	
http://www.wikidata.org/entity/Q6432715	
http://www.wikidata.org/entity/Q958281	
http://www.wikidata.org/entity/Q11227409	
http://www.wikidata.org/entity/Q11625275	
http://www.wikidata.org/entity/Q28316761	
http://www.wikidata.org/entity/Q39072725	
http://www.wikidata.org/entity/Q23761811	
http://www.wikidata.org/entity/Q45319919	

  { 
    time      0.96% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$49 a>)
    s# 69 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        23% fanout      1000 input         1 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   5.2e+05 Fanout:     1e+03
          clear: (<V s_37_2_t0.S$31 rn>)
          clear on continue: (<V s_37_2_t0.S$31 rn>)
        s# 73 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    5.2e+05 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
         inlined  P =  IRI_ID"...direct/P21" 
        
        time        74% fanout     0.999 input      1000 rows
        
        s# 83 33 Distinct (HASH) set no <r set_no$29 via  Set73>(<V s_37_2_t0.S$31 rn>)
        time       1.5% fanout   0.01001 input       999 rows
          clear: (<V var1$28 rn>)$31 (33 ) 
        s# 91 47 skip node  10  <none> <r set_no$29 via  Set83 Set73>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set91 Set83>
          4: BReturn 0
        time      0.31% fanout         0 input        10 rows
        
        s# 69 39 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set91 Set83 Set73>
      }
    
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.24% fanout         0 input        10 rows
    $49 (27 ) $57 (27 58 ) 
    s# 107 51 Select (<V var1$49 a>)
      set no: <r set_ctr$57 via  Set69>
  }
Warning: You might have a Cartesian product.



 0 msec 29% cpu,        11 rnd       998 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
