http://www.wikidata.org/entity/Q2618395	
http://www.wikidata.org/entity/Q2618543	
http://www.wikidata.org/entity/Q2631292	
http://www.wikidata.org/entity/Q2707892	
http://www.wikidata.org/entity/Q2784123	
http://www.wikidata.org/entity/Q2860658	
http://www.wikidata.org/entity/Q3203214	
http://www.wikidata.org/entity/Q2911404	
http://www.wikidata.org/entity/Q2982202	
http://www.wikidata.org/entity/Q3233215	
http://www.wikidata.org/entity/Q3234796	
http://www.wikidata.org/entity/Q3237583	
http://www.wikidata.org/entity/Q16008770	
http://www.wikidata.org/entity/Q16013785	
http://www.wikidata.org/entity/Q16088099	
http://www.wikidata.org/entity/Q32796256	
http://www.wikidata.org/entity/Q183100	
http://www.wikidata.org/entity/Q265493	
http://www.wikidata.org/entity/Q501204	
http://www.wikidata.org/entity/Q1094212	

  { 
    time     0.054% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time    0.0098% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time       1.1% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    2.6e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q860861" 
    
    time         4% fanout         1 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        95% fanout         1 input      1000 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.015% fanout         0 input      1000 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 7 msec 82% cpu,       930 rnd       998 seq         0% same seg   58.1096% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
