http://www.wikidata.org/entity/Q1044	7557212	
http://www.wikidata.org/entity/Q1044	7557212	
http://www.wikidata.org/entity/Q1044	7557212	
http://www.wikidata.org/entity/Q1044	7557212	
http://www.wikidata.org/entity/Q1049	40533330	
http://www.wikidata.org/entity/Q1049	40533330	

  { 
    time       1.3% fanout         1 input         1 rows
      clear: (<V set_ctr$35 in>)
    s# 59 36 cluster outer seq start, set no <V set_ctr$35 in>    
    save ctx:()
    time        18% fanout        36 input         1 rows
      clear: (<V t1.S$28 rn>)
      clear on continue: (<V t1.S$28 rn>)
    s# 68 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         36 rows   
    Key RDF_QUAD_POGS  ASC  (<V t1.S$28 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q6256" 
    
    time        51% fanout         1 input        36 rows
    Precode:
      0: <V var1$30 a> := Call __id2in (<V t1.S$28 rn>)
      5: BReturn 0
      clear: (<V set_ctr$38 i>, <V var1$30 a>)
    s# 78 42 cluster outer seq start, set no <V set_ctr$38 i>    
    save ctx:()
    time        27% fanout   2.11111 input        36 rows
      clear: (<V t3.O$33 a>)
      clear on continue: (<V t3.O$33 a>)$28 (42 ) $91 (32 ) 
    s# 87 32 from DB.DBA.RDF_QUAD by RDF_QUAD        1.1 rows   
    Key RDF_QUAD  ASC  (<V t3.O$33 a>)
     inlined  P =  IRI_ID"...direct/P1082"  ,  S = <v k_t1.S$91 Set93 rn>
    vector param casts: <r t1.S$28 via  Set78>-> <v k_t1.S$91 Set93 rn>
    
    time      0.88% fanout         1 input        76 rows
    $38 (32 42 ) 
    s# 101 37 end of outer seq <r set_ctr$38 via  Set87 Set93>
     out: (<V t3.O$33 a>)
     shadow: ( <none> )
    time       1.9% fanout 0.0789474 input        76 rows
      clear: (<V var2$47 a>)$33 (37 ) 
    s# 109 57 skip node  6  <none> <r set_ctr$35 via  Set101 Set68>
    After code:
      0: <V var2$47 a> := Call __ro2sq (<r t3.O$33 via  Set109>)
      5: BReturn 0
    time      0.41% fanout         0 input         6 rows
    $35 (57 37 32 42 27 36 ) $47 (57 ) $30 (57 37 32 42 ) 
    s# 117 49 Select (<r var1$30 via  Set109 Set101>, <V var2$47 a>)
      set no: <r set_ctr$35 via  Set109 Set101 Set68>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 0 msec 0% cpu,        37 rnd        75 seq   89.4737% same seg   2.63158% same pg 
Compilation: 139 msec 0 reads         0% read 0 messages         0% clw
