
  { 
    time        10% fanout         1 input         1 rows
      clear: (<V set_ctr$44 in>)
    s# 50 45 cluster outer seq start, set no <V set_ctr$44 in>    
    save ctx:()
    time        90% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t2.O$28 an>, <V s_37_6_t2.S$29 rn>)
      clear on continue: (<V s_37_6_t2.O$28 an>, <V s_37_6_t2.S$29 rn>)
    s# 59 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t2.S$29 rn>, <V s_37_6_t2.O$28 an>)
     inlined  P =  IRI_ID"...qualifier/P580" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t1.S$32 rn>)
      clear on continue: (<V s_37_6_t1.S$32 rn>)$29 () 
    s# 70 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t1.S$32 rn>)
     inlined  P =  IRI_ID"...qualifier/P2937"  ,  O =  IRI_ID"...Q15081430"  ,  S = <V s_37_6_t2.S$29 rn>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
    $32 () $84 (34 ) 
    s# 80 34 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  ()
     P =  IRI_ID"...prop/P39"  ,  O = <v cast$84 Set86 an>
    vector param casts: <V s_37_6_t1.S$32 rn>-> <v cast$84 Set86 an>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var1$36 a>)$28 (34 31 ) 
    s# 93 48 skip node  10  <none> <r set_ctr$44 via  Set80 Set86 Set70 Set59>
    After code:
      0: <V var1$36 a> := Call __ro2sq (<r s_37_6_t2.O$28 via  Set93 Set80 Set86 Set70>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $36 (48 ) $44 (48 34 31 27 45 ) 
    s# 101 38 Select (<V var1$36 a>)
      set no: <r set_ctr$44 via  Set93 Set80 Set86 Set70 Set59>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 10 msec 0 reads         0% read 0 messages         0% clw
