
  { 
    time       2.4% fanout         1 input         1 rows
      clear: (<V set_ctr$61 in>)
    s# 64 62 cluster outer seq start, set no <V set_ctr$61 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$53 a>)
    s# 73 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        46% fanout        97 input         1 rows
          clear: (<V s_37_4_t1.O$31 an>, <V s_37_4_t1.S$32 rn>)
          clear on continue: (<V s_37_4_t1.O$31 an>, <V s_37_4_t1.S$32 rn>)
        s# 77 30 from DB.DBA.RDF_QUAD by RDF_QUAD         97 rows   
        Key RDF_QUAD  ASC  (<V s_37_4_t1.S$32 rn>, <V s_37_4_t1.O$31 an>)
         inlined  P =  IRI_ID"...direct/P3604" 
        
        time        52% fanout         0 input        97 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:      0.16 Fanout:         0
          clear: (<V s_37_4_t0.S$35 rn>)
          clear on continue: (<V s_37_4_t0.S$35 rn>)$31 () $32 () $92 (34 ) 
        s# 88 34 from DB.DBA.RDF_QUAD by RDF_QUAD       0.16 rows   
        Key RDF_QUAD  ASC  (<V s_37_4_t0.S$35 rn>)
         inlined  P =  IRI_ID"...direct/P2852"  ,  S = <V s_37_4_t1.S$32 rn> ,  O = <v cast$92 Set94 an>
        vector param casts: <V s_37_4_t1.O$31 an>-> <v cast$92 Set94 an>
        
        time         0% fanout         0 input         0 rows
        
        s# 102 37 Distinct (HASH) set no <r set_no$29 via  Set88 Set94 Set77>(<V s_37_4_t0.S$35 rn>)
        time         0% fanout         0 input         0 rows
          clear: (<V var1$28 rn>)$35 (37 ) 
        s# 110 51 skip node  10  <none> <r set_no$29 via  Set102 Set88 Set94 Set77>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_4_t0.S$35 via  Set110 Set102>
          4: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 73 43 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set110 Set102 Set88 Set94 Set77>
      }
    
    After code:
      0: <V var1$53 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $53 (27 ) $61 (27 62 ) 
    s# 126 55 Select (<V var1$53 a>)
      set no: <r set_ctr$61 via  Set73>
  }
Warning: You might have a Cartesian product.



 0 msec 8% cpu,        98 rnd        96 seq   96.9697% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
