http://www.wikidata.org/entity/Q3116347	
http://www.wikidata.org/entity/Q3120468	
http://www.wikidata.org/entity/Q19894580	
http://www.wikidata.org/entity/Q2331774	
http://www.wikidata.org/entity/Q473490	
http://www.wikidata.org/entity/Q5170	
http://www.wikidata.org/entity/Q3566086	
http://www.wikidata.org/entity/Q10919650	
http://www.wikidata.org/entity/Q5161268	
http://www.wikidata.org/entity/Q28954935	
http://www.wikidata.org/entity/Q5505326	
http://www.wikidata.org/entity/Q732097	
http://www.wikidata.org/entity/Q11547371	
http://www.wikidata.org/entity/Q331755	
http://www.wikidata.org/entity/Q11497900	
http://www.wikidata.org/entity/Q11450102	
http://www.wikidata.org/entity/Q2874923	

  { 
    time      0.17% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.035% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        81% fanout        19 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         19 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P570"  ,  O >= <tag 211 c 1202-01-01 00:00:00Z> <= <tag 211 c 1202-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1202-01-01 00:00:00Z> <= <tag 211 c 1202-12-31 23:59:59Z>
    
    time       5.4% fanout  0.894737 input        19 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        13% fanout         1 input        17 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.035% fanout         0 input        17 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 2 msec 39% cpu,        17 rnd     10759 seq         0% same seg         0% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
