529446	

  { 
    time    0.0055% fanout         1 input         1 rows
      clear: (<V set_ctr$74 in>)
    s# 77 75 cluster outer seq start, set no <V set_ctr$74 in>    
    save ctx:()
      clear: (<V var2$28 in>, <V set_no$29 i>, <V var2$66 a>)
    s# 86 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time    0.0032% fanout         1 input         1 rows
        
        s# 110 35 Fork 35 {  
                
            save ctx:()
              set no = <V set_no$29 i> array  <none>  save: 
            time        57% fanout    529446 input         1 rows
              clear: (<V s_37_2_t0.S$31 rn>, <V $37 x>, <V isnotnull$33 in>)
              clear on continue: (<V s_37_2_t0.S$31 rn>, <V $37 x>, <V isnotnull$33 in>)
            s# 91 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    5.3e+05 rows Parallel, tail cost   7.8e+04   
            Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
             P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q5" 
            copy on branch $29 $0 $0 $0 sets: 77 
            
            After code:
              0: <V isnotnull$33 in> := Call isnotnull (<V s_37_2_t0.S$31 rn>)
              5: <V $37 x> :=  := artm <DB_NULL>
              9: BReturn 0
            time        43% fanout         0 input    529446 rows
            $33 () $37 () 
            s# 102 36 Sort (HASH) set no <r set_no$29 via  Set91>(<V $37 x>) -> (<V isnotnull$33 in>) up to         1 distinct
            
        }
        time      0.08% fanout         1 input         1 rows
          clear: (<V aggregate$38 in>, <V $37 x>, <V var2$28 in>)
          clear on continue: (<V aggregate$38 in>, <V $37 x>, <V var2$28 in>)
        s# 117 44 group by read node  
        (<V $37 x>, <V aggregate$38 in>)
        After code:
          0: <V var2$28 in> :=  := artm <V aggregate$38 in>
          4: BReturn 0
        time    0.0019% fanout         0 input         1 rows
        
        s# 86 59 Subquery Select(<V var2$28 in>)
          set no: <r set_no$29 via  Set117>
      }
    
    After code:
      0: <V var2$66 a> := Call __ro2sq (<V var2$28 in>)
      5: BReturn 0
    time   0.00079% fanout         0 input         1 rows
    $66 (27 ) $74 (27 75 ) 
    s# 135 68 Select (<V var2$66 a>)
      set no: <r set_ctr$74 via  Set86>
  }


 31 msec 125% cpu,         1 rnd    528888 seq         0% same seg         0% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
