http://www.wikidata.org/entity/Q42		http://wikiba.se/ontology#Item	
http://www.wikidata.org/entity/Q42		http://wikiba.se/ontology#Item	
http://www.wikidata.org/entity/Q42		Adams Duglas	
http://www.wikidata.org/entity/Q42		Adams Duglas	
http://www.wikidata.org/entity/Q42		Daglas Adams	
http://www.wikidata.org/entity/Q42		Daglas Adams	
http://www.wikidata.org/entity/Q42		Doglas Adams	
http://www.wikidata.org/entity/Q42		Doglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	
http://www.wikidata.org/entity/Q42		Douglas Adams	

  { 
    time    0.0045% fanout         1 input         1 rows
      clear: (<V set_ctr$43 in>)
    s# 46 44 cluster outer seq start, set no <V set_ctr$43 in>    
    save ctx:()
    time        28% fanout       254 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:        20 Fanout:   2.5e+02
      clear: (<V s_37_3_t0.P$28 rn>)
      clear on continue: (<V s_37_3_t0.P$28 rn>)
    s# 55 27 from DB.DBA.RDF_QUAD by RDF_QUAD_SP         20 rows   
    Key RDF_QUAD_SP  ASC  (<V s_37_3_t0.P$28 rn>)
     inlined  S =  IRI_ID"...Q42" 
    
    time        72% fanout   3.93701 input       254 rows
      clear: (<V s_37_3_t0.O$32 an>, <V var3$35 a>)
      clear on continue: (<V s_37_3_t0.O$32 an>, <V var3$35 a>)$28 () 
    s# 65 31 from DB.DBA.RDF_QUAD by RDF_QUAD        1.2 rows   
    Key RDF_QUAD  ASC  (<V s_37_3_t0.O$32 an>)
     inlined  P = <V s_37_3_t0.P$28 rn> ,  S =  IRI_ID"...Q42" 
    
    After code:
      0: <V var3$35 a> := Call __ro2sq (<V s_37_3_t0.O$32 an>)
      5: BReturn 0
    time   0.00096% fanout         0 input      1000 rows
    $35 () $43 (31 27 44 ) 
    s# 75 37 Select (<tag 182 flag 1 c http://www.wikidata.org/entity/Q42>, <DB_NULL>, <V var3$35 a>)
      set no: <r set_ctr$43 via  Set65 Set55>
  }
Warning: You might have a Cartesian product.



 76 msec 98% cpu,       999 rnd      1242 seq         0% same seg      14.2% same pg 
6 disk reads, 0 read ahead,   94.2283% wait
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
