
  { 
    time       6.9% fanout         1 input         1 rows
      clear: (<V set_ctr$46 in>)
    s# 52 47 cluster outer seq start, set no <V set_ctr$46 in>    
    save ctx:()
    time        93% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
    
    s# 61 27 from DB.DBA.RDF_QUAD by RDF_QUAD        0.3 rows   
    Key RDF_QUAD  ASC  ()
     inlined  P =  IRI_ID"...direct/P625"  ,  S =  IRI_ID"...Q64" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   3.1e+03 Fanout:         0
      clear: (<V s_37_6_t2.S$30 rn>)
      clear on continue: (<V s_37_6_t2.S$30 rn>)
    s# 70 29 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    3.1e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t2.S$30 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q1248784" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.1 Fanout:         0
      clear: (<V s_37_6_t1.O$33 an>, <V s_37_6_t1.S$34 rn>)
      clear on continue: (<V s_37_6_t1.O$33 an>, <V s_37_6_t1.S$34 rn>)$30 () 
    s# 80 32 from DB.DBA.RDF_QUAD by RDF_QUAD        1.1 rows   max 1
    Key RDF_QUAD  ASC  (<V s_37_6_t1.S$34 rn>, <V s_37_6_t1.O$33 an>)
     inlined  P =  IRI_ID"...direct/P625"  ,  S = <V s_37_6_t2.S$30 rn>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var2$38 a>, <V var1$36 a>)$33 () $34 () 
    s# 91 50 skip node  1  <none> <r set_ctr$46 via  Set80 Set70 Set61>
    After code:
      0: <V var1$36 a> := Call __id2in (<r s_37_6_t1.S$34 via  Set91>)
      5: <V var2$38 a> := Call __ro2sq (<r s_37_6_t1.O$33 via  Set91>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $36 (50 ) $38 (50 ) $46 (50 32 29 27 47 ) 
    s# 99 40 Select (<V var1$36 a>, <DB_NULL>, <V var2$38 a>)
      set no: <r set_ctr$46 via  Set91 Set80 Set70 Set61>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 0 msec 2% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
