http://www.wikidata.org/entity/Q19055497	http://www.wikidata.org/prop/direct/P50	
https://www.wikidata.org/wiki/Special:EntityData/Q23	http://schema.org/about	
https://www.wikidata.org/wiki/Special:EntityData/Q23	http://schema.org/about	
http://www.wikidata.org/entity/Q2612823	http://www.wikidata.org/prop/direct/P1891	
http://www.wikidata.org/entity/P1309	http://www.wikidata.org/prop/direct/P1855	
http://www.wikidata.org/entity/P39	http://www.wikidata.org/prop/direct/P1855	
http://www.wikidata.org/entity/P735	http://www.wikidata.org/prop/direct/P1855	
http://www.wikidata.org/entity/Q20177022	http://www.wikidata.org/prop/direct/P180	
http://www.wikidata.org/entity/Q46991451	http://www.wikidata.org/prop/direct/P180	
http://www.wikidata.org/entity/Q19924503	http://www.wikidata.org/prop/direct/P180	

  { 
    time      0.45% fanout         1 input         1 rows
      clear: (<V set_ctr$45 in>)
    s# 51 46 cluster outer seq start, set no <V set_ctr$45 in>    
    save ctx:()
    time       4.8% fanout        12 input         1 rows
      clear: (<V s_37_2_t0.P$28 rn>)
      clear on continue: (<V s_37_2_t0.P$28 rn>)
    s# 60 27 from DB.DBA.RDF_QUAD by RDF_QUAD_OP         12 rows   
    Key RDF_QUAD_OP  ASC  (<V s_37_2_t0.P$28 rn>)
     inlined  O =  IRI_ID"...Q23" 
    
    time        52% fanout   3.41667 input        12 rows
      clear: (<V s_37_2_t0.S$32 rn>)
      clear on continue: (<V s_37_2_t0.S$32 rn>)
    s# 70 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        1.2 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$32 rn>)
     P = <V s_37_2_t0.P$28 rn> ,  O =  IRI_ID"...Q23" 
    
    time        43% fanout  0.243902 input        41 rows
      clear: (<V var2$37 a>, <V var1$35 a>)$32 () $28 (31 ) 
    s# 80 49 skip node  10  <none> <r set_ctr$45 via  Set70 Set60>
    After code:
      0: <V var1$35 a> := Call __id2in (<r s_37_2_t0.S$32 via  Set80>)
      5: <V var2$37 a> := Call __id2in (<r s_37_2_t0.P$28 via  Set80 Set70>)
      10: BReturn 0
    time      0.13% fanout         0 input        10 rows
    $35 (49 ) $37 (49 ) $45 (49 31 27 46 ) 
    s# 88 39 Select (<V var1$35 a>, <V var2$37 a>)
      set no: <r set_ctr$45 via  Set80 Set70 Set60>
  }
Warning: You might have a Cartesian product.



 1 msec 38% cpu,        24 rnd        40 seq         4% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
