http://www.wikidata.org/entity/Q11711296	
http://www.wikidata.org/entity/Q24278795	
http://www.wikidata.org/entity/Q4454212	
http://www.wikidata.org/entity/Q1389203	
http://www.wikidata.org/entity/Q16006525	
http://www.wikidata.org/entity/Q7167598	
http://www.wikidata.org/entity/Q1372521	
http://www.wikidata.org/entity/Q5512338	
http://www.wikidata.org/entity/Q364062	
http://www.wikidata.org/entity/Q19875434	
http://www.wikidata.org/entity/Q3932608	
http://www.wikidata.org/entity/Q29865129	
http://www.wikidata.org/entity/Q21154031	
http://www.wikidata.org/entity/Q1560606	
http://www.wikidata.org/entity/Q250020	
http://www.wikidata.org/entity/Q12027461	
http://www.wikidata.org/entity/Q4879037	
http://www.wikidata.org/entity/Q16006646	
http://www.wikidata.org/entity/Q29564375	
http://www.wikidata.org/entity/Q445091	

  { 
    time    0.0016% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time   0.00023% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time      0.44% fanout        87 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         87 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P570"  ,  O >= <tag 211 c 1969-10-01 00:00:00Z> <= <tag 211 c 1969-10-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1969-10-01 00:00:00Z> <= <tag 211 c 1969-10-31 23:59:59Z>
    
    time      0.06% fanout  0.977012 input        87 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        99% fanout         1 input        85 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time   0.00059% fanout         0 input        85 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 113 msec 49% cpu,        84 rnd     10769 seq         0% same seg   3.52941% same pg 
Compilation: 115 msec 1 reads   10.0133% read 0 messages         0% clw
