http://www.wikidata.org/entity/Q18781	
http://www.wikidata.org/entity/Q3966440	
http://www.wikidata.org/entity/Q7382249	

  { 
    time      0.18% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
    time     0.039% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 69 48 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        80% fanout        20 input         1 rows
      clear: (<V s_37_4_t0.S$31 rn>)
      clear on continue: (<V s_37_4_t0.S$31 rn>)
    s# 78 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         20 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$31 rn>)
     P =  IRI_ID"...direct/P580"  ,  O >= <tag 211 c 1760-01-01 00:00:00Z> <= <tag 211 c 1770-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1760-01-01 00:00:00Z> <= <tag 211 c 1770-12-31 23:59:59Z>
    
    time       7.9% fanout       0.3 input        20 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:    0.0014 Fanout:       0.3
    
    s# 88 33 from DB.DBA.RDF_QUAD by RDF_QUAD     0.0014 rows   
    Key RDF_QUAD  ASC  ()
     P =  IRI_ID"...direct/P582"  ,  S = <V s_37_4_t0.S$31 rn> ,  O >= <tag 211 c 1770-01-01 00:00:00Z> <= <tag 211 c 1780-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1770-01-01 00:00:00Z> <= <tag 211 c 1780-12-31 23:59:59Z>
    
    time       5.8% fanout       0.5 input         6 rows
      clear: (<V var1$28 rn>)$31 (33 ) 
    s# 97 35 Distinct (HASH) set no <r set_no$29 via  Set88 Set78>(<r s_37_4_t0.S$31 via  Set88>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_4_t0.S$31 via  Set97 Set88>
      4: BReturn 0
    time       5.7% fanout         1 input         3 rows
      clear: (<V var1$49 a>)$28 (35 ) $29 (35 33 30 48 ) 
    s# 106 41 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set97 Set88 Set78>
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.04% fanout         0 input         3 rows
    $49 (41 ) $57 (41 35 33 30 48 58 ) 
    s# 113 51 Select (<V var1$49 a>)
      set no: <r set_ctr$57 via  Set106>
  }
Warning: You might have a Cartesian product.



 3 msec 35% cpu,        22 rnd      7975 seq   65.2174% same seg   17.3913% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
