
  { 
    time       4.1% fanout         1 input         1 rows
      clear: (<V set_ctr$60 in>)
    s# 63 61 cluster outer seq start, set no <V set_ctr$60 in>    
    save ctx:()
      clear: (<V var1$28 an>, <V set_no$29 i>, <V var1$52 a>)
    s# 72 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        59% fanout         4 input         1 rows
          clear: (<V s_37_3_t0.O$31 an>)
          clear on continue: (<V s_37_3_t0.O$31 an>)
        s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD          4 rows   
        Key RDF_QUAD  ASC  (<V s_37_3_t0.O$31 an>)
         inlined  P =  IRI_ID"...direct/P39"  ,  S =  IRI_ID"...Q57379" 
        
        time        37% fanout         0 input         4 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         1 Fanout:         0
          clear: (<V s_37_7_t1.O$34 an>)
          clear on continue: (<V s_37_7_t1.O$34 an>)$31 () $90 (33 ) 
        s# 86 33 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
        Key RDF_QUAD  ASC  (<V s_37_7_t1.O$34 an>)
         inlined  P =  IRI_ID"...direct/P580"  ,  S = <v cast$90 Set92 rn>
        vector param casts: <V s_37_3_t0.O$31 an>-> <v cast$90 Set92 rn>
        
        time         0% fanout         0 input         0 rows
        
        s# 100 36 Distinct (HASH) set no <r set_no$29 via  Set86 Set92 Set76>(<V s_37_7_t1.O$34 an>)
        time         0% fanout         0 input         0 rows
          clear: (<V var1$28 an>)$34 (36 ) 
        s# 108 50 skip node  10  <none> <r set_no$29 via  Set100 Set86 Set92 Set76>
        After code:
          0: <V var1$28 an> :=  := artm <r s_37_7_t1.O$34 via  Set108 Set100>
          4: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 72 42 Subquery Select(<V var1$28 an>)
          set no: <r set_no$29 via  Set108 Set100 Set86 Set92 Set76>
      }
    
    After code:
      0: <V var1$52 a> := Call __ro2sq (<V var1$28 an>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $52 (27 ) $60 (27 61 ) 
    s# 124 54 Select (<V var1$52 a>)
      set no: <r set_ctr$60 via  Set72>
  }
Warning: You might have a Cartesian product.



 0 msec 5% cpu,         5 rnd         3 seq        50% same seg         0% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
