Miguel Reale	Brazil	1910-11-06 00:00:00Z	
Miguel Reale	Brazil	1910-11-06 00:00:00Z	
Zhang Junmai	Republic of China (1912–1949)	1886-01-01 00:00:00Z	
Carl Stumpf	Germany	1848-04-21 00:00:00Z	
Carl Stumpf	Germany	1848-04-21 00:00:00Z	
Edmund Husserl	German Empire	1859-04-08 00:00:00Z	
Jakob Bidermann	Germany	1578-01-01 00:00:00Z	
Jakob Bidermann	Germany	1578-01-01 00:00:00Z	
Helene Stöcker	German Empire	1869-11-13 00:00:00Z	
Helene Stöcker	Germany	1869-11-13 00:00:00Z	

  { 
    time    0.0059% fanout         1 input         1 rows
      clear: (<V set_ctr$56 in>)
    s# 62 57 cluster outer seq start, set no <V set_ctr$56 in>    
    save ctx:()
    time      0.14% fanout      1000 input         1 rows
      clear: (<V s_37_10_t0.S$28 rn>)
      clear on continue: (<V s_37_10_t0.S$28 rn>)
    s# 71 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    2.4e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_10_t0.S$28 rn>)
     P =  IRI_ID"...direct/P106"  ,  O =  IRI_ID"...Q4964182" 
    
    time       1.8% fanout     0.974 input      1000 rows
      clear: (<V s_37_10_t2.S$31 rn>, <V s_37_10_t2.O$32 an>)
      clear on continue: (<V s_37_10_t2.S$31 rn>, <V s_37_10_t2.O$32 an>)
    s# 81 30 from DB.DBA.RDF_QUAD by RDF_QUAD        1.1 rows   
    Key RDF_QUAD  ASC  (<V s_37_10_t2.O$32 an>, <V s_37_10_t2.S$31 rn>)
     inlined  P =  IRI_ID"...direct/P27"  ,  S = <V s_37_10_t0.S$28 rn>
    
    time       1.3% fanout  0.311088 input       974 rows
      clear: (<V s_37_10_t3.O$35 an>)
      clear on continue: (<V s_37_10_t3.O$35 an>)$32 () $96 (34 ) 
    s# 92 34 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V s_37_10_t3.O$35 an>)
     inlined  P =  IRI_ID"...direct/P373"  ,  S = <v k_s_37_10_t2.O$96 Set98 rn>
    vector param casts: <V s_37_10_t2.O$32 an>-> <v k_s_37_10_t2.O$96 Set98 rn>
    
    time       1.8% fanout  0.333333 input       303 rows
    Precode:
      0: <V var2$37 a> := Call __ro2sq (<V s_37_10_t3.O$35 an>)
      5: BReturn 0
      clear: (<V s_37_10_t1.O$40 an>, <V s_37_10_t1.S$41 rn>, <V var2$37 a>)
      clear on continue: (<V s_37_10_t1.S$41 rn>, <V s_37_10_t1.O$40 an>)$35 () $110 (39 ) 
    s# 106 39 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V s_37_10_t1.S$41 rn>, <V s_37_10_t1.O$40 an>)
     inlined  P =  IRI_ID"...direct/P373"  ,  S = <v k_s_37_10_t0.S$110 Set112 rn>
    vector param casts: <r s_37_10_t0.S$28 via  Set92 Set98 Set81>-> <v k_s_37_10_t0.S$110 Set112 rn>
    
    time        95% fanout   1.06931 input       101 rows
    Precode:
      0: <V var1$43 a> := Call __ro2sq (<V s_37_10_t1.O$40 an>)
      5: BReturn 0
      clear: (<V s_37_10_t4.O$46 an>, <V var1$43 a>)
      clear on continue: (<V s_37_10_t4.O$46 an>)$125 (45 ) $40 () $28 (39 34 30 ) 
    s# 121 45 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V s_37_10_t4.O$46 an>)
     inlined  P =  IRI_ID"...direct/P569"  ,  S = <v k_s_37_10_t0.S$125 Set127 rn>
    vector param casts: <r s_37_10_t0.S$28 via  Set106 Set112 Set92 Set98 Set81>-> <v k_s_37_10_t0.S$125 Set127 rn>
    
    time    0.0055% fanout 0.0925926 input       108 rows
      clear: (<V var3$48 a>)$46 () 
    s# 135 60 skip node  10  <none> <r set_ctr$56 via  Set121 Set127 Set106 Set112 Set92 Set98 Set81 Set71>
    After code:
      0: <V var3$48 a> := Call __ro2sq (<r s_37_10_t4.O$46 via  Set135>)
      5: BReturn 0
    time    0.0003% fanout         0 input        10 rows
    $37 (60 45 39 ) $43 (60 45 ) $48 (60 ) $56 (60 45 39 34 30 27 57 ) 
    s# 143 50 Select (<r var1$43 via  Set135 Set121 Set127>, <r var2$37 via  Set135 Set121 Set127 Set106 Set112>, <V var3$48 a>)
      set no: <r set_ctr$56 via  Set135 Set121 Set127 Set106 Set112 Set92 Set98 Set81 Set71>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 68 msec 94% cpu,      2782 rnd      1302 seq   83.8663% same seg   1.47323% same pg 
5 disk reads, 0 read ahead,   88.9217% wait
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
