http://www.wikidata.org/entity/Q2849417	
http://www.wikidata.org/entity/Q2851274	
http://www.wikidata.org/entity/Q2912337	
http://www.wikidata.org/entity/Q3067906	
http://www.wikidata.org/entity/Q3123935	
http://www.wikidata.org/entity/Q3228903	
http://www.wikidata.org/entity/Q15909289	
http://www.wikidata.org/entity/Q16008079	
http://www.wikidata.org/entity/Q16013276	
http://www.wikidata.org/entity/Q16194916	
http://www.wikidata.org/entity/Q16298355	
http://www.wikidata.org/entity/Q16299334	
http://www.wikidata.org/entity/Q16300062	
http://www.wikidata.org/entity/Q188141	
http://www.wikidata.org/entity/Q383327	
http://www.wikidata.org/entity/Q1098363	
http://www.wikidata.org/entity/Q3416180	
http://www.wikidata.org/entity/Q5354256	
http://www.wikidata.org/entity/Q5354410	
http://www.wikidata.org/entity/Q5525795	

  { 
    time     0.055% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.015% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        17% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS      4e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1947-01-01 00:00:00Z> <= <tag 211 c 1947-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1947-01-01 00:00:00Z> <= <tag 211 c 1947-12-31 23:59:59Z>
    
    time         5% fanout         1 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        78% fanout         1 input      1000 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.012% fanout         0 input      1000 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 5 msec 78% cpu,       280 rnd      6098 seq         0% same seg   8.54093% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
