http://www.wikidata.org/entity/Q2636792	
http://www.wikidata.org/entity/Q2636804	
http://www.wikidata.org/entity/Q2783847	
http://www.wikidata.org/entity/Q2798613	
http://www.wikidata.org/entity/Q3063198	
http://www.wikidata.org/entity/Q3171667	
http://www.wikidata.org/entity/Q3176291	
http://www.wikidata.org/entity/Q15695220	
http://www.wikidata.org/entity/Q15902250	
http://www.wikidata.org/entity/Q15903076	
http://www.wikidata.org/entity/Q16009512	
http://www.wikidata.org/entity/Q16105301	
http://www.wikidata.org/entity/Q16105381	
http://www.wikidata.org/entity/Q16105404	
http://www.wikidata.org/entity/Q16105437	
http://www.wikidata.org/entity/Q16105444	
http://www.wikidata.org/entity/Q16105451	
http://www.wikidata.org/entity/Q16105457	
http://www.wikidata.org/entity/Q16105468	
http://www.wikidata.org/entity/Q16298358	

  { 
    time     0.063% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.018% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        15% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    3.1e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1940-01-01 00:00:00Z> <= <tag 211 c 1940-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1940-01-01 00:00:00Z> <= <tag 211 c 1940-12-31 23:59:59Z>
    
    time       5.5% fanout     0.999 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        79% fanout         1 input       999 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.02% fanout         0 input       999 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 4 msec 77% cpu,       145 rnd      5177 seq         0% same seg   4.79452% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
