
  { 
    time        11% fanout         1 input         1 rows
      clear: (<V set_ctr$49 in>)
    s# 52 50 cluster outer seq start, set no <V set_ctr$49 in>    
    save ctx:()
    time        89% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t2.O$28 an>, <V s_37_6_t2.S$29 rn>)
      clear on continue: (<V s_37_6_t2.O$28 an>, <V s_37_6_t2.S$29 rn>)
    s# 61 27 from DB.DBA.RDF_QUAD by RDF_QUAD    1.4e-07 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t2.S$29 rn>, <V s_37_6_t2.O$28 an>)
     inlined  P =  IRI_ID"...P569" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:     0.091 Fanout:         0
      clear: (<V s_37_6_t0.S$32 rn>)
      clear on continue: (<V s_37_6_t0.S$32 rn>)$29 () 
    s# 72 31 from DB.DBA.RDF_QUAD by RDF_QUAD      0.091 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t0.S$32 rn>)
     inlined  P =  IRI_ID"...direct/P31"  ,  S = <V s_37_6_t2.S$29 rn> ,  O =  IRI_ID"...Q5" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.1 Fanout:         0
    Precode:
      0: <V var4$34 a> := Call __ro2sq (<r s_37_6_t2.O$28 via  Set72>)
      5: <V var1$36 a> := Call __id2in (<V s_37_6_t0.S$32 rn>)
      10: BReturn 0
      clear: (<V s_37_6_t1.O$39 an>, <V var1$36 a>, <V var4$34 a>, <V var3$41 a>)
      clear on continue: (<V var3$41 a>, <V s_37_6_t1.O$39 an>)$32 () $28 (31 ) 
    s# 82 38 from DB.DBA.RDF_QUAD by RDF_QUAD        1.1 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t1.O$39 an>)
     inlined  P =  IRI_ID"...direct/P2611"  ,  S = <V s_37_6_t0.S$32 rn>
    
    After code:
      0: <V var3$41 a> := Call __ro2sq (<V s_37_6_t1.O$39 an>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $34 (38 ) $36 (38 ) $41 () $49 (38 31 27 50 ) 
    s# 92 43 Select (<r var1$36 via  Set82>, <DB_NULL>, <DB_NULL>, <V var3$41 a>, <r var4$34 via  Set82>)
      set no: <r set_ctr$49 via  Set82 Set72 Set61>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 148 msec 0 reads         0% read 0 messages         0% clw
