http://www.wikidata.org/entity/Q2786838	
http://www.wikidata.org/entity/Q3123798	
http://www.wikidata.org/entity/Q3174067	
http://www.wikidata.org/entity/Q3180844	
http://www.wikidata.org/entity/Q15914812	
http://www.wikidata.org/entity/Q16013686	
http://www.wikidata.org/entity/Q16014906	
http://www.wikidata.org/entity/Q16093681	
http://www.wikidata.org/entity/Q16197687	
http://www.wikidata.org/entity/Q16200142	
http://www.wikidata.org/entity/Q5349321	
http://www.wikidata.org/entity/Q5363521	
http://www.wikidata.org/entity/Q6247769	
http://www.wikidata.org/entity/Q7106355	
http://www.wikidata.org/entity/Q7109660	
http://www.wikidata.org/entity/Q7364507	
http://www.wikidata.org/entity/Q7517431	
http://www.wikidata.org/entity/Q7599866	
http://www.wikidata.org/entity/Q7704681	
http://www.wikidata.org/entity/Q12049417	

  { 
    time      0.04% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.008% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time       9.9% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    2.3e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1914-01-01 00:00:00Z> <= <tag 211 c 1914-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1914-01-01 00:00:00Z> <= <tag 211 c 1914-12-31 23:59:59Z>
    
    time       3.2% fanout     0.988 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        87% fanout         1 input       988 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.012% fanout         0 input       988 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 9 msec 71% cpu,       839 rnd      6183 seq         0% same seg        15% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
