
  { 
    time       9.5% fanout         1 input         1 rows
      clear: (<V set_ctr$49 in>)
    s# 52 50 cluster outer seq start, set no <V set_ctr$49 in>    
    save ctx:()
    time        91% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
    Precode:
      0: <V __rdflit$27 x> := Call __rdflit (rdflit32005)
      5: BReturn 0
      clear: (<V s_37_6_t2.S$30 rn>, <V __rdflit$27 x>)
      clear on continue: (<V s_37_6_t2.S$30 rn>)
    s# 61 29 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t2.S$30 rn>)
     P =  IRI_ID"...isPartOf"  ,  O =  IRI_ID"..." 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t1.S$33 rn>)
      clear on continue: (<V s_37_6_t1.S$33 rn>)$30 () 
    s# 71 32 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t1.S$33 rn>)
     inlined  P =  IRI_ID"...inLanguage"  ,  O = rdflit32005 ,  S = <V s_37_6_t2.S$30 rn>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         1 Fanout:         0
      clear: (<V s_37_6_t0.S$36 rn>, <V s_37_6_t0.O$37 an>, <V var2$41 a>, <V var1$39 a>)
      clear on continue: (<V s_37_6_t0.S$36 rn>, <V s_37_6_t0.O$37 an>, <V var2$41 a>, <V var1$39 a>)$33 () 
    s# 81 35 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t0.O$37 an>, <V s_37_6_t0.S$36 rn>)
     inlined  P =  IRI_ID"...about"  ,  S = <V s_37_6_t1.S$33 rn>
    
    After code:
      0: <V var1$39 a> := Call __ro2sq (<V s_37_6_t0.O$37 an>)
      5: <V var2$41 a> := Call __id2in (<V s_37_6_t0.S$36 rn>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $39 () $41 () $49 (35 32 29 50 ) 
    s# 92 43 Select (<V var1$39 a>, <V var2$41 a>)
      set no: <r set_ctr$49 via  Set81 Set71 Set61>
  }
Warning: You might have a Cartesian product.



 0 msec 1% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
