http://www.wikidata.org/entity/Q2919746	
http://www.wikidata.org/entity/Q15814056	
http://www.wikidata.org/entity/Q16004053	
http://www.wikidata.org/entity/Q16009543	
http://www.wikidata.org/entity/Q16012496	
http://www.wikidata.org/entity/Q16081187	
http://www.wikidata.org/entity/Q32362563	
http://www.wikidata.org/entity/Q41585143	
http://www.wikidata.org/entity/Q1527252	
http://www.wikidata.org/entity/Q3398505	
http://www.wikidata.org/entity/Q5460709	
http://www.wikidata.org/entity/Q6738107	
http://www.wikidata.org/entity/Q6962426	
http://www.wikidata.org/entity/Q7153971	
http://www.wikidata.org/entity/Q7503736	
http://www.wikidata.org/entity/Q9140480	
http://www.wikidata.org/entity/Q9364263	
http://www.wikidata.org/entity/Q15433578	
http://www.wikidata.org/entity/Q16351007	
http://www.wikidata.org/entity/Q16373465	

  { 
    time     0.075% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.016% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        17% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.9e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1908-01-01 00:00:00Z> <= <tag 211 c 1908-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1908-01-01 00:00:00Z> <= <tag 211 c 1908-12-31 23:59:59Z>
    
    time       6.3% fanout     0.993 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        77% fanout         1 input       993 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.02% fanout         0 input       993 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 5 msec 74% cpu,        44 rnd      4715 seq         0% same seg   4.44444% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
