
  { 
    time       5.9% fanout         1 input         1 rows
      clear: (<V set_ctr$49 in>)
    s# 55 50 cluster outer seq start, set no <V set_ctr$49 in>    
    save ctx:()
    time        94% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
    Precode:
      0: <V DB.DBA.RDF_MAKE_LONG_OF_SQLVAL$27 a> := Call DB.DBA.RDF_MAKE_LONG_OF_SQLVAL (<c string1>)
      7: BReturn 0
      clear: (<V s_37_2_t0.S$30 rn>, <V s_37_2_t0.O$31 an>, <V DB.DBA.RDF_MAKE_LONG_OF_SQLVAL$27 a>)
      clear on continue: (<V s_37_2_t0.O$31 an>, <V s_37_2_t0.S$30 rn>)
    s# 64 29 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.O$31 an>, <V s_37_2_t0.S$30 rn>)
     inlined  P =  IRI_ID"...reference/P854" 
    
    time         0% fanout         0 input         0 rows
      clear: (<V rdf_contains_impl$37 i>, <V DB.DBA.RDF_LONG_OF_SQLVAL$35 a>, <V __rdf_strsqlval$33 s>)$27 (29 ) 
    s# 80 75 END Node
    After test:
      0: <V __rdf_strsqlval$33 s> := Call __rdf_strsqlval (<V s_37_2_t0.O$31 an>,  0 )
      5: <V DB.DBA.RDF_LONG_OF_SQLVAL$35 a> := Call DB.DBA.RDF_LONG_OF_SQLVAL (<V __rdf_strsqlval$33 s>)
      12: <V rdf_contains_impl$37 i> := Call rdf_contains_impl (<V DB.DBA.RDF_LONG_OF_SQLVAL$35 a>, <r DB.DBA.RDF_MAKE_LONG_OF_SQLVAL$27 via  Set64>)
      17: if ( 0  = <V rdf_contains_impl$37 i>) then 22 else 21 unkn 22
      21: BReturn 1
      22: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var2$41 a>, <V var1$39 a>)$31 (75 ) $30 (75 ) 
    s# 88 53 skip node  200  <none> <r set_ctr$49 via  Set80 Set64>
    After code:
      0: <V var1$39 a> := Call __id2in (<r s_37_2_t0.S$30 via  Set88 Set80>)
      5: <V var2$41 a> := Call __ro2sq (<r s_37_2_t0.O$31 via  Set88 Set80>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $39 (53 ) $41 (53 ) $49 (53 75 29 50 ) 
    s# 96 43 Select (<V var1$39 a>, <V var2$41 a>)
      set no: <r set_ctr$49 via  Set88 Set80 Set64>
  }
Warning: You might have a Cartesian product.



 0 msec 1% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 4 msec 0 reads         0% read 0 messages         0% clw
