
  { 
    time       7.6% fanout         1 input         1 rows
      clear: (<V set_ctr$59 in>)
    s# 62 60 cluster outer seq start, set no <V set_ctr$59 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$51 a>)
    s# 71 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        92% fanout         0 input         1 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
          clear: (<V s_37_4_t0.S$31 rn>)
          clear on continue: (<V s_37_4_t0.S$31 rn>)
        s# 75 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        0.3 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$31 rn>)
         P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q864380" 
        
        time         0% fanout         0 input         0 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   9.1e-07 Fanout:         0
        $89 (33 ) 
        s# 85 33 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    9.1e-07 rows   
        Key RDF_QUAD_POGS  ASC  ()
         inlined  P =  IRI_ID"...direct/P373"  ,  O = <v cast$89 Set91 an> ,  S =  IRI_ID"...Q864380" 
        vector param casts: <V s_37_4_t0.S$31 rn>-> <v cast$89 Set91 an>
        
        time         0% fanout         0 input         0 rows
        
        s# 98 35 Distinct (HASH) set no <r set_no$29 via  Set85 Set91 Set75>(<r s_37_4_t0.S$31 via  Set85 Set91>)
        time         0% fanout         0 input         0 rows
          clear: (<V var1$28 rn>)$31 (35 33 ) 
        s# 106 49 skip node  1  <none> <r set_no$29 via  Set98 Set85 Set91 Set75>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_4_t0.S$31 via  Set106 Set98 Set85 Set91>
          4: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 71 41 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set106 Set98 Set85 Set91 Set75>
      }
    
    After code:
      0: <V var1$51 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $51 (27 ) $59 (27 60 ) 
    s# 122 53 Select (<V var1$51 a>)
      set no: <r set_ctr$59 via  Set71>
  }
Warning: You might have a Cartesian product.



 0 msec 3% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
