OpenLink Virtuoso Interactive SQL (Virtuoso)
Version 07.20.3232 as of May 11 2021
Type HELP; for help and EXIT; to exit.
Connected to OpenLink Virtuoso
Driver: 07.20.3232 OpenLink Virtuoso ODBC Driver
SPARQL_TO_SQL_TEXT
LONG VARCHAR
_______________________________________________________________________________

SELECT __id2in ( "s_7_2_t0"."P") AS "propertyName",
  __ro2sq ( "s_7_2_t0"."O") AS "propertyValue"
FROM DB.DBA.RDF_QUAD AS "s_7_2_t0"
WHERE
  "s_7_2_t0"."S" = __i2idn ( __bft( 'http://learningsparql.com/ns/addressbook#cindy' , 1))
OPTION (QUIETCAST)

1 Rows. -- 1 msec.

Done. -- 0 msec.

Done. -- 0 msec.

Done. -- 0 msec.
result
LONG VARCHAR
_______________________________________________________________________________

http://learningsparql.com/ns/addressbook#email	cindym@gmail.com	
http://learningsparql.com/ns/addressbook#homeTel	(245) 646-5488	

  { 
    time       1.8% fanout         1 input         1 rows
      clear: (<V set_ctr$45 in>)
    s# 48 46 cluster outer seq start, set no <V set_ctr$45 in>    
    save ctx:()
    time        21% fanout         2 input         1 rows
      clear: (<V s_7_2_t0.P$28 rn>)
      clear on continue: (<V s_7_2_t0.P$28 rn>)
    s# 57 27 from DB.DBA.RDF_QUAD by RDF_QUAD_SP          2 rows   
    Key RDF_QUAD_SP  ASC  (<V s_7_2_t0.P$28 rn>)
     inlined  S =  IRI_ID"...cindy" 
    
    time        76% fanout         1 input         2 rows
      clear: (<V s_7_2_t0.O$32 an>, <V propertyValue$37 a>, <V propertyName$35 a>)
      clear on continue: (<V propertyName$35 a>, <V propertyValue$37 a>, <V s_7_2_t0.O$32 an>)$71 (31 ) $28 () 
    s# 67 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS       0.44 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_7_2_t0.O$32 an>)
     inlined  P = <v k_s_7_2_t0.P$71 Set73 rn>
    row specs:  S =  IRI_ID"...cindy" 
    vector param casts: <V s_7_2_t0.P$28 rn>-> <v k_s_7_2_t0.P$71 Set73 rn>
    
    After code:
      0: <V propertyName$35 a> := Call __id2in (<r s_7_2_t0.P$28 via  Set67 Set73>)
      5: <V propertyValue$37 a> := Call __ro2sq (<V s_7_2_t0.O$32 an>)
      10: BReturn 0
    time      0.22% fanout         0 input         2 rows
    $35 () $37 () $45 (31 27 46 ) 
    s# 81 39 Select (<V propertyName$35 a>, <V propertyValue$37 a>)
      set no: <r set_ctr$45 via  Set67 Set73 Set57>
  }
Warning: You might have a Cartesian product.



 1 msec 18% cpu,         5 rnd        16 seq   16.6667% same seg   16.6667% same pg 
Compilation: 0 msec 0 reads         0% read 0 messages         0% clw

4 Rows. -- 5 msec.
