http://www.wikidata.org/entity/Q3180093	
http://www.wikidata.org/entity/Q16007741	
http://www.wikidata.org/entity/Q16012744	
http://www.wikidata.org/entity/Q16088563	
http://www.wikidata.org/entity/Q4777028	
http://www.wikidata.org/entity/Q6245987	
http://www.wikidata.org/entity/Q6442819	
http://www.wikidata.org/entity/Q6894188	
http://www.wikidata.org/entity/Q7147180	
http://www.wikidata.org/entity/Q7153326	
http://www.wikidata.org/entity/Q7237263	
http://www.wikidata.org/entity/Q7243592	
http://www.wikidata.org/entity/Q7306593	
http://www.wikidata.org/entity/Q7311560	
http://www.wikidata.org/entity/Q7706928	
http://www.wikidata.org/entity/Q12036771	
http://www.wikidata.org/entity/Q15438391	
http://www.wikidata.org/entity/Q16368750	
http://www.wikidata.org/entity/Q16378115	
http://www.wikidata.org/entity/Q16436915	

  { 
    time      0.05% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.013% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        14% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS      2e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1909-01-01 00:00:00Z> <= <tag 211 c 1909-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1909-01-01 00:00:00Z> <= <tag 211 c 1909-12-31 23:59:59Z>
    
    time       4.1% fanout     0.985 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        82% fanout         1 input       985 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.014% fanout         0 input       985 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 7 msec 80% cpu,       362 rnd      6624 seq         0% same seg   6.88705% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
