http://www.wikidata.org/entity/Q2965070	
http://www.wikidata.org/entity/Q3612084	
http://www.wikidata.org/entity/Q42301735	
http://www.wikidata.org/entity/Q1449752	
http://www.wikidata.org/entity/Q7839321	
http://www.wikidata.org/entity/Q826054	
http://www.wikidata.org/entity/Q107355	
http://www.wikidata.org/entity/Q43392	
http://www.wikidata.org/entity/Q3592793	
http://www.wikidata.org/entity/Q5527096	
http://www.wikidata.org/entity/Q7403277	
http://www.wikidata.org/entity/Q1225222	
http://www.wikidata.org/entity/Q11542416	
http://www.wikidata.org/entity/Q978570	
http://www.wikidata.org/entity/Q19928767	
http://www.wikidata.org/entity/Q5852417	
http://www.wikidata.org/entity/Q16382738	
http://www.wikidata.org/entity/Q16193311	
http://www.wikidata.org/entity/Q29037027	
http://www.wikidata.org/entity/Q47488311	

  { 
    time       0.1% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.026% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        60% fanout       191 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.9e+02 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1939-05-01 00:00:00Z> <= <tag 211 c 1939-05-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1939-05-01 00:00:00Z> <= <tag 211 c 1939-05-31 23:59:59Z>
    
    time       4.2% fanout         1 input       191 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        36% fanout         1 input       191 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.03% fanout         0 input       191 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 3 msec 50% cpu,        66 rnd     10813 seq         0% same seg   4.47761% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
