http://www.wikidata.org/entity/Q2924087	
http://www.wikidata.org/entity/Q378222	
http://www.wikidata.org/entity/Q3412467	
http://www.wikidata.org/entity/Q3902685	
http://www.wikidata.org/entity/Q7074171	
http://www.wikidata.org/entity/Q7075121	
http://www.wikidata.org/entity/Q7179822	
http://www.wikidata.org/entity/Q7248516	
http://www.wikidata.org/entity/Q16632358	
http://www.wikidata.org/entity/Q18202981	
http://www.wikidata.org/entity/Q143419	
http://www.wikidata.org/entity/Q169411	
http://www.wikidata.org/entity/Q188531	
http://www.wikidata.org/entity/Q206040	
http://www.wikidata.org/entity/Q575650	
http://www.wikidata.org/entity/Q244627	
http://www.wikidata.org/entity/Q1040272	
http://www.wikidata.org/entity/Q10876607	
http://www.wikidata.org/entity/Q11229880	
http://www.wikidata.org/entity/Q219959	

  { 
    time       1.4% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$49 a>)
    s# 69 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        23% fanout       172 input         1 rows
          clear: (<V s_37_2_t0.S$31 rn>)
          clear on continue: (<V s_37_2_t0.S$31 rn>)
        s# 73 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.7e+02 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
         P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q9143" 
        
        time        72% fanout  0.994186 input       172 rows
        
        s# 83 33 Distinct (HASH) set no <r set_no$29 via  Set73>(<V s_37_2_t0.S$31 rn>)
        time       3.2% fanout         1 input       171 rows
          clear: (<V var1$28 rn>)$31 (33 ) 
        s# 91 47 skip node  10000  <none> <r set_no$29 via  Set83 Set73>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set91 Set83>
          4: BReturn 0
        time       0.4% fanout         0 input       171 rows
        
        s# 69 39 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set91 Set83 Set73>
      }
    
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.32% fanout         0 input       171 rows
    $49 (27 ) $57 (27 58 ) 
    s# 107 51 Select (<V var1$49 a>)
      set no: <r set_ctr$57 via  Set69>
  }
Warning: You might have a Cartesian product.



 1 msec 41% cpu,        14 rnd       171 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
