http://www.wikidata.org/entity/Q2698440	
http://www.wikidata.org/entity/Q2760354	
http://www.wikidata.org/entity/Q2981798	
http://www.wikidata.org/entity/Q3243177	
http://www.wikidata.org/entity/Q307455	
http://www.wikidata.org/entity/Q379842	
http://www.wikidata.org/entity/Q3899681	
http://www.wikidata.org/entity/Q6898425	
http://www.wikidata.org/entity/Q7102101	
http://www.wikidata.org/entity/Q7115966	
http://www.wikidata.org/entity/Q7160092	
http://www.wikidata.org/entity/Q7169509	
http://www.wikidata.org/entity/Q7181444	
http://www.wikidata.org/entity/Q12046281	
http://www.wikidata.org/entity/Q15632711	
http://www.wikidata.org/entity/Q15634250	
http://www.wikidata.org/entity/Q16901191	
http://www.wikidata.org/entity/Q27101951	
http://www.wikidata.org/entity/Q27285509	
http://www.wikidata.org/entity/Q27286155	

  { 
    time     0.065% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.013% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time       1.4% fanout       687 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    6.9e+02 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P279"  ,  O =  IRI_ID"...Q11173" 
    
    time       4.5% fanout         1 input       687 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        94% fanout         1 input       687 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.021% fanout         0 input       687 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 5 msec 76% cpu,       688 rnd       686 seq         0% same seg   71.9884% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
