
  { 
    time       8.7% fanout         1 input         1 rows
      clear: (<V set_ctr$61 in>)
    s# 64 62 cluster outer seq start, set no <V set_ctr$61 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$53 a>)
    s# 73 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        91% fanout         0 input         1 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         2 Fanout:         0
          clear: (<V s_37_2_t0.P$31 rn>)
          clear on continue: (<V s_37_2_t0.P$31 rn>)
        s# 77 30 from DB.DBA.RDF_QUAD by RDF_QUAD_OP          2 rows   
        Key RDF_QUAD_OP  ASC  (<V s_37_2_t0.P$31 rn>)
         inlined  O =  IRI_ID"...direct/P1082" 
        
        time         0% fanout         0 input         0 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       1.2 Fanout:         0
        
        s# 87 34 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        1.2 rows   
        Key RDF_QUAD_POGS  ASC  ()
         P = <V s_37_2_t0.P$31 rn> ,  O =  IRI_ID"...direct/P1082" 
        
        time         0% fanout         0 input         0 rows
        
        s# 96 37 Distinct (HASH) set no <r set_no$29 via  Set87 Set77>(<r s_37_2_t0.P$31 via  Set87>)
        time         0% fanout         0 input         0 rows
          clear: (<V var1$28 rn>)$31 (37 34 ) 
        s# 104 51 skip node  100  <none> <r set_no$29 via  Set96 Set87 Set77>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.P$31 via  Set104 Set96 Set87>
          4: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 73 43 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set104 Set96 Set87 Set77>
      }
    
    After code:
      0: <V var1$53 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $53 (27 ) $61 (27 62 ) 
    s# 120 55 Select (<V var1$53 a>)
      set no: <r set_ctr$61 via  Set73>
  }
Warning: You might have a Cartesian product.



 0 msec 3% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
