http://www.wikidata.org/entity/Q2608493			
http://www.wikidata.org/entity/Q2608594			
http://www.wikidata.org/entity/Q2704391			
http://www.wikidata.org/entity/Q2785255			
http://www.wikidata.org/entity/Q2787506			
http://www.wikidata.org/entity/Q2789600			
http://www.wikidata.org/entity/Q2916022			
http://www.wikidata.org/entity/Q2919849			
http://www.wikidata.org/entity/Q2920278			
http://www.wikidata.org/entity/Q2924877			
http://www.wikidata.org/entity/Q2983621			
http://www.wikidata.org/entity/Q2992490			
http://www.wikidata.org/entity/Q3232076			
http://www.wikidata.org/entity/Q3235149			
http://www.wikidata.org/entity/Q15917232			
http://www.wikidata.org/entity/Q56216			
http://www.wikidata.org/entity/Q381639			
http://www.wikidata.org/entity/Q381808			
http://www.wikidata.org/entity/Q498954			
http://www.wikidata.org/entity/Q1528494			

  { 
    time    0.0017% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
    time   0.00032% fanout         1 input         1 rows
      clear: (<V set_no$31 i>)
    s# 69 48 cluster outer seq start, set no <V set_no$31 i>    
    save ctx:()
    time     0.045% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$33 rn>)
      clear on continue: (<V s_37_2_t0.S$33 rn>)
    s# 78 32 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    3.1e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$33 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q1248784" 
    
    time      0.17% fanout         1 input      1000 rows
      clear: (<V var3$30 x>, <V var2$29 x>, <V var1$28 rn>)$33 () 
    s# 88 35 Distinct (HASH) set no <r set_no$31 via  Set78>(<V s_37_2_t0.S$33 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$33 via  Set88>
      4: <V var2$29 x> :=  := artm <DB_NULL>
      8: <V var3$30 x> :=  := artm <DB_NULL>
      12: BReturn 0
    time     1e+02% fanout         1 input      1000 rows
      clear: (<V var1$49 a>)$31 (35 32 48 ) $28 (35 ) 
    s# 99 41 Subquery Select(<V var1$28 rn>, <V var2$29 x>, <V var3$30 x>)
      set no: <r set_no$31 via  Set88 Set78>
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time    0.0008% fanout         0 input      1000 rows
    $49 (41 ) $57 (41 35 32 48 58 ) $29 (41 35 ) $30 (41 35 ) 
    s# 106 51 Select (<V var1$49 a>, <V var2$29 x>, <V var3$30 x>)
      set no: <r set_ctr$57 via  Set99>
  }
Warning: You might have a Cartesian product.



 109 msec 99% cpu,       895 rnd       998 seq         0% same seg   74.2188% same pg 
Compilation: 0 msec 0 reads         0% read 0 messages         0% clw
