
  { 
    time        66% fanout         1 input         1 rows
      clear: (<V set_ctr$52 in>)
    s# 55 53 cluster outer seq start, set no <V set_ctr$52 in>    
    save ctx:()
    time        34% fanout         0 input         1 rows
    
    s# 64 27 END Node
    After test:
      0: BReturn 0
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   7.3e+07 Fanout:         0
      clear: (<V s_37_6_t2.O$29 an>)
      clear on continue: (<V s_37_6_t2.O$29 an>)
    s# 71 28 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    7.3e+07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t2.O$29 an>)
    
    
    time         0% fanout         0 input         0 rows
    
    s# 86 81 END Node
    After test:
      0: if ( 1  =  2 ) then 4 else 5 unkn 5
      4: BReturn 1
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   7.3e+07 Fanout:         0
    Precode:
      0: <V var3$32 a> := Call __ro2sq (<r s_37_6_t2.O$29 via  Set86>)
      5: BReturn 0
      clear: (<V s_37_6_t1.O$35 an>, <V var3$32 a>)
      clear on continue: (<V s_37_6_t1.O$35 an>)$29 (81 ) 
    s# 94 34 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    7.3e+07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t1.O$35 an>)
    
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   7.3e+07 Fanout:         0
    Precode:
      0: <V var2$38 a> := Call __ro2sq (<V s_37_6_t1.O$35 an>)
      5: BReturn 0
      clear: (<V s_37_6_t0.O$41 an>, <V var2$38 a>, <V var1$44 a>)
      clear on continue: (<V var1$44 a>, <V s_37_6_t0.O$41 an>)$35 () 
    s# 104 40 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    7.3e+07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t0.O$41 an>)
    
    
    After code:
      0: <V var1$44 a> := Call __ro2sq (<V s_37_6_t0.O$41 an>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $32 (40 34 ) $38 (40 ) $44 () $52 (40 34 81 28 27 53 ) 
    s# 114 46 Select (<V var1$44 a>, <r var2$38 via  Set104>, <r var3$32 via  Set104 Set94>)
      set no: <r set_ctr$52 via  Set104 Set94 Set86 Set71 Set64>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 0 msec 1% cpu,         0 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
