http://www.wikidata.org/entity/Q3111875	1985	
http://www.wikidata.org/entity/Q3112200	1974	
http://www.wikidata.org/entity/Q3112468	2000	
http://www.wikidata.org/entity/Q12879416	1926	
http://www.wikidata.org/entity/Q12879438	1952	
http://www.wikidata.org/entity/Q12879444	1905	
http://www.wikidata.org/entity/Q12879447	1935	
http://www.wikidata.org/entity/Q12879457	1886	
http://www.wikidata.org/entity/Q12879458	1865	
http://www.wikidata.org/entity/Q12879460	1871	
http://www.wikidata.org/entity/Q12879466	1903	
http://www.wikidata.org/entity/Q12879494	1909	
http://www.wikidata.org/entity/Q12879504	1916	
http://www.wikidata.org/entity/Q12879510	1945	
http://www.wikidata.org/entity/Q12879516	1967	
http://www.wikidata.org/entity/Q12885615	1952	
http://www.wikidata.org/entity/Q16330988	1909	
http://www.wikidata.org/entity/Q16331104	1945	
http://www.wikidata.org/entity/Q16330923	1949	
http://www.wikidata.org/entity/Q16330970	1964	

  { 
    time       0.7% fanout         1 input         1 rows
      clear: (<V set_ctr$43 in>)
    s# 46 44 cluster outer seq start, set no <V set_ctr$43 in>    
    save ctx:()
    time        13% fanout        24 input         1 rows
      clear: (<V s_37_4_t0.S$28 rn>)
      clear on continue: (<V s_37_4_t0.S$28 rn>)
    s# 55 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         48 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$28 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q15260617" 
    
    time        86% fanout         1 input        24 rows
      clear: (<V s_37_4_t1.O$31 an>, <V var3$35 i>, <V var1$33 a>)
      clear on continue: (<V s_37_4_t1.O$31 an>, <V var3$35 i>, <V var1$33 a>)$28 () 
    s# 65 30 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t1.O$31 an>)
     inlined  P =  IRI_ID"...direct/P580"  ,  S = <V s_37_4_t0.S$28 rn>
    
    After code:
      0: <V var1$33 a> := Call __id2in (<r s_37_4_t0.S$28 via  Set65>)
      5: <V var3$35 i> := Call rdf_year_impl (<V s_37_4_t1.O$31 an>)
      10: BReturn 0
    time      0.15% fanout         0 input        24 rows
    $33 () $35 () $43 (30 27 44 ) 
    s# 75 37 Select (<V var1$33 a>, <V var3$35 i>)
      set no: <r set_ctr$43 via  Set65 Set55>
  }
Warning: You might have a Cartesian product.



 1 msec 26% cpu,        49 rnd        23 seq        44% same seg        36% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
