http://www.wikidata.org/prop/direct/P512	http://d-nb.info/standards/elementset/gnd#academicDegree	
http://www.wikidata.org/prop/direct/P3224	http://purl.org/goodrelations/v1#hasNAICS	
http://www.wikidata.org/prop/direct/P3224	http://www.freebase.com/business/naics2007	
http://www.wikidata.org/prop/direct/P3224	https://schema.org/naics	
http://www.wikidata.org/prop/direct/P449	http://www.freebase.com/tv/tv_program/original_network	
http://www.wikidata.org/prop/direct/P1476	http://purl.org/dc/terms/title	
http://www.wikidata.org/prop/direct/P1476	http://ogp.me/ns#title	
http://www.wikidata.org/prop/direct/P1476	https://schema.org/name	
http://www.wikidata.org/prop/direct/P1476	http://purl.bdrc.io/ontology/core/hasTitle	
http://www.wikidata.org/prop/direct/P1476	http://gov.genealogy.net/ontology.owl#hasTitle	

  { 
    time      0.99% fanout         1 input         1 rows
      clear: (<V set_ctr$44 in>)
    s# 50 45 cluster outer seq start, set no <V set_ctr$44 in>    
    save ctx:()
    time        20% fanout        81 input         1 rows
      clear: (<V s_37_4_t0.O$28 an>, <V s_37_4_t0.S$29 rn>)
      clear on continue: (<V s_37_4_t0.O$28 an>, <V s_37_4_t0.S$29 rn>)
    s# 59 27 from DB.DBA.RDF_QUAD by RDF_QUAD         81 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t0.S$29 rn>, <V s_37_4_t0.O$28 an>)
     inlined  P =  IRI_ID"...direct/P1628" 
    
    time        20% fanout  0.925926 input        81 rows
      clear: (<V s_37_4_t1.O$32 an>)
      clear on continue: (<V s_37_4_t1.O$32 an>)$29 () 
    s# 70 31 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t1.O$32 an>)
     inlined  P =  IRI_ID"...directClaim"  ,  S = <V s_37_4_t0.S$29 rn>
    
    time        59% fanout  0.133333 input        75 rows
      clear: (<V var1$36 a>, <V var2$34 a>)$32 () $28 (31 ) 
    s# 80 48 skip node  10  <none> <r set_ctr$44 via  Set70 Set59>
    After code:
      0: <V var2$34 a> := Call __ro2sq (<r s_37_4_t0.O$28 via  Set80 Set70>)
      5: <V var1$36 a> := Call __ro2sq (<r s_37_4_t1.O$32 via  Set80>)
      10: BReturn 0
    time      0.23% fanout         0 input        10 rows
    $34 (48 ) $36 (48 ) $44 (48 31 27 45 ) 
    s# 88 38 Select (<V var1$36 a>, <V var2$34 a>)
      set no: <r set_ctr$44 via  Set80 Set70 Set59>
  }
Warning: You might have a Cartesian product.



 1 msec 20% cpu,        83 rnd        80 seq   95.2381% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
