http://www.openlinksw.com/virtrdf-data-formats#default-iid	
http://www.openlinksw.com/virtrdf-data-formats#default	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-dt	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-lang	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-fixedlang-x-any	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-uri	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-literal	
http://www.openlinksw.com/virtrdf-data-formats#sql-nvarchar	
http://www.openlinksw.com/virtrdf-data-formats#sql-nvarchar-dt	
http://www.openlinksw.com/virtrdf-data-formats#sql-nvarchar-lang	
http://www.openlinksw.com/virtrdf-data-formats#sql-nvarchar-fixedlang-x-any	
http://www.openlinksw.com/virtrdf-data-formats#sql-integer	
http://www.openlinksw.com/virtrdf-data-formats#sql-integer-uri	
http://www.openlinksw.com/virtrdf-data-formats#sql-integer-literal	
http://www.openlinksw.com/virtrdf-data-formats#sql-numeric	
http://www.openlinksw.com/virtrdf-data-formats#sql-numeric-uri	
http://www.openlinksw.com/virtrdf-data-formats#sql-numeric-literal	
http://www.openlinksw.com/virtrdf-data-formats#sql-doubleprecision	
http://www.openlinksw.com/virtrdf-data-formats#sql-date	

  { 
    time   0.00023% fanout         1 input         1 rows
      clear: (<V set_ctr$43 in>)
    s# 46 44 cluster outer seq start, set no <V set_ctr$43 in>    
    save ctx:()
    time      0.78% fanout       100 input         1 rows
      clear: (<V s_7_2_t0.P$28 rn>)
      clear on continue: (<V s_7_2_t0.P$28 rn>)
    s# 55 27 from DB.DBA.RDF_QUAD by RDF_QUAD_OP         20 rows   
    Key RDF_QUAD_OP  ASC  (<V s_7_2_t0.P$28 rn>)
     inlined  O =  1 
    
    time        99% fanout        10 input       100 rows
      clear: (<V s_7_2_t0.S$32 rn>, <V s$35 a>)
      clear on continue: (<V s_7_2_t0.S$32 rn>, <V s$35 a>)$28 () 
    s# 65 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        1.2 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_7_2_t0.S$32 rn>)
     P = <V s_7_2_t0.P$28 rn> ,  O =  1 
    
    After code:
      0: <V s$35 a> := Call __id2in (<V s_7_2_t0.S$32 rn>)
      5: BReturn 0
    time   0.00015% fanout         0 input      1000 rows
    $35 () $43 (31 27 44 ) 
    s# 75 37 Select (<V s$35 a>)
      set no: <r set_ctr$43 via  Set65 Set55>
  }
Warning: You might have a Cartesian product.



 842 msec 96% cpu,       920 rnd      1031 seq   4.01737% same seg   53.4202% same pg 
2954 disk reads, 3508 read ahead,    95.614% wait
Compilation: 26 msec 13 reads   2.94595% read 0 messages         0% clw
