http://www.wikidata.org/entity/Q660993	
http://www.wikidata.org/entity/Q18649213	
http://www.wikidata.org/entity/Q3129529	
http://www.wikidata.org/entity/Q13420888	
http://www.wikidata.org/entity/Q5219582	
http://www.wikidata.org/entity/Q21033617	
http://www.wikidata.org/entity/Q1290611	
http://www.wikidata.org/entity/Q1336098	
http://www.wikidata.org/entity/Q79791211	
http://www.wikidata.org/entity/Q4422742	
http://www.wikidata.org/entity/Q4424683	
http://www.wikidata.org/entity/Q19300129	
http://www.wikidata.org/entity/Q5254273	
http://www.wikidata.org/entity/Q16012339	
http://www.wikidata.org/entity/Q2939245	
http://www.wikidata.org/entity/Q3436484	
http://www.wikidata.org/entity/Q12352311	
http://www.wikidata.org/entity/Q1350615	
http://www.wikidata.org/entity/Q11994345	
http://www.wikidata.org/entity/Q3743798	

  { 
    time   0.00065% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time   0.00013% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time      0.36% fanout       107 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.1e+02 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P570"  ,  O >= <tag 211 c 1989-12-01 00:00:00Z> <= <tag 211 c 1989-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1989-12-01 00:00:00Z> <= <tag 211 c 1989-12-31 23:59:59Z>
    
    time     0.026% fanout  0.981308 input       107 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time     1e+02% fanout         1 input       105 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time   0.00032% fanout         0 input       105 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 505 msec 99% cpu,        99 rnd     10870 seq         0% same seg         3% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
