http://www.wikidata.org/entity/Q2608493	
http://www.wikidata.org/entity/Q2608594	
http://www.wikidata.org/entity/Q2704391	
http://www.wikidata.org/entity/Q2785255	
http://www.wikidata.org/entity/Q2787506	
http://www.wikidata.org/entity/Q2789600	
http://www.wikidata.org/entity/Q2916022	
http://www.wikidata.org/entity/Q2919849	
http://www.wikidata.org/entity/Q2920278	
http://www.wikidata.org/entity/Q2924877	
http://www.wikidata.org/entity/Q2983621	
http://www.wikidata.org/entity/Q2992490	
http://www.wikidata.org/entity/Q3232076	
http://www.wikidata.org/entity/Q3235149	
http://www.wikidata.org/entity/Q15917232	
http://www.wikidata.org/entity/Q56216	
http://www.wikidata.org/entity/Q381639	
http://www.wikidata.org/entity/Q381808	
http://www.wikidata.org/entity/Q498954	
http://www.wikidata.org/entity/Q1528494	

  { 
    time    0.0048% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$49 a>)
    s# 69 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time      0.12% fanout      1000 input         1 rows
          clear: (<V s_37_2_t0.S$31 rn>)
          clear on continue: (<V s_37_2_t0.S$31 rn>)
        s# 73 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    3.1e+03 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
         P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q1248784" 
        
        time     1e+02% fanout         1 input      1000 rows
        
        s# 83 33 Distinct (HASH) set no <r set_no$29 via  Set73>(<V s_37_2_t0.S$31 rn>)
        time      0.02% fanout         1 input      1000 rows
          clear: (<V var1$28 rn>)$31 (33 ) 
        s# 91 47 skip node  1000  <none> <r set_no$29 via  Set83 Set73>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set91 Set83>
          4: BReturn 0
        time   0.00086% fanout         0 input      1000 rows
        
        s# 69 39 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set91 Set83 Set73>
      }
    
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time   0.00084% fanout         0 input      1000 rows
    $49 (27 ) $57 (27 58 ) 
    s# 107 51 Select (<V var1$49 a>)
      set no: <r set_ctr$57 via  Set69>
  }
Warning: You might have a Cartesian product.



 76 msec 98% cpu,       999 rnd       998 seq         0% same seg      73.5% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
