http://www.wikidata.org/entity/Q3722427	1874-11-08 00:00:00Z	
http://www.wikidata.org/entity/Q3722430	1882-10-29 00:00:00Z	

  { 
    time       1.6% fanout         1 input         1 rows
      clear: (<V set_ctr$43 in>)
    s# 46 44 cluster outer seq start, set no <V set_ctr$43 in>    
    save ctx:()
    time        25% fanout         2 input         1 rows
      clear: (<V s_37_4_t0.S$28 rn>)
      clear on continue: (<V s_37_4_t0.S$28 rn>)
    s# 55 27 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS          2 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$28 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q3722420" 
    
    time        73% fanout         1 input         2 rows
      clear: (<V s_37_4_t1.O$31 an>, <V var2$35 a>, <V var1$33 a>)
      clear on continue: (<V s_37_4_t1.O$31 an>, <V var2$35 a>, <V var1$33 a>)$28 () 
    s# 65 30 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t1.O$31 an>)
     inlined  P =  IRI_ID"...direct/P585"  ,  S = <V s_37_4_t0.S$28 rn>
    
    After code:
      0: <V var1$33 a> := Call __id2in (<r s_37_4_t0.S$28 via  Set65>)
      5: <V var2$35 a> := Call __ro2sq (<V s_37_4_t1.O$31 an>)
      10: BReturn 0
    time      0.36% fanout         0 input         2 rows
    $33 () $35 () $43 (30 27 44 ) 
    s# 75 37 Select (<V var1$33 a>, <V var2$35 a>)
      set no: <r set_ctr$43 via  Set65 Set55>
  }
Warning: You might have a Cartesian product.



 0 msec 13% cpu,         5 rnd         1 seq   16.6667% same seg   16.6667% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
