
  { 
    time       3.9% fanout         1 input         1 rows
      clear: (<V set_ctr$59 in>)
    s# 62 60 cluster outer seq start, set no <V set_ctr$59 in>    
    save ctx:()
    time         1% fanout         1 input         1 rows
      clear: (<V set_no$31 i>)
    s# 71 50 cluster outer seq start, set no <V set_no$31 i>    
    save ctx:()
    time        55% fanout         1 input         1 rows
      clear: (<V s_37_4_t0.S$33 rn>)
      clear on continue: (<V s_37_4_t0.S$33 rn>)
    s# 80 32 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS          1 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$33 rn>)
     P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q174219" 
    
    time        40% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:    0.0013 Fanout:         0
    
    s# 90 35 from DB.DBA.RDF_QUAD by RDF_QUAD     0.0013 rows   
    Key RDF_QUAD  ASC  ()
     inlined  P =  IRI_ID"...direct/P170"  ,  S = <V s_37_4_t0.S$33 rn> ,  O =  IRI_ID"...Q5582" 
    
    time         0% fanout         0 input         0 rows
      clear: (<V var2$30 x>, <V var1Label$29 x>, <V var1$28 rn>)$33 (35 ) 
    s# 99 37 Distinct (HASH) set no <r set_no$31 via  Set90 Set80>(<r s_37_4_t0.S$33 via  Set90>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_4_t0.S$33 via  Set99 Set90>
      4: <V var1Label$29 x> :=  := artm <DB_NULL>
      8: <V var2$30 x> :=  := artm <DB_NULL>
      12: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var1$51 a>)$31 (37 35 32 50 ) $28 (37 ) 
    s# 110 43 Subquery Select(<V var1$28 rn>, <V var1Label$29 x>, <V var2$30 x>)
      set no: <r set_no$31 via  Set99 Set90 Set80>
    After code:
      0: <V var1$51 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $51 (43 ) $59 (43 37 35 32 50 60 ) $29 (43 37 ) $30 (43 37 ) 
    s# 117 53 Select (<V var1$51 a>, <V var1Label$29 x>, <V var2$30 x>)
      set no: <r set_ctr$59 via  Set110>
  }
Warning: You might have a Cartesian product.



 0 msec 5% cpu,         2 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
