
  { 
    time         2% fanout         1 input         1 rows
      clear: (<V set_ctr$60 in>)
    s# 63 61 cluster outer seq start, set no <V set_ctr$60 in>    
    save ctx:()
    time        77% fanout         1 input         1 rows
    Precode:
      0: <V prop/direct/P134$27 r> := Call __i2idn (<tag 182 flag 1 c http://www.wikidata.org/prop/direct/P134>)
      5: BReturn 0
      clear: (<V set_no$31 i>, <V prop/direct/P134$27 r>)
    s# 72 51 cluster outer seq start, set no <V set_no$31 i>    
    save ctx:()
    time        21% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.1e-07 Fanout:         0
      clear: (<V s_37_4_t1.S$33 rn>)
      clear on continue: (<V s_37_4_t1.S$33 rn>)$85 (32 ) $27 (51 ) 
    s# 81 32 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.1e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_4_t1.S$33 rn>)
     inlined  P = <v k_prop/direct/P134$85 Set87 rn>
    vector param casts: <r prop/direct/P134$27 via  Set72>-> <v k_prop/direct/P134$85 Set87 rn>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   0.00021 Fanout:         0
      clear: (<V s_37_4_t0.S$36 rn>)
      clear on continue: (<V s_37_4_t0.S$36 rn>)$33 () 
    s# 95 35 from DB.DBA.RDF_QUAD by RDF_QUAD    0.00021 rows   
    Key RDF_QUAD  ASC  (<V s_37_4_t0.S$36 rn>)
     inlined  P =  IRI_ID"...direct/P31"  ,  S = <V s_37_4_t1.S$33 rn> ,  O =  IRI_ID"...Q34770" 
    
    time         0% fanout         0 input         0 rows
      clear: (<V var1$30 rn>)$36 () 
    s# 105 38 Distinct (HASH) set no <r set_no$31 via  Set95 Set81 Set87>(<V s_37_4_t0.S$36 rn>)
    After code:
      0: <V var1$30 rn> :=  := artm <r s_37_4_t0.S$36 via  Set105>
      4: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var1$52 a>)$31 (38 35 32 51 ) $30 (38 ) 
    s# 114 44 Subquery Select(<V var1$30 rn>)
      set no: <r set_no$31 via  Set105 Set95 Set81 Set87>
    After code:
      0: <V var1$52 a> := Call __ro2sq (<V var1$30 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $52 (44 ) $60 (44 38 35 32 51 61 ) 
    s# 121 54 Select (<V var1$52 a>)
      set no: <r set_ctr$60 via  Set114>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         4 rnd         0 seq         0% same seg         0% same pg 
Compilation: 22 msec 256 reads   91.5286% read 0 messages         0% clw
