Error: 22023: SR353: Sorted TOP clause specifies more then 15000 rows to sort. Only 10000 are allowed. Either decrease the offset and/or row count or use a scrollable cursor
  { 
    time       1.1% fanout         1 input         1 rows
      clear: (<V set_ctr$77 in>)
    s# 80 78 cluster outer seq start, set no <V set_ctr$77 in>    
    save ctx:()
      clear: (<V var1$28 a>, <V set_no$29 i>, <V var1$69 a>)
    s# 89 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time       0.3% fanout         0 input         1 rows
        
        s# 129 43 Fork 43 {  
                
            save ctx:()
              set no = <V set_no$29 i> array  <none>  save: 
            time        18% fanout      1000 input         1 rows
            Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   3.4e+04 Fanout:     1e+03
              clear: (<V s_37_4_t0.S$31 rn>)
              clear on continue: (<V s_37_4_t0.S$31 rn>)
            s# 94 30 from DB.DBA.RDF_QUAD by RDF_QUAD    3.4e+04 rows   
            Key RDF_QUAD  ASC  (<V s_37_4_t0.S$31 rn>)
             inlined  P =  IRI_ID"...direct/P364" 
            
            time        48% fanout     0.035 input      1000 rows
            Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:         1 Fanout:     0.035
            
            s# 104 33 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
            Key RDF_QUAD  ASC  ()
             inlined  P =  IRI_ID"...direct/P407"  ,  S = <V s_37_4_t0.S$31 rn>
            
            time        33% fanout  0.971429 input        35 rows
            
            s# 113 35 Distinct (HASH) set no <r set_no$29 via  Set104 Set94>(<r s_37_4_t0.S$31 via  Set104>)
            time         0% fanout         0 input        34 rows
            Precode:
              0: <V __id2in$41 a> := Call __id2in (<r s_37_4_t0.S$31 via  Set113 Set104>)
              5: BReturn 0
              clear: (<V __id2in$41 a>)$31 (35 33 ) 
            s# 121 44 Sort (HASH) set no <r set_no$29 via  Set113 Set104 Set94>(TOP  10000 ,  5000  ) (<V __id2in$41 a>)
        }
        time         0% fanout         0 input         0 rows
          clear: (<V __id2in$41 a>, <V var1$28 a>)
          clear on continue: (<V __id2in$41 a>, <V var1$28 a>)
        s# 136 49 top order by node (<V __id2in$41 a>)
        set no <V set_no$29 i>
        After code:
          0: <V var1$28 a> :=  := artm <V __id2in$41 a>
          4: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 89 62 Subquery Select(<V var1$28 a>)
          set no: <r set_no$29 via  Set136>
      }
    
    After code:
      0: <V var1$69 a> := Call __ro2sq (<V var1$28 a>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $69 (27 ) $77 (27 78 ) 
    s# 154 71 Select (<V var1$69 a>)
      set no: <r set_ctr$77 via  Set89>
  }


 0 msec 0% cpu,      1033 rnd       998 seq   96.6151% same seg  0.386847% same pg 
Compilation: 228 msec 17 reads    23.811% read 0 messages         0% clw
