http://www.wikidata.org/entity/Q2700974	
http://www.wikidata.org/entity/Q2784501	
http://www.wikidata.org/entity/Q3126876	
http://www.wikidata.org/entity/Q16002996	
http://www.wikidata.org/entity/Q41252038	
http://www.wikidata.org/entity/Q5645317	
http://www.wikidata.org/entity/Q6256017	
http://www.wikidata.org/entity/Q6376805	
http://www.wikidata.org/entity/Q6505012	
http://www.wikidata.org/entity/Q7372159	
http://www.wikidata.org/entity/Q7372498	
http://www.wikidata.org/entity/Q15438444	
http://www.wikidata.org/entity/Q15440143	
http://www.wikidata.org/entity/Q16373499	
http://www.wikidata.org/entity/Q17002888	
http://www.wikidata.org/entity/Q18246676	
http://www.wikidata.org/entity/Q20507827	
http://www.wikidata.org/entity/Q21288785	
http://www.wikidata.org/entity/Q21387617	
http://www.wikidata.org/entity/Q21389714	

  { 
    time     0.053% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.011% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time       7.7% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.1e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P570"  ,  O >= <tag 211 c 1963-01-01 00:00:00Z> <= <tag 211 c 1963-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1963-01-01 00:00:00Z> <= <tag 211 c 1963-12-31 23:59:59Z>
    
    time       4.2% fanout      0.97 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        88% fanout         1 input       970 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.011% fanout         0 input       970 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 7 msec 64% cpu,       927 rnd      3086 seq         0% same seg   15.9483% same pg 
Compilation: 3 msec 0 reads         0% read 0 messages         0% clw
