
  { 
    time        11% fanout         1 input         1 rows
      clear: (<V set_ctr$49 in>)
    s# 52 50 cluster outer seq start, set no <V set_ctr$49 in>    
    save ctx:()
    time        89% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t2.O$28 an>)
      clear on continue: (<V s_37_6_t2.O$28 an>)
    s# 61 27 from DB.DBA.RDF_QUAD by RDF_QUAD    1.4e-07 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t2.O$28 an>)
     inlined  P =  IRI_ID"...direct/571"  ,  S =  IRI_ID"...Q11696" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_6_t1.O$31 an>, <V s_37_6_t1.S$32 rn>)
      clear on continue: (<V s_37_6_t1.O$31 an>, <V s_37_6_t1.S$32 rn>)
    s# 71 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_6_t1.S$32 rn>, <V s_37_6_t1.O$31 an>)
     inlined  P =  IRI_ID"...direct/P" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   0.00031 Fanout:         0
      clear: (<V s_37_6_t0.S$35 rn>, <V var1$41 a>, <V var2$39 a>, <V var3$37 a>)
      clear on continue: (<V s_37_6_t0.S$35 rn>, <V var1$41 a>, <V var2$39 a>, <V var3$37 a>)$31 () $32 () $28 (30 ) 
    s# 82 34 from DB.DBA.RDF_QUAD by RDF_QUAD    0.00031 rows   
    Key RDF_QUAD  ASC  (<V s_37_6_t0.S$35 rn>)
     inlined  P =  IRI_ID"...direct/P39"  ,  S = <V s_37_6_t1.S$32 rn> ,  O =  IRI_ID"...Q11696" 
    
    After code:
      0: <V var3$37 a> := Call __ro2sq (<r s_37_6_t2.O$28 via  Set82 Set71>)
      5: <V var2$39 a> := Call __ro2sq (<r s_37_6_t1.O$31 via  Set82>)
      10: <V var1$41 a> := Call __id2in (<V s_37_6_t0.S$35 rn>)
      15: BReturn 0
    time         0% fanout         0 input         0 rows
    $37 () $39 () $41 () $49 (34 30 27 50 ) 
    s# 92 43 Select (<V var1$41 a>, <V var2$39 a>, <V var3$37 a>)
      set no: <r set_ctr$49 via  Set82 Set71 Set61>
  }
Warning: You might have a Cartesian product.

Warning: You might have a Cartesian product.



 0 msec 1% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 4 msec 0 reads         0% read 0 messages         0% clw
