
  { 
    time         7% fanout         1 input         1 rows
      clear: (<V set_ctr$60 in>)
    s# 63 61 cluster outer seq start, set no <V set_ctr$60 in>    
    save ctx:()
      clear: (<V var1Label$29 x>, <V var1$28 rn>, <V set_no$30 i>, <V var1$52 a>)
    s# 72 27 Subquery 27 
      multistate set no = <V set_no$30 i>
      { 
        time        93% fanout         0 input         1 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
          clear: (<V s_37_4_t0.S$32 rn>)
          clear on continue: (<V s_37_4_t0.S$32 rn>)
        s# 76 31 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS        0.3 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_4_t0.S$32 rn>)
         P =  IRI_ID"...direct/P106"  ,  O =  IRI_ID"...Q23925393" 
        
        time         0% fanout         0 input         0 rows
        Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:    0.0061 Fanout:         0
        
        s# 86 34 from DB.DBA.RDF_QUAD by RDF_QUAD     0.0061 rows   
        Key RDF_QUAD  ASC  ()
         inlined  P =  IRI_ID"...direct/P17"  ,  S = <V s_37_4_t0.S$32 rn> ,  O =  IRI_ID"...Q1028" 
        
        time         0% fanout         0 input         0 rows
        
        s# 95 36 Distinct (HASH) set no <r set_no$30 via  Set86 Set76>(<r s_37_4_t0.S$32 via  Set86>)
        time         0% fanout         0 input         0 rows
          clear: (<V var1Label$29 x>, <V var1$28 rn>)$32 (36 34 ) 
        s# 103 50 skip node  111  <none> <r set_no$30 via  Set95 Set86 Set76>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_4_t0.S$32 via  Set103 Set95 Set86>
          4: <V var1Label$29 x> :=  := artm <DB_NULL>
          8: BReturn 0
        time         0% fanout         0 input         0 rows
        
        s# 72 42 Subquery Select(<V var1$28 rn>, <V var1Label$29 x>)
          set no: <r set_no$30 via  Set103 Set95 Set86 Set76>
      }
    
    After code:
      0: <V var1$52 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $52 (27 ) $29 (27 ) $60 (27 61 ) 
    s# 120 54 Select (<V var1$52 a>, <V var1Label$29 x>)
      set no: <r set_ctr$60 via  Set72>
  }
Warning: You might have a Cartesian product.



 0 msec 0% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 23 msec 1 reads   93.5016% read 0 messages         0% clw
