
  { 
    time       7.6% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
    time       1.9% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 69 48 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        90% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:       0.3 Fanout:         0
      clear: (<V s_37_5_t1.O$31 an>)
      clear on continue: (<V s_37_5_t1.O$31 an>)
    s# 78 30 from DB.DBA.RDF_QUAD by RDF_QUAD        0.3 rows   
    Key RDF_QUAD  ASC  (<V s_37_5_t1.O$31 an>)
     inlined  P =  IRI_ID"...direct/P131"  ,  S =  IRI_ID"...Q11297" 
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   0.00018 Fanout:         0
    $92 (33 ) 
    s# 88 33 from DB.DBA.RDF_QUAD by RDF_QUAD    0.00018 rows   
    Key RDF_QUAD  ASC  ()
     inlined  P =  IRI_ID"...direct/P31"  ,  S = <v cast$92 Set94 rn> ,  O =  IRI_ID"...Q515" 
    vector param casts: <V s_37_5_t1.O$31 an>-> <v cast$92 Set94 rn>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var1$28 an>)$31 (33 ) 
    s# 101 35 Distinct (HASH) set no <r set_no$29 via  Set88 Set94 Set78>(<r s_37_5_t1.O$31 via  Set88 Set94>)
    After code:
      0: <V var1$28 an> :=  := artm <r s_37_5_t1.O$31 via  Set101 Set88 Set94>
      4: BReturn 0
    time         0% fanout         0 input         0 rows
      clear: (<V var1$49 a>)$28 (35 ) $29 (35 33 30 48 ) 
    s# 110 41 Subquery Select(<V var1$28 an>)
      set no: <r set_no$29 via  Set101 Set88 Set94 Set78>
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 an>)
      5: BReturn 0
    time         0% fanout         0 input         0 rows
    $49 (41 ) $57 (41 35 33 30 48 58 ) 
    s# 117 51 Select (<V var1$49 a>)
      set no: <r set_ctr$57 via  Set110>
  }
Warning: You might have a Cartesian product.



 0 msec 2% cpu,         1 rnd         0 seq         0% same seg         0% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
