1	
1	
1	
1	
1	
1	
1	
1	
1	
1	
1	
1	
1	
1	
1	
1	
1	
1	
1	
1	

  { 
    time    0.0014% fanout         1 input         1 rows
      clear: (<V set_ctr$73 in>)
    s# 76 74 cluster outer seq start, set no <V set_ctr$73 in>    
    save ctx:()
      clear: (<V var2$28 in>, <V set_no$29 i>, <V var2$65 a>)
    s# 85 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time    0.0011% fanout         1 input         1 rows
        
        s# 108 35 Fork 35 {  
                
            save ctx:()
              set no = <V set_no$29 i> array  <none>  save: 
            time        47% fanout    529446 input         1 rows
              clear: (<V s_37_2_t0.S$31 rn>, <V isnotnull$33 in>)
              clear on continue: (<V s_37_2_t0.S$31 rn>, <V isnotnull$33 in>)
            s# 90 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    5.3e+05 rows Parallel, tail cost   1.6e+05   
            Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
             P =  IRI_ID"...direct/P31"  ,  O =  IRI_ID"...Q5" 
            copy on branch $29 $0 $0 $0 sets: 76 
            
            After code:
              0: <V isnotnull$33 in> := Call isnotnull (<V s_37_2_t0.S$31 rn>)
              5: BReturn 0
            time        53% fanout         0 input    529446 rows
            $31 () $33 () 
            s# 100 36 Sort (HASH) set no <r set_no$29 via  Set90>(<V s_37_2_t0.S$31 rn>) -> (<V isnotnull$33 in>) up to   6.8e+06 distinct
            
        }
        time      0.01% fanout      1000 input         1 rows
          clear: (<V aggregate$37 in>, <V s_37_2_t0.S$31 rn>, <V var2$28 in>)
          clear on continue: (<V aggregate$37 in>, <V s_37_2_t0.S$31 rn>, <V var2$28 in>)
        s# 115 43 group by read node  
        (<V s_37_2_t0.S$31 rn>, <V aggregate$37 in>)
        After code:
          0: <V var2$28 in> :=  := artm <V aggregate$37 in>
          4: BReturn 0
        time   0.00024% fanout         0 input      1000 rows
        
        s# 85 58 Subquery Select(<V var2$28 in>)
          set no: <r set_no$29 via  Set115>
      }
    
    After code:
      0: <V var2$65 a> := Call __ro2sq (<V var2$28 in>)
      5: BReturn 0
    time   0.00022% fanout         0 input      1000 rows
    $65 (27 ) $73 (27 74 ) 
    s# 133 67 Select (<V var2$65 a>)
      set no: <r set_ctr$73 via  Set85>
  }


 119 msec 157% cpu,         1 rnd    528888 seq         0% same seg         0% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
