http://www.wikidata.org/entity/Q7603948	
http://www.wikidata.org/entity/Q7909566	
http://www.wikidata.org/entity/Q4926579	
http://www.wikidata.org/entity/Q26713495	
http://www.wikidata.org/entity/Q27896384	
http://www.wikidata.org/entity/Q19017434	
http://www.wikidata.org/entity/Q7899467	
http://www.wikidata.org/entity/Q11331149	
http://www.wikidata.org/entity/Q1326731	
http://www.wikidata.org/entity/Q5282028	
http://www.wikidata.org/entity/Q30688172	
http://www.wikidata.org/entity/Q48977051	
http://www.wikidata.org/entity/Q16159117	
http://www.wikidata.org/entity/Q47332211	
http://www.wikidata.org/entity/Q18236602	
http://www.wikidata.org/entity/Q22123208	
http://www.wikidata.org/entity/Q18236655	
http://www.wikidata.org/entity/Q5032323	
http://www.wikidata.org/entity/Q17216401	
http://www.wikidata.org/entity/Q5245019	

  { 
    time    0.0028% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time   0.00047% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time       1.1% fanout        43 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         43 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 2007-01-01 00:00:00Z> <= <tag 211 c 2007-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 2007-01-01 00:00:00Z> <= <tag 211 c 2007-12-31 23:59:59Z>
    
    time      0.12% fanout         1 input        43 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        99% fanout         1 input        43 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time    0.0013% fanout         0 input        43 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 64 msec 97% cpu,        43 rnd     11612 seq         0% same seg   2.27273% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
