http://www.openlinksw.com/virtrdf-data-formats#default-iid	
http://www.openlinksw.com/virtrdf-data-formats#default-iid-nullable	
http://www.openlinksw.com/virtrdf-data-formats#default-iid-nonblank	
http://www.openlinksw.com/virtrdf-data-formats#default-iid-nonblank-nullable	
http://www.openlinksw.com/virtrdf-data-formats#default	
http://www.openlinksw.com/virtrdf-data-formats#default-nullable	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-nullable	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-dt	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-dt-nullable	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-lang	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-lang-nullable	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-fixedlang-x-any	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-fixedlang-x-any-nullable	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-uri	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-uri-nullable	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-literal	
http://www.openlinksw.com/virtrdf-data-formats#sql-varchar-literal-nullable	
http://www.openlinksw.com/virtrdf-data-formats#sql-longvarchar	
http://www.openlinksw.com/virtrdf-data-formats#sql-longvarchar-nullable	

  { 
    time      0.49% fanout         1 input         1 rows
      clear: (<V set_ctr$38 in>)
    s# 44 39 cluster outer seq start, set no <V set_ctr$38 in>    
    save ctx:()
    time        11% fanout      1000 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.1e+07 Fanout:     1e+03
      clear: (<V s_37_2_t0.S$28 rn>)
      clear on continue: (<V s_37_2_t0.S$28 rn>)
    s# 53 27 from DB.DBA.RDF_QUAD by RDF_QUAD    1.1e+07 rows   
    Key RDF_QUAD  ASC  (<V s_37_2_t0.S$28 rn>)
     inlined  P =  IRI_ID"...type" 
    
    time        88% fanout       0.1 input      1000 rows
      clear: (<V var1$30 a>)$28 () 
    s# 63 42 skip node  100  <none> <r set_ctr$38 via  Set53>
    After code:
      0: <V var1$30 a> := Call __id2in (<r s_37_2_t0.S$28 via  Set63>)
      5: BReturn 0
    time      0.17% fanout         0 input       100 rows
    $38 (42 27 39 ) $30 (42 ) 
    s# 71 32 Select (<V var1$30 a>)
      set no: <r set_ctr$38 via  Set63 Set53>
  }
Warning: You might have a Cartesian product.



 1 msec 37% cpu,        12 rnd       998 seq         0% same seg   76.9231% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
