http://www.wikidata.org/entity/Q2638676	
http://www.wikidata.org/entity/Q3122912	
http://www.wikidata.org/entity/Q16006753	
http://www.wikidata.org/entity/Q16006791	
http://www.wikidata.org/entity/Q16006800	
http://www.wikidata.org/entity/Q16006872	
http://www.wikidata.org/entity/Q16197993	
http://www.wikidata.org/entity/Q380756	
http://www.wikidata.org/entity/Q5460289	
http://www.wikidata.org/entity/Q5531966	
http://www.wikidata.org/entity/Q5536745	
http://www.wikidata.org/entity/Q5585446	
http://www.wikidata.org/entity/Q5651714	
http://www.wikidata.org/entity/Q6749483	
http://www.wikidata.org/entity/Q7509424	
http://www.wikidata.org/entity/Q7709408	
http://www.wikidata.org/entity/Q9374128	
http://www.wikidata.org/entity/Q15434799	
http://www.wikidata.org/entity/Q15438106	
http://www.wikidata.org/entity/Q15650298	

  { 
    time     0.051% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time     0.011% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        24% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.3e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P570"  ,  O >= <tag 211 c 1970-01-01 00:00:00Z> <= <tag 211 c 1970-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1970-01-01 00:00:00Z> <= <tag 211 c 1970-12-31 23:59:59Z>
    
    time       4.4% fanout     0.983 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        72% fanout         1 input       983 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time    0.0092% fanout         0 input       983 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 7 msec 55% cpu,       677 rnd     11492 seq         0% same seg   12.6844% same pg 
Compilation: 4 msec 0 reads         0% read 0 messages         0% clw
