
  { 
    time       2.3% fanout         1 input         1 rows
      clear: (<V set_ctr$46 in>)
    s# 52 47 cluster outer seq start, set no <V set_ctr$46 in>    
    save ctx:()
    time        98% fanout         0 input         1 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
    Precode:
      0: <V prop/statement/39$27 r> := Call __i2idn (<tag 182 flag 1 c http://www.wikidata.org/prop/statement/39>)
      5: BReturn 0
      clear: (<V s_37_7_t1.O$30 an>, <V s_37_7_t1.S$31 rn>, <V prop/statement/39$27 r>)
      clear on continue: (<V s_37_7_t1.S$31 rn>, <V s_37_7_t1.O$30 an>)$65 (29 ) $27 (29 ) 
    s# 61 29 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_7_t1.S$31 rn>, <V s_37_7_t1.O$30 an>)
     inlined  P = <v k_prop/statement/39$65 Set67 rn>
    vector param casts: <V prop/statement/39$27 r>-> <v k_prop/statement/39$65 Set67 rn>
    
    time         0% fanout         0 input         0 rows
    Warning: the cardinality estimate of the cost model differs greatly from the measured time. Cardinality estimate:   1.4e-07 Fanout:         0
      clear: (<V s_37_3_t0.S$34 rn>)
      clear on continue: (<V s_37_3_t0.S$34 rn>)$31 () $80 (33 ) 
    s# 76 33 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    1.4e-07 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_3_t0.S$34 rn>)
     P =  IRI_ID"...prop/P39"  ,  O = <v cast$80 Set82 an>
    vector param casts: <V s_37_7_t1.S$31 rn>-> <v cast$80 Set82 an>
    
    time         0% fanout         0 input         0 rows
      clear: (<V var1$38 a>, <V var2$36 a>)$34 () $30 (33 ) 
    s# 90 50 skip node  100  <none> <r set_ctr$46 via  Set76 Set82 Set61 Set67>
    After code:
      0: <V var2$36 a> := Call __ro2sq (<r s_37_7_t1.O$30 via  Set90 Set76 Set82>)
      5: <V var1$38 a> := Call __id2in (<r s_37_3_t0.S$34 via  Set90>)
      10: BReturn 0
    time         0% fanout         0 input         0 rows
    $36 (50 ) $38 (50 ) $46 (50 33 29 47 ) 
    s# 98 40 Select (<V var1$38 a>, <V var2$36 a>, <DB_NULL>, <DB_NULL>, <DB_NULL>)
      set no: <r set_ctr$46 via  Set90 Set76 Set82 Set61 Set67>
  }
Warning: You might have a Cartesian product.



 0 msec 8% cpu,         4 rnd         0 seq         0% same seg         0% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw
