http://www.wikidata.org/entity/Q1039325	
http://www.wikidata.org/entity/Q11430357	
http://www.wikidata.org/entity/Q1399486	
http://www.wikidata.org/entity/Q1492003	
http://www.wikidata.org/entity/Q7631076	
http://www.wikidata.org/entity/Q28056455	
http://www.wikidata.org/entity/Q1662024	
http://www.wikidata.org/entity/Q2254880	
http://www.wikidata.org/entity/Q30059	
http://www.wikidata.org/entity/Q1286517	
http://www.wikidata.org/entity/Q20180892	
http://www.wikidata.org/entity/Q779100	
http://www.wikidata.org/entity/Q422692	
http://www.wikidata.org/entity/Q3487662	
http://www.wikidata.org/entity/Q28191971	
http://www.wikidata.org/entity/Q2449385	
http://www.wikidata.org/entity/Q3575366	
http://www.wikidata.org/entity/Q1251271	
http://www.wikidata.org/entity/Q2073106	
http://www.wikidata.org/entity/Q2753059	

  { 
    time         2% fanout         1 input         1 rows
      clear: (<V set_ctr$57 in>)
    s# 60 58 cluster outer seq start, set no <V set_ctr$57 in>    
    save ctx:()
      clear: (<V var1$28 rn>, <V set_no$29 i>, <V var1$49 a>)
    s# 69 27 Subquery 27 
      multistate set no = <V set_no$29 i>
      { 
        time        30% fanout        23 input         1 rows
          clear: (<V s_37_2_t0.S$31 rn>)
          clear on continue: (<V s_37_2_t0.S$31 rn>)
        s# 73 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS         23 rows   
        Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
         P =  IRI_ID"...direct/P279"  ,  O =  IRI_ID"...Q1496967" 
        
        time        62% fanout         1 input        23 rows
        
        s# 83 33 Distinct (HASH) set no <r set_no$29 via  Set73>(<V s_37_2_t0.S$31 rn>)
        time       3.8% fanout         1 input        23 rows
          clear: (<V var1$28 rn>)$31 (33 ) 
        s# 91 47 skip node  10000  <none> <r set_no$29 via  Set83 Set73>
        After code:
          0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set91 Set83>
          4: BReturn 0
        time      0.68% fanout         0 input        23 rows
        
        s# 69 39 Subquery Select(<V var1$28 rn>)
          set no: <r set_no$29 via  Set91 Set83 Set73>
      }
    
    After code:
      0: <V var1$49 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time      0.62% fanout         0 input        23 rows
    $49 (27 ) $57 (27 58 ) 
    s# 107 51 Select (<V var1$49 a>)
      set no: <r set_ctr$57 via  Set69>
  }
Warning: You might have a Cartesian product.



 0 msec 1% cpu,        22 rnd        22 seq         0% same seg         0% same pg 
Compilation: 28 msec 0 reads         0% read 0 messages         0% clw
