http://www.wikidata.org/entity/Q2785494	
http://www.wikidata.org/entity/Q2791116	
http://www.wikidata.org/entity/Q2916964	
http://www.wikidata.org/entity/Q2988461	
http://www.wikidata.org/entity/Q9124527	
http://www.wikidata.org/entity/Q15835023	
http://www.wikidata.org/entity/Q16195602	
http://www.wikidata.org/entity/Q16195649	
http://www.wikidata.org/entity/Q16195669	
http://www.wikidata.org/entity/Q16195708	
http://www.wikidata.org/entity/Q16195780	
http://www.wikidata.org/entity/Q16195801	
http://www.wikidata.org/entity/Q16195806	
http://www.wikidata.org/entity/Q16295147	
http://www.wikidata.org/entity/Q16297835	
http://www.wikidata.org/entity/Q16299424	
http://www.wikidata.org/entity/Q16300747	
http://www.wikidata.org/entity/Q16301438	
http://www.wikidata.org/entity/Q32533149	
http://www.wikidata.org/entity/Q41254492	

  { 
    time     0.034% fanout         1 input         1 rows
      clear: (<V set_ctr$55 in>)
    s# 58 56 cluster outer seq start, set no <V set_ctr$55 in>    
    save ctx:()
    time    0.0084% fanout         1 input         1 rows
      clear: (<V set_no$29 i>)
    s# 67 46 cluster outer seq start, set no <V set_no$29 i>    
    save ctx:()
    time        11% fanout      1000 input         1 rows
      clear: (<V s_37_2_t0.S$31 rn>)
      clear on continue: (<V s_37_2_t0.S$31 rn>)
    s# 76 30 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS    3.8e+03 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_37_2_t0.S$31 rn>)
     P =  IRI_ID"...direct/P569"  ,  O >= <tag 211 c 1964-01-01 00:00:00Z> <= <tag 211 c 1964-12-31 23:59:59Z>
    row specs:  O >= <tag 211 c 1964-01-01 00:00:00Z> <= <tag 211 c 1964-12-31 23:59:59Z>
    
    time       2.9% fanout     0.999 input      1000 rows
      clear: (<V var1$28 rn>)$31 () 
    s# 86 33 Distinct (HASH) set no <r set_no$29 via  Set76>(<V s_37_2_t0.S$31 rn>)
    After code:
      0: <V var1$28 rn> :=  := artm <r s_37_2_t0.S$31 via  Set86>
      4: BReturn 0
    time        86% fanout         1 input       999 rows
      clear: (<V var1$47 a>)$28 (33 ) $29 (33 30 46 ) 
    s# 95 39 Subquery Select(<V var1$28 rn>)
      set no: <r set_no$29 via  Set86 Set76>
    After code:
      0: <V var1$47 a> := Call __ro2sq (<V var1$28 rn>)
      5: BReturn 0
    time     0.012% fanout         0 input       999 rows
    $47 (39 ) $55 (39 33 30 46 56 ) 
    s# 102 49 Select (<V var1$47 a>)
      set no: <r set_ctr$55 via  Set95>
  }
Warning: You might have a Cartesian product.



 10 msec 75% cpu,       987 rnd      7837 seq         0% same seg   17.6113% same pg 
Compilation: 2 msec 0 reads         0% read 0 messages         0% clw
