OpenLink Virtuoso Interactive SQL (Virtuoso)
Version 07.20.3232 as of May 11 2021
Type HELP; for help and EXIT; to exit.
Connected to OpenLink Virtuoso
Driver: 07.20.3232 OpenLink Virtuoso ODBC Driver
}SPARQL_TO_SQL_TEXT
LONG VARCHAR
_______________________________________________________________________________

SELECT __id2in ( "s_9_4_t0"."S") AS "person",
  __ro2sq ( "s_9_4_t1"."O") AS "givenName"
FROM DB.DBA.RDF_QUAD AS "s_9_4_t0"
  INNER JOIN DB.DBA.RDF_QUAD AS "s_9_4_t1"
  ON (
    "s_9_4_t0"."S" = "s_9_4_t1"."S")
WHERE
  "s_9_4_t0"."P" = __i2idn ( __bft( 'http://www.w3.org/2006/vcard/ns#family-name' , 1))
  AND 
  "s_9_4_t0"."O" = DB.DBA.RDF_OBJ_OF_SQLVAL ( 'Smith' )
  AND 
  "s_9_4_t1"."P" = __i2idn ( __bft( 'http://www.w3.org/2006/vcard/ns#given-name' , 1))
OPTION (QUIETCAST)

1 Rows. -- 2 msec.

Done. -- 1 msec.

Done. -- 0 msec.
result
LONG VARCHAR
_______________________________________________________________________________

http://www.snee.com/hr/emp2	John	
http://www.snee.com/hr/emp1	Heidi	

  { 
    time       1.7% fanout         1 input         1 rows
      clear: (<V set_ctr$45 in>)
    s# 48 46 cluster outer seq start, set no <V set_ctr$45 in>    
    save ctx:()
    time        27% fanout         2 input         1 rows
    Precode:
      0: <V __rdflit$27 x> := Call __rdflit (rdflit1046)
      5: BReturn 0
      clear: (<V s_9_4_t0.S$30 rn>, <V __rdflit$27 x>)
      clear on continue: (<V s_9_4_t0.S$30 rn>)
    s# 57 29 from DB.DBA.RDF_QUAD by RDF_QUAD_POGS          2 rows   
    Key RDF_QUAD_POGS  ASC  (<V s_9_4_t0.S$30 rn>)
     P =  IRI_ID"...family-name"  ,  O = rdflit1046
    
    time        71% fanout         1 input         2 rows
      clear: (<V s_9_4_t1.O$33 an>, <V givenName$37 a>, <V person$35 a>)
      clear on continue: (<V s_9_4_t1.O$33 an>, <V givenName$37 a>, <V person$35 a>)$30 () 
    s# 67 32 from DB.DBA.RDF_QUAD by RDF_QUAD          1 rows   
    Key RDF_QUAD  ASC  (<V s_9_4_t1.O$33 an>)
     inlined  P =  IRI_ID"...given-name"  ,  S = <V s_9_4_t0.S$30 rn>
    
    After code:
      0: <V person$35 a> := Call __id2in (<r s_9_4_t0.S$30 via  Set67>)
      5: <V givenName$37 a> := Call __ro2sq (<V s_9_4_t1.O$33 an>)
      10: BReturn 0
    time      0.19% fanout         0 input         2 rows
    $35 () $37 () $45 (32 29 46 ) 
    s# 77 39 Select (<V person$35 a>, <V givenName$37 a>)
      set no: <r set_ctr$45 via  Set67 Set57>
  }
Warning: You might have a Cartesian product.



 0 msec 14% cpu,         5 rnd         1 seq   16.6667% same seg   16.6667% same pg 
Compilation: 1 msec 0 reads         0% read 0 messages         0% clw

4 Rows. -- 18 msec.
}